nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>IEE__RT1170</name>
      <description>IEE</description>
      <alternatePeripheral>AUDIO_PLL</alternatePeripheral>
      <groupName>IEE</groupName>
      <baseAddress>0</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100000000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GCFG</name>
          <description>IEE Global Configuration</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RL0</name>
              <description>Region lock 0 bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RL0_0</name>
                  <description>Unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RL0_1</name>
                  <description>Key, Offset and Attribute registers are locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RL1</name>
              <description>Region lock 1 bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RL1_0</name>
                  <description>Unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RL1_1</name>
                  <description>Key, Offset and Attribute registers are locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RL2</name>
              <description>Region lock 2 bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RL2_0</name>
                  <description>Unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RL2_1</name>
                  <description>Key, Offset and Attribute registers are locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RL3</name>
              <description>Region lock 3 bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RL3_0</name>
                  <description>Unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RL3_1</name>
                  <description>Key, Offset and Attribute registers are locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RL4</name>
              <description>Region lock 4 bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RL4_0</name>
                  <description>Unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RL4_1</name>
                  <description>Key, Offset and Attribute registers are locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RL5</name>
              <description>Region lock 5 bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RL5_0</name>
                  <description>Unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RL5_1</name>
                  <description>Key, Offset and Attribute registers are locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RL6</name>
              <description>Region lock 6 bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RL6_0</name>
                  <description>Unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RL6_1</name>
                  <description>Key, Offset and Attribute registers are locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RL7</name>
              <description>Region lock 7 bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RL7_0</name>
                  <description>Unlocked.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RL7_1</name>
                  <description>Key, Offset and Attribute registers are locked.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TME</name>
              <description>Test mode enable bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TME_0</name>
                  <description>Disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TME_1</name>
                  <description>Enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMD</name>
              <description>Test mode disable bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMD_0</name>
                  <description>Test mode is usable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMD_1</name>
                  <description>Test mode is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPA_DIS</name>
              <description>Differential power analysis (DPA) disable bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPA_DIS_0</name>
                  <description>DPA enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPA_DIS_1</name>
                  <description>DPA disabled. AES DPA is disabled for testing.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEY_RD_DIS</name>
              <description>Key read disable bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>KEY_RD_DIS_0</name>
                  <description>Key read enabled. Reading the key registers is allowed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEY_RD_DIS_1</name>
                  <description>Key read disabled. Reading the key registers is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MON_EN</name>
              <description>Monitor enable bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MON_EN_0</name>
                  <description>Performance monitoring disabled. Writing of the performance counter registers is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MON_EN_1</name>
                  <description>Performance monitoring enabled. Writing of the performance counter registers is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLR_MON</name>
              <description>Clear monitor bit. Setting this bit resets the IEE performance counters to zero.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR_MON_0</name>
                  <description>Do not reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLR_MON_1</name>
                  <description>Reset performance counters.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RST</name>
              <description>Reset bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RST_0</name>
                  <description>Do Not Reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RST_1</name>
                  <description>Reset IEE.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STA</name>
          <description>IEE Status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DSR</name>
              <description>DPA seed request bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AFD</name>
              <description>AES fault detected bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSTMD</name>
          <description>IEE Test Mode Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TMRDY</name>
              <description>Test mode ready bit. All AXI transactions have stopped and test can begin.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMRDY_0</name>
                  <description>Not Ready.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMRDY_1</name>
                  <description>Ready.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR</name>
              <description>Test mode run bit. Set bit to start AES test. Cannot be set unless TMRDY=1.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMR_0</name>
                  <description>Not running. may be written if IEE_GCFG[TME] = 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR_1</name>
                  <description>Run AES Test until TMDONE is indicated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMENCR</name>
              <description>Test mode encrypt/decrypt bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMENCR_0</name>
                  <description>AES Test mode will do decryption.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMENCR_1</name>
                  <description>AES Test mode will do encryption.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMCONT</name>
              <description>Test mode continue bit. Set to indicate that operation will be followed by more data.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMCONT_0</name>
                  <description>Not continue. This is the last block of data for AES.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMCONT_1</name>
                  <description>Continue. Don't initialize AES after this block.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMDONE</name>
              <description>Test mode done bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TMDONE_0</name>
                  <description>Not Done.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMDONE_1</name>
                  <description>Test Done.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMLEN</name>
              <description>Test mode length field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DPAMS</name>
          <description>AES Mask Generation Seed</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPAMS</name>
              <description>DPA mask seed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KBCR</name>
          <description>IEE Keystream Buffer Configuration Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x300</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUF_CNT</name>
              <description>Buffer count. Number of keystream buffers enabled. Can be 0 to 4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUF_CNT_0</name>
                  <description>0 buffers enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_CNT_1</name>
                  <description>1 buffer enabled. Entire buffer will be used for 1 region.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_CNT_2</name>
                  <description>2 buffers enabled. Buffer is split into 2 regions.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_CNT_3</name>
                  <description>3 buffers enabled. Buffer is split into 4 regions; 4th region is unused</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_CNT_4</name>
                  <description>4 buffers enabled. Buffer is split into 4 regions.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_CNT_5</name>
                  <description>4 buffers enabled. Buffer is split into 4 regions.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_CNT_6</name>
                  <description>4 buffers enabled. Buffer is split into 4 regions.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUF_CNT_7</name>
                  <description>4 buffers enabled. Buffer is split into 4 regions.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLK_LD_SIZE</name>
              <description>Block load size. Number of blocks to load per access.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLK_LD_SIZE_0</name>
                  <description>2 blocks.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK_LD_SIZE_1</name>
                  <description>4 blocks.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK_LD_SIZE_2</name>
                  <description>8 blocks.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLK_LD_SIZE_3</name>
                  <description>16 blocks.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_S_LT</name>
          <description>Performance Counter, AES Slave Latency Threshold Value</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_LT</name>
              <description>Slave write latency threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SR_LT</name>
              <description>Slave read latency threshold.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_M_LT</name>
          <description>Performance Counter, AES Master Latency Threshold</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MW_LT</name>
              <description>Master write latency threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MR_LT</name>
              <description>Master read latency threshold.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
