nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>PC_BLK_ENC</name>
          <description>Performance Counter, Number of AES Block Encryptions</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLK_ENC</name>
              <description>Number of AES block encryptions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_BLK_DEC</name>
          <description>Performance Counter, Number of AES Block Decryptions</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLK_DEC</name>
              <description>Number of AES block decryptions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_SR_TRANS</name>
          <description>Performance Counter, Number of AXI Slave Read Transactions</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SR_TRANS</name>
              <description>Number of slave read transactions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_SW_TRANS</name>
          <description>Performance Counter, Number of AXI Slave Write Transactions</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TRANS</name>
              <description>Number of slave write transactions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_MR_TRANS</name>
          <description>Performance Counter, Number of AXI Master Read Transactions</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MR_TRANS</name>
              <description>Number of master read transactions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_MW_TRANS</name>
          <description>Performance Counter, Number of AXI Master Write Transactions</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MW_TRANS</name>
              <description>Number of master write transactions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_M_MBR</name>
          <description>Performance Counter, Number of AXI Master Merge Buffer Read Transactions</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M_MBR</name>
              <description>Number of master merge buffer read transactions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_SR_TBC</name>
          <description>Performance Counter, Slave Read Transactions Byte Count</description>
          <addressOffset>0x70</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SR_TBC</name>
              <description>Number of bytes in slave read transactions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>48</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_SW_TBC</name>
          <description>Performance Counter, Slave Write Transactions Byte Count</description>
          <addressOffset>0x78</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TBC</name>
              <description>Number of bytes in slave write transactions.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>48</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_MR_TBC</name>
          <description>Performance Counter, Master Read Transactions Byte Count</description>
          <addressOffset>0x80</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MR_TBC_LSB</name>
              <description>Number of bytes in master read transactions. 4 LSBs, always 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MR_TBC</name>
              <description>Number of bytes in master read transactions. 44 MSBs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>44</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_MW_TBC</name>
          <description>Performance Counter, Master Write Transactions Byte Count</description>
          <addressOffset>0x88</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MW_TBC_LSB</name>
              <description>Number of bytes in master write transactions. 4 LSBs, always 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MW_TBC</name>
              <description>Number of bytes in master write transactions. 44 MSBs.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>44</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_SR_TLGTT</name>
          <description>Performance Counter, Number of AXI Slave Read Transactions with Latency Greater than the Threshold</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SR_TLGTT</name>
              <description>Number of slave read transactions with latency greater than the threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_SW_TLGTT</name>
          <description>Performance Counter, Number of AXI Slave Write Transactions with Latency Greater than the Threshold</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TLGTT</name>
              <description>Number of slave write transactions with latency greater than the threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_MR_TLGTT</name>
          <description>Performance Counter, Number of AXI Master Read Transactions with Latency Greater than the Threshold</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MR_TLGTT</name>
              <description>Number of master read transactions with latency greater than the threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_MW_TLGTT</name>
          <description>Performance Counter, Number of AXI Master Write Transactions with Latency Greater than the Threshold</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MW_TGTT</name>
              <description>Number of master write transactions with latency greater than the threshold.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_SR_TLAT</name>
          <description>Performance Counter, Slave Read Latency Count</description>
          <addressOffset>0xA0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SR_TLAT</name>
              <description>Total slave read latency.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>48</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_SW_TLAT</name>
          <description>Performance Counter, Slave Write Latency Count</description>
          <addressOffset>0xA8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TLAT</name>
              <description>Total slave write latency.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>48</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_MR_TLAT</name>
          <description>Performance Counter, Master Read Latency Count</description>
          <addressOffset>0xB0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MR_TLAT</name>
              <description>Total master read latency.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>48</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_MW_TLAT</name>
          <description>Performance Counter, Master Write Latency Count</description>
          <addressOffset>0xB8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MW_TLAT</name>
              <description>Total master write latency.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>48</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_SR_TNRT</name>
          <description>Performance Counter, Slave Read Total Non-Responding Time</description>
          <addressOffset>0xC0</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SR_TNRT</name>
              <description>Total slave read non-responding time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>48</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PC_SW_TNRT</name>
          <description>Performance Counter, Slave Write Total Non-Responding Time</description>
          <addressOffset>0xC8</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TNRT</name>
              <description>Total slave write non-responding time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>48</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VIDR1</name>
          <description>IEE Version ID Register 1</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x340102</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MIN_REV</name>
              <description>Minor revision number for IEE.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJ_REV</name>
              <description>Major revision number for IEE.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IP_ID</name>
              <description>ID for IEE.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AESVID</name>
          <description>IEE AES Version ID Register</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x20</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AESRN</name>
              <description>AES revision number.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AESVID</name>
              <description>AES version ID.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>REGx[%s]</name>
          <description>Region Registers</description>
          <addressOffset>0x100</addressOffset>
          <register>
            <name>REGATTR</name>
            <description>IEE Region REGION Attribute Register.</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>KS</name>
                <description>AES key size.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>KS_0</name>
                    <description>128 bits (CTR), 256 bits (XTS).</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>KS_1</name>
                    <description>256 bits (CTR), 512 bits (XTS).</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>MD</name>
                <description>AES Mode.</description>
                <bitOffset>4</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MD_0</name>
                    <description>None (AXI error if accessed)</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MD_1</name>
                    <description>XTS</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MD_2</name>
                    <description>CTR w/ address binding</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MD_3</name>
                    <description>CTR w/o address binding</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MD_4</name>
                    <description>CTR keystream only</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MD_5</name>
                    <description>Undefined, AXI error if used</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MD_6</name>
                    <description>Undefined, AXI error if used</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MD_7</name>
                    <description>Undefined, AXI error if used</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>BYP</name>
                <description>AES Bypass.</description>
                <bitOffset>7</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>BYP_0</name>
                    <description>use MD field</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BYP_1</name>
                    <description>Bypass AES, no encrypt/decrypt</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>REGPO</name>
            <description>IEE Region REGION Page Offset Register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PGOFF</name>
                <description>This field represents a 4Kb page offset</description>
                <bitOffset>0</bitOffset>
                <bitWidth>24</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
            <name>REGKEY1_%s</name>
            <description>IEE Region REGION Key 1 Register</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>KEY1</name>
                <description>Key 1.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>8</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
            <name>REGKEY2_%s</name>
            <description>IEE Region REGION Key 2 Register</description>
            <addressOffset>0x80</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>KEY2</name>
                <description>Key 2.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>write-only</access>
              </field>
            </fields>
          </register>
        </cluster>
