nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
                  <name>CUT_PREDIV_68</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_69</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_70</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_71</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_72</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_73</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_74</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x4A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_75</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x4B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_76</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x4C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_77</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x4D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_78</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x4E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_79</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x4F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_80</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_81</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_82</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_83</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_84</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_85</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_86</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_87</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_88</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_89</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_90</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x5A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_91</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x5B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_92</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x5C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_93</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x5D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_94</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x5E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_95</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x5F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_96</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_97</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_98</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_99</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_100</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_101</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x65</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_102</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x66</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_103</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x67</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_104</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x68</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_105</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x69</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_106</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x6A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_107</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x6B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_108</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x6C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_109</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x6D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_110</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x6E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_111</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x6F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_112</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x70</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_113</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_114</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_115</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_116</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_117</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_118</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_119</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_120</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_121</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_122</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x7A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_123</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x7B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_124</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x7C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_125</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x7D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_126</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x7E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_127</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x7F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_128</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_129</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_130</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x82</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_131</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x83</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_132</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x84</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_133</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x85</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_134</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x86</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_135</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x87</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_136</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x88</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_137</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x89</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_138</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x8A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_139</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x8B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_140</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x8C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_141</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x8D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_142</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x8E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_143</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x8F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_144</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x90</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_145</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x91</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_146</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x92</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_147</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x93</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_148</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x94</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_149</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x95</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_150</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x96</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_151</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x97</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_152</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x98</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_153</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x99</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_154</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x9A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_155</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x9B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_156</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x9C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_157</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x9D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_158</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x9E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_159</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0x9F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_160</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_161</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_162</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_163</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_164</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_165</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_166</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_167</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_168</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_169</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
                  <value>0xA9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CUT_PREDIV_170</name>
                  <description>Divide by CUT_PREDIV - CUT_PREDIV%2</description>
