nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>ERR_SIG_EN</name>
          <description>Error Interrupt Enable Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR0_SIG_EN</name>
              <description>Single Bit Error Interrupt Enable On Ocram Bank0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_ERR0_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_ERR0_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGLE_ERR1_SIG_EN</name>
              <description>Single Bit Error Interrupt Enable On Ocram Bank1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_ERR1_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_ERR1_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGLE_ERR2_SIG_EN</name>
              <description>Single Bit Error Interrupt Enable On Ocram Bank2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_ERR2_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_ERR2_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SINGLE_ERR3_SIG_EN</name>
              <description>Single Bit Error Interrupt Enable On Ocram Bank3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE_ERR3_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SINGLE_ERR3_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTI_ERR0_SIG_EN</name>
              <description>Multiple Bits Error Interrupt Enable On Ocram Bank0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTI_ERR0_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI_ERR0_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTI_ERR1_SIG_EN</name>
              <description>Multiple Bits Error Interrupt Enable On Ocram Bank1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTI_ERR1_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI_ERR1_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTI_ERR2_SIG_EN</name>
              <description>Multiple Bits Error Interrupt Enable On Ocram Bank2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTI_ERR2_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI_ERR2_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MULTI_ERR3_SIG_EN</name>
              <description>Multiple Bits Error Interrupt Enable On Ocram Bank3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MULTI_ERR3_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MULTI_ERR3_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRB_ERR0_SIG_EN</name>
              <description>AXI Strobe Error Interrupt Enable On Ocram Bank0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STRB_ERR0_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STRB_ERR0_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRB_ERR1_SIG_EN</name>
              <description>AXI Strobe Error Interrupt Enable On Ocram Bank1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STRB_ERR1_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STRB_ERR1_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRB_ERR2_SIG_EN</name>
              <description>AXI Strobe Error Interrupt Enable On Ocram Bank2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STRB_ERR2_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STRB_ERR2_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STRB_ERR3_SIG_EN</name>
              <description>AXI Strobe Error Interrupt Enable On Ocram Bank3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STRB_ERR3_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STRB_ERR3_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_ERR0_SIG_EN</name>
              <description>Ocram Access Error Interrupt Enable On Bank0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_ERR0_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_ERR0_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_ERR1_SIG_EN</name>
              <description>Ocram Access Error Interrupt Enable On Bank1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_ERR1_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_ERR1_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_ERR2_SIG_EN</name>
              <description>Ocram Access Error Interrupt Enable On Bank2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_ERR2_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_ERR2_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDR_ERR3_SIG_EN</name>
              <description>Ocram Access Error Interrupt Enable On Bank3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDR_ERR3_SIG_EN_0</name>
                  <description>Masked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDR_ERR3_SIG_EN_1</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_DATA_INJ_LOW0</name>
          <description>Error Injection On Low 32 bits Of Ocram Bank0 Write Data</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_DATA_INJ_LOW0</name>
              <description>Error Injection On Low 32 bits Of Ocram Bank0 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_DATA_INJ_HIGH0</name>
          <description>Error Injection On High 32 bits Of Ocram Bank0 Write Data</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_DATA_INJ_HIGH0</name>
              <description>Error Injection On High 32 bits Of Ocram Bank0 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_ECC_INJ0</name>
          <description>Error Injection On 8 bits ECC code Of Ocram Bank0 Write Data</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_ECC_INJ0</name>
              <description>Error Injection On 8 bits ECC code Of Ocram Bank0 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_DATA_INJ_LOW1</name>
          <description>Error Injection On Low 32 bits Of Ocram Bank1 Write Data</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_DATA_INJ_LOW1</name>
              <description>Error Injection On Low 32 bits Of Ocram Bank1 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_DATA_INJ_HIGH1</name>
          <description>Error Injection On High 32 bits Of Ocram Bank1 Write Data</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_DATA_INJ_HIGH1</name>
              <description>Error Injection On High 32 bits Of Ocram Bank1 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_ECC_INJ1</name>
          <description>Error Injection On 8 bits ECC code Of Ocram Bank1 Write Data</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_ECC_INJ1</name>
              <description>Error Injection On 8 bits ECC code Of Ocram Bank1 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_DATA_INJ_LOW2</name>
          <description>Error Injection On Low 32 bits Of Ocram Bank2 Write Data</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_DATA_INJ_LOW2</name>
              <description>Error Injection On Low 32 bits Of Ocram Bank2 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_DATA_INJ_HIGH2</name>
          <description>Error Injection On High 32 bits Of Ocram Bank2 Write Data</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_DATA_INJ_HIGH2</name>
              <description>Error Injection On High 32 bits Of Ocram Bank2 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_ECC_INJ2</name>
          <description>Error Injection On 8 bits ECC code Of Ocram Bank2 Write Data</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_ECC_INJ2</name>
              <description>Error Injection On 8 bits ECC code Of Ocram Bank2 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_DATA_INJ_LOW3</name>
          <description>Error Injection On Low 32 bits Of Ocram Bank3 Write Data</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_DATA_INJ_LOW3</name>
              <description>Error Injection On Low 32 bits Of Ocram Bank3 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_DATA_INJ_HIGH3</name>
          <description>Error Injection On High 32 bits Of Ocram Bank3 Write Data</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_DATA_INJ_HIGH2</name>
              <description>Error Injection On High 32 bits Of Ocram Bank2 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR_ECC_INJ3</name>
          <description>Error Injection On 8 bits ECC code Of Ocram Bank3 Write Data</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERR_ECC_INJ3</name>
              <description>Error Injection On 8 bits ECC code Of Ocram Bank3 Write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_ADDR_ECC0</name>
          <description>Single Error Address And ECC Code On Ocram Bank0</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_ECC0</name>
              <description>Single Error ECC Code On Ocram Bank0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SINGLE_ERR_ADDR0</name>
              <description>Single Error Address On Ocram Bank0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
