nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SINGLE_ERR_DATA_LOW0</name>
          <description>Low 32 Bits Single Error Read Data On Ocram Bank0</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_DATA_LOW0</name>
              <description>Low 32 Bits Single Error Read Data On Ocram Bank0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_DATA_HIGH0</name>
          <description>High 32 Bits Single Error Read Data On Ocram Bank0</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_DATA_HIGH0</name>
              <description>High 32 Bits Single Error Read Data On Ocram Bank0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_POS_LOW0</name>
          <description>Low Single Error Bit Position On Ocram Bank0</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_POS_LOW0</name>
              <description>Low Single Error Bit Position On Ocram Bank0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_POS_HIGH0</name>
          <description>High Single Error Bit Position On Ocram Bank0</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_POS_HIGH0</name>
              <description>High Single Error Bit Position On Ocram Bank0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_ADDR_ECC1</name>
          <description>Single Error Address And ECC Code On Ocram Bank1</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_ECC1</name>
              <description>Single Error ECC Code On Ocram Bank1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SINGLE_ERR_ADDR1</name>
              <description>Single Error Address On Ocram Bank1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_DATA_LOW1</name>
          <description>Low 32 Bits Single Error Read Data On Ocram Bank1</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_DATA_LOW1</name>
              <description>Low 32 Bits Single Error Read Data On Ocram Bank1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_DATA_HIGH1</name>
          <description>High 32 Bits Single Error Read Data On Ocram Bank1</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_DATA_HIGH1</name>
              <description>High 32 Bits Single Error Read Data On Ocram Bank1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_POS_LOW1</name>
          <description>Low Single Error Bit Position On Ocram Bank1</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_POS_LOW1</name>
              <description>Low Single Error Bit Position On Ocram Bank1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_POS_HIGH1</name>
          <description>High Single Error Bit Position On Ocram Bank1</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_POS_HIGH1</name>
              <description>High Single Error Bit Position On Ocram Bank1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_ADDR_ECC2</name>
          <description>Single Error Address And ECC Code On Ocram Bank2</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_ECC2</name>
              <description>Single Error ECC Code On Ocram Bank2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SINGLE_ERR_ADDR2</name>
              <description>Single Error Address On Ocram Bank2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_DATA_LOW2</name>
          <description>Low 32 Bits Single Error Read Data On Ocram Bank2</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_DATA_LOW2</name>
              <description>Low 32 Bits Single Error Read Data On Ocram Bank2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_DATA_HIGH2</name>
          <description>High 32 Bits Single Error Read Data On Ocram Bank2</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_DATA_HIGH2</name>
              <description>High 32 Bits Single Error Read Data On Ocram Bank2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_POS_LOW2</name>
          <description>Low Single Error Bit Position On Ocram Bank2</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_POS_LOW2</name>
              <description>Low Single Error Bit Position On Ocram Bank2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_POS_HIGH2</name>
          <description>High Single Error Bit Position On Ocram Bank2</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_POS_HIGH2</name>
              <description>High Single Error Bit Position On Ocram Bank2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_ADDR_ECC3</name>
          <description>Single Error Address And ECC Code On Ocram Bank3</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_ECC3</name>
              <description>Single Error ECC Code On Ocram Bank3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SINGLE_ERR_ADDR3</name>
              <description>Single Error Address On Ocram Bank3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_DATA_LOW3</name>
          <description>Low 32 Bits Single Error Read Data On Ocram Bank3</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_DATA_LOW3</name>
              <description>Low 32 Bits Single Error Read Data On Ocram Bank3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_DATA_HIGH3</name>
          <description>High 32 Bits Single Error Read Data On Ocram Bank3</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_DATA_HIGH3</name>
              <description>High 32 Bits Single Error Read Data On Ocram Bank3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_POS_LOW3</name>
          <description>Low Single Error Bit Position On Ocram Bank3</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_POS_LOW3</name>
              <description>Low Single Error Bit Position On Ocram Bank3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SINGLE_ERR_POS_HIGH3</name>
          <description>High Single Error Bit Position On Ocram Bank3</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SINGLE_ERR_POS_HIGH3</name>
              <description>High Single Error Bit Position On Ocram Bank3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_ERR_ADDR_ECC0</name>
          <description>Multiple Error Address And ECC Code On Ocram Bank0</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MULTI_ERR_ECC0</name>
              <description>Multiple Error ECC Code On Ocram Bank0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULTI_ERR_ADDR0</name>
              <description>Multiple Error Address On Ocram Bank0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_ERR_DATA_LOW0</name>
          <description>Low 32 Bits Multiple Error Read Data On Ocram Bank0</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MULTI_ERR_DATA_LOW0</name>
              <description>Low 32 Bits Multiple Error Read Data On Ocram Bank0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_ERR_DATA_HIGH0</name>
          <description>High 32 Bits Multiple Error Read Data On Ocram Bank0</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MULTI_ERR_DATA_HIGH0</name>
              <description>High 32 Bits Multiple Error Read Data On Ocram Bank0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_ERR_ADDR_ECC1</name>
          <description>Multiple Error Address And ECC Code On Ocram Bank1</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MULTI_ERR_ECC1</name>
              <description>Multiple Error ECC Code On Ocram Bank1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULTI_ERR_ADDR1</name>
              <description>Multiple Error Address On Ocram Bank1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_ERR_DATA_LOW1</name>
          <description>Low 32 Bits Multiple Error Read Data On Ocram Bank1</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MULTI_ERR_DATA_LOW1</name>
              <description>Low 32 Bits Multiple Error Read Data On Ocram Bank1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_ERR_DATA_HIGH1</name>
          <description>High 32 Bits Multiple Error Read Data On Ocram Bank1</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MULTI_ERR_DATA_HIGH1</name>
              <description>High 32 Bits Multiple Error Read Data On Ocram Bank1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_ERR_ADDR_ECC2</name>
          <description>Multiple Error Address And ECC Code On Ocram Bank2</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MULTI_ERR_ECC2</name>
              <description>Multiple Error ECC Code On Ocram Bank2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULTI_ERR_ADDR2</name>
              <description>Multiple Error Address On Ocram Bank2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_ERR_DATA_LOW2</name>
          <description>Low 32 Bits Multiple Error Read Data On Ocram Bank2</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MULTI_ERR_DATA_LOW2</name>
              <description>Low 32 Bits Multiple Error Read Data On Ocram Bank2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_ERR_DATA_HIGH2</name>
          <description>High 32 Bits Multiple Error Read Data On Ocram Bank2</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MULTI_ERR_DATA_HIGH2</name>
              <description>High 32 Bits Multiple Error Read Data On Ocram Bank2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MULTI_ERR_ADDR_ECC3</name>
          <description>Multiple Error Address And ECC Code On Ocram Bank3</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MULTI_ERR_ECC3</name>
              <description>Multiple Error ECC Code On Ocram Bank3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MULTI_ERR_ADDR3</name>
              <description>Multiple Error Address On Ocram Bank3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>19</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>Reserved1</name>
              <description>Reserved</description>
              <bitOffset>27</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
