nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>INT_STATUS</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ITCM_MAM_STATUS</name>
              <description>ITCM Magic Address Match Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM_MAM_STATUS_0</name>
                  <description>ITCM did not access magic address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM_MAM_STATUS_1</name>
                  <description>ITCM accessed magic address.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCM_MAM_STATUS</name>
              <description>DTCM Magic Address Match Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTCM_MAM_STATUS_0</name>
                  <description>DTCM did not access magic address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTCM_MAM_STATUS_1</name>
                  <description>DTCM accessed magic address.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_MAM_STATUS</name>
              <description>OCRAM Magic Address Match Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCRAM_MAM_STATUS_0</name>
                  <description>OCRAM did not access magic address.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCRAM_MAM_STATUS_1</name>
                  <description>OCRAM accessed magic address.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITCM_ERR_STATUS</name>
              <description>ITCM Access Error Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM_ERR_STATUS_0</name>
                  <description>ITCM access error does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM_ERR_STATUS_1</name>
                  <description>ITCM access error happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTCM_ERR_STATUS</name>
              <description>DTCM Access Error Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DTCM_ERR_STATUS_0</name>
                  <description>DTCM access error does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DTCM_ERR_STATUS_1</name>
                  <description>DTCM access error happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_ERR_STATUS</name>
              <description>OCRAM Access Error Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCRAM_ERR_STATUS_0</name>
                  <description>OCRAM access error does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCRAM_ERR_STATUS_1</name>
                  <description>OCRAM access error happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_ECC_ERRM_INT</name>
              <description>OCRAM access multi-bit ECC Error Interrupt Status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCRAM_ECC_ERRM_INT_0</name>
                  <description>OCRAM multi-bit ECC error does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCRAM_ECC_ERRM_INT_1</name>
                  <description>OCRAM multi-bit ECC error happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_ECC_ERRS_INT</name>
              <description>OCRAM access single-bit ECC Error Interrupt Status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCRAM_ECC_ERRS_INT_0</name>
                  <description>OCRAM single-bit ECC error does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCRAM_ECC_ERRS_INT_1</name>
                  <description>OCRAM single-bit ECC error happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITCM_ECC_ERRM_INT</name>
              <description>ITCM Access multi-bit ECC Error Interrupt Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM_ECC_ERRM_INT_0</name>
                  <description>ITCM multi-bit ECC error does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM_ECC_ERRM_INT_1</name>
                  <description>ITCM multi-bit ECC error happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITCM_ECC_ERRS_INT</name>
              <description>ITCM access single-bit ECC Error Interrupt Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM_ECC_ERRS_INT_0</name>
                  <description>ITCM single-bit ECC error does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM_ECC_ERRS_INT_1</name>
                  <description>ITCM single-bit ECC error happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D0TCM_ECC_ERRM_INT</name>
              <description>D0TCM access multi-bit ECC Error Interrupt Status</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D0TCM_ECC_ERRM_INT_0</name>
                  <description>D0TCM multi-bit ECC error does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0TCM_ECC_ERRM_INT_1</name>
                  <description>D0TCM multi-bit ECC error happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D0TCM_ECC_ERRS_INT</name>
              <description>D0TCM access single-bit ECC Error Interrupt Status</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D0TCM_ECC_ERRS_INT_0</name>
                  <description>D0TCM single-bit ECC error does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0TCM_ECC_ERRS_INT_1</name>
                  <description>D0TCM single-bit ECC error happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D1TCM_ECC_ERRM_INT</name>
              <description>D1TCM access multi-bit ECC Error Interrupt Status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D1TCM_ECC_ERRM_INT_0</name>
                  <description>D1TCM multi-bit ECC error does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D1TCM_ECC_ERRM_INT_1</name>
                  <description>D1TCM multi-bit ECC error happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D1TCM_ECC_ERRS_INT</name>
              <description>D1TCM access single-bit ECC Error Interrupt Status</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D1TCM_ECC_ERRS_INT_0</name>
                  <description>D1TCM single-bit ECC error does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D1TCM_ECC_ERRS_INT_1</name>
                  <description>D1TCM single-bit ECC error happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ITCM_PARTIAL_WR_INT_S</name>
              <description>ITCM Partial Write Interrupt Status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ITCM_PARTIAL_WR_INT_S_0</name>
                  <description>ITCM Partial Write does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ITCM_PARTIAL_WR_INT_S_1</name>
                  <description>ITCM Partial Write happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D0TCM_PARTIAL_WR_INT_S</name>
              <description>D0TCM Partial Write Interrupt Status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D0TCM_PARTIAL_WR_INT_S_0</name>
                  <description>D0TCM Partial Write does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D0TCM_PARTIAL_WR_INT_S_1</name>
                  <description>D0TCM Partial Write happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>D1TCM_PARTIAL_WR_INT_S</name>
              <description>D1TCM Partial Write Interrupt Status</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D1TCM_PARTIAL_WR_INT_S_0</name>
                  <description>D1TCM Partial Write does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D1TCM_PARTIAL_WR_INT_S_1</name>
                  <description>D1TCM Partial Write happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCRAM_PARTIAL_WR_INT_S</name>
              <description>OCRAM Partial Write Interrupt Status</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OCRAM_PARTIAL_WR_INT_S_0</name>
                  <description>OCRAM Partial Write does not happen</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OCRAM_PARTIAL_WR_INT_S_1</name>
                  <description>OCRAM Partial Write happens.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>Reserved</name>
              <description>Reserved</description>
              <bitOffset>18</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
