nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>A,B</dimIndex>
          <name>DLLCR%s</name>
          <description>DLL Control Register 0</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLLEN</name>
              <description>DLL calibration enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLLRESET</name>
              <description>Software could force a reset on DLL by setting this field to 0x1. This will cause the DLL to lose lock and re-calibrate to detect an ref_clock half period phase shift. The reset action is edge triggered, so software need to clear this bit after set this bit (no delay limitation).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SLVDLYTARGET</name>
              <description>The delay target for slave delay line is: ((SLVDLYTARGET+1) * 1/32 * clock cycle of reference clock (serial root clock). If serial root clock is &gt;= 100 MHz, DLLEN set to 0x1, OVRDEN set to =0x0, then SLVDLYTARGET setting of 0xF is recommended.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRDEN</name>
              <description>Slave clock delay line delay cell number selection override enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVRDVAL</name>
              <description>Slave clock delay line delay cell number selection override value.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STS0</name>
          <description>Status Register 0</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEQIDLE</name>
              <description>This status bit indicates the state machine in SEQ_CTL is idle and there is command sequence executing on FlexSPI interface.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARBIDLE</name>
              <description>This status bit indicates the state machine in ARB_CTL is busy and there is command sequence granted by arbitrator and not finished yet on FlexSPI interface. When ARB_CTL state (ARBIDLE=0x1) is idle, there will be no transaction on FlexSPI interface also (SEQIDLE=0x1). So this bit should be polled to wait for FlexSPI controller become idle instead of SEQIDLE.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARBCMDSRC</name>
              <description>This status field indicates the trigger source of current command sequence granted by arbitrator. This field value is meaningless when ARB_CTL is not busy (STS0[ARBIDLE]=0x1).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARBCMDSRC_0</name>
                  <description>Triggered by AHB read command (triggered by AHB read).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARBCMDSRC_1</name>
                  <description>Triggered by AHB write command (triggered by AHB Write).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARBCMDSRC_2</name>
                  <description>Triggered by IP command (triggered by setting register bit IPCMD.TRG).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARBCMDSRC_3</name>
                  <description>Triggered by suspended command (resumed).</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STS1</name>
          <description>Status Register 1</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AHBCMDERRID</name>
              <description>Indicates the sequence index when an AHB command error is detected. This field will be cleared when INTR[AHBCMDERR] is write-1-clear(w1c).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AHBCMDERRCODE</name>
              <description>Indicates the Error Code when AHB command Error detected. This field will be cleared when INTR[AHBCMDERR] is write-1-clear(w1c).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AHBCMDERRCODE_0</name>
                  <description>No error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBCMDERRCODE_2</name>
                  <description>AHB Write command with JMP_ON_CS instruction used in the sequence.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBCMDERRCODE_3</name>
                  <description>There is unknown instruction opcode in the sequence.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBCMDERRCODE_4</name>
                  <description>Instruction DUMMY_SDR/DUMMY_RWDS_SDR used in DDR sequence.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBCMDERRCODE_5</name>
                  <description>Instruction DUMMY_DDR/DUMMY_RWDS_DDR used in SDR sequence.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AHBCMDERRCODE_14</name>
                  <description>Sequence execution timeout.</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPCMDERRID</name>
              <description>Indicates the sequence Index when IP command error detected. This field will be cleared when INTR[IPCMDERR] is write-1-clear(w1c).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IPCMDERRCODE</name>
              <description>Indicates the Error Code when IP command Error detected. This field will be cleared when INTR[IPCMDERR] is write-1-clear(w1c).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPCMDERRCODE_0</name>
                  <description>No error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCMDERRCODE_2</name>
                  <description>IP command with JMP_ON_CS instruction used in the sequence.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCMDERRCODE_3</name>
                  <description>There is unknown instruction opcode in the sequence.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCMDERRCODE_4</name>
                  <description>Instruction DUMMY_SDR/DUMMY_RWDS_SDR used in DDR sequence.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCMDERRCODE_5</name>
                  <description>Instruction DUMMY_DDR/DUMMY_RWDS_DDR used in SDR sequence.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCMDERRCODE_6</name>
                  <description>Flash access start address exceed the whole flash address range (A1/A2/B1/B2).</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCMDERRCODE_14</name>
                  <description>Sequence execution timeout.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPCMDERRCODE_15</name>
                  <description>Flash boundary crossed.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STS2</name>
          <description>Status Register 2</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1000100</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ASLVLOCK</name>
              <description>Flash A sample clock slave delay line locked.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AREFLOCK</name>
              <description>Flash A sample clock reference delay line locked.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ASLVSEL</name>
              <description>Flash A sample clock slave delay line delay cell number selection .</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AREFSEL</name>
              <description>Flash A sample clock reference delay line delay cell number selection.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BSLVLOCK</name>
              <description>Flash B sample clock slave delay line locked.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BREFLOCK</name>
              <description>Flash B sample clock reference delay line locked.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BSLVSEL</name>
              <description>Flash B sample clock slave delay line delay cell number selection.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BREFSEL</name>
              <description>Flash B sample clock reference delay line delay cell number selection.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBSPNDSTS</name>
          <description>AHB Suspend Status Register</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTIVE</name>
              <description>Indicates if an AHB read prefetch command sequence has been suspended.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUFID</name>
              <description>AHB RX BUF ID for suspended command sequence.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATLFT</name>
              <description>Left Data size for suspended command sequence (in byte).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPRXFSTS</name>
          <description>IP RX FIFO Status Register</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FILL</name>
              <description>Fill level of IP RX FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RDCNTR</name>
              <description>Total Read Data Counter: RDCNTR * 64 Bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IPTXFSTS</name>
          <description>IP TX FIFO Status Register</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FILL</name>
              <description>Fill level of IP TX FIFO.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WRCNTR</name>
              <description>Total Write Data Counter: WRCNTR * 64 Bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>RFDR[%s]</name>
          <description>IP RX FIFO Data Register x</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXDATA</name>
              <description>RX Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>TFDR[%s]</name>
          <description>IP TX FIFO Data Register x</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXDATA</name>
              <description>TX Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>64</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>LUT[%s]</name>
          <description>LUT x</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>OPERAND0</name>
              <description>OPERAND0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_PADS0</name>
              <description>NUM_PADS0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPCODE0</name>
              <description>OPCODE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPERAND1</name>
              <description>OPERAND1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_PADS1</name>
              <description>NUM_PADS1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPCODE1</name>
              <description>OPCODE1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
