nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_15</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_15 SW MUX Control Register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR6</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR06 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_XBAR1_INOUT7</name>
                  <description>Select mux mode: ALT1 mux port: XBAR1_INOUT07 of instance: XBAR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO15</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO15 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO15</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D15 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO15</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO15 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_15</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_16</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_16 SW MUX Control Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR7</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR07 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_XBAR1_INOUT8</name>
                  <description>Select mux mode: ALT1 mux port: XBAR1_INOUT08 of instance: XBAR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO16</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO16 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO16</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D16 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO16</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO16 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_16</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_17</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_17 SW MUX Control Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR8</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR08 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm4_PWMA3</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM4_PWM3_A of instance: FLEXPWM4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_qtimer1_TIMER0</name>
                  <description>Select mux mode: ALT2 mux port: TMR1_TIMER0 of instance: TMR1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO17</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO17 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO17</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D17 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO17</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO17 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_17</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_18</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_18 SW MUX Control Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR9</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR09 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm4_PWMB3</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM4_PWM3_B of instance: FLEXPWM4</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_qtimer2_TIMER0</name>
                  <description>Select mux mode: ALT2 mux port: TMR2_TIMER0 of instance: TMR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO18</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO18 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO18</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D18 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO18</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO18 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_18</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_19</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_19 SW MUX Control Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR11</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR11 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm2_PWMA3</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM2_PWM3_A of instance: FLEXPWM2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_qtimer3_TIMER0</name>
                  <description>Select mux mode: ALT2 mux port: TMR3_TIMER0 of instance: TMR3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO19</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO19 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO19</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D19 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO19</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO19 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_19</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_20</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_20 SW MUX Control Register</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR12</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR12 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm2_PWMB3</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM2_PWM3_B of instance: FLEXPWM2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_qtimer4_TIMER0</name>
                  <description>Select mux mode: ALT2 mux port: TMR4_TIMER0 of instance: TMR4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO20</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO20 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO20</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D20 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO20</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO20 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_20</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_21</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_21 SW MUX Control Register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_BA0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_BA0 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm3_PWMA3</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM3_PWM3_A of instance: FLEXPWM3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO21</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO21 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO21</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D21 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO21</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO21 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_21</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_22</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_22 SW MUX Control Register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_BA1</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_BA1 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm3_PWMB3</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM3_PWM3_B of instance: FLEXPWM3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO22</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO22 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO22</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D22 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO22</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO22 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_22</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
