nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_23</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_23 SW MUX Control Register</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_ADDR10</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_ADDR10 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm1_PWMA0</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM1_PWM0_A of instance: FLEXPWM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO23</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO23 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO23</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D23 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO23</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO23 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_23</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_24</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_24 SW MUX Control Register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_CAS</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_CAS of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm1_PWMB0</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM1_PWM0_B of instance: FLEXPWM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO24</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO24 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO24</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D24 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO24</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO24 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_24</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_25</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_25 SW MUX Control Register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_RAS</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_RAS of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm1_PWMA1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM1_PWM1_A of instance: FLEXPWM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO25</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO25 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO25</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D25 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO25</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO25 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_25</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_26</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_26 SW MUX Control Register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_CLK</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_CLK of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm1_PWMB1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM1_PWM1_B of instance: FLEXPWM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO26</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO26 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO26</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D26 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO26</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO26 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_26</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_27</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_27 SW MUX Control Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_CKE</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_CKE of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm1_PWMA2</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM1_PWM2_A of instance: FLEXPWM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO27</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO27 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO27</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D27 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO27</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO27 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_27</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_28</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_28 SW MUX Control Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_WE</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_WE of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm1_PWMB2</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM1_PWM2_B of instance: FLEXPWM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO28</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO28 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO28</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D28 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO28</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO28 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_28</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_29</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_29 SW MUX Control Register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_CS0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_CS0 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm3_PWMA0</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM3_PWM0_A of instance: FLEXPWM3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO29</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO29 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO29</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D29 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO29</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO29 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_29</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_30</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_30 SW MUX Control Register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA8</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA08 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm3_PWMB0</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM3_PWM0_B of instance: FLEXPWM3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux1_IO30</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX1_IO30 of instance: GPIO_MUX1</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio1_FLEXIO30</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO1_D30 of instance: FLEXIO1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio7_IO30</name>
                  <description>Select mux mode: ALT10 mux port: GPIO7_IO30 of instance: GPIO7</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_30</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
