nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_39</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_39 SW MUX Control Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DQS</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DQS of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexpwm1_PWMB3</name>
                  <description>Select mux mode: ALT1 mux port: FLEXPWM1_PWM3_B of instance: FLEXPWM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_qtimer2_TIMER1</name>
                  <description>Select mux mode: ALT2 mux port: TMR2_TIMER1 of instance: TMR2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO7</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO07 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO7</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO07 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_39</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_40</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_40 SW MUX Control Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_RDY</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_RDY of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_XBAR1_INOUT12</name>
                  <description>Select mux mode: ALT1 mux port: XBAR1_INOUT12 of instance: XBAR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_mqs_RIGHT</name>
                  <description>Select mux mode: ALT2 mux port: MQS_RIGHT of instance: MQS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart6_TX</name>
                  <description>Select mux mode: ALT3 mux port: LPUART6_TXD of instance: LPUART6</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO8</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO08 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_enet_1g_MDC</name>
                  <description>Select mux mode: ALT7 mux port: ENET_1G_MDC of instance: ENET_1G</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_CCM_CLKO1</name>
                  <description>Select mux mode: ALT9 mux port: CCM_CLKO1 of instance: CCM</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO8</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO08 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_40</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B1_41</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B1_41 SW MUX Control Register</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_CSX0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_CSX00 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_XBAR1_INOUT13</name>
                  <description>Select mux mode: ALT1 mux port: XBAR1_INOUT13 of instance: XBAR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_mqs_LEFT</name>
                  <description>Select mux mode: ALT2 mux port: MQS_LEFT of instance: MQS</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart6_RX</name>
                  <description>Select mux mode: ALT3 mux port: LPUART6_RXD of instance: LPUART6</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_B_DATA7</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_B_DATA07 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO9</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO09 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_enet_1g_MDIO</name>
                  <description>Select mux mode: ALT7 mux port: ENET_1G_MDIO of instance: ENET_1G</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_CCM_CLKO2</name>
                  <description>Select mux mode: ALT9 mux port: CCM_CLKO2 of instance: CCM</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO9</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO09 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B1_41</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_00</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_00 SW MUX Control Register</description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA16</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA16 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_CCM_ENET_REF_CLK_25M</name>
                  <description>Select mux mode: ALT1 mux port: CCM_ENET_REF_CLK_25M of instance: CCM</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_qtimer3_TIMER1</name>
                  <description>Select mux mode: ALT2 mux port: TMR3_TIMER1 of instance: TMR3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart6_CTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART6_CTS_B of instance: LPUART6</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_B_DATA6</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_B_DATA06 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO10</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO10 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT20</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT20 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_enet_qos_1588_EVENT1_OUT</name>
                  <description>Select mux mode: ALT7 mux port: ENET_QOS_1588_EVENT1_OUT of instance: ENET_QOS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi1_SCK</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI1_SCK of instance: LPSPI1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpi2c2_SCL</name>
                  <description>Select mux mode: ALT9 mux port: LPI2C2_SCL of instance: LPI2C2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO10</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO10 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMA0</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM0_A of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_00</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_01</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_01 SW MUX Control Register</description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA17</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA17 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_usdhc2_CD_B</name>
                  <description>Select mux mode: ALT1 mux port: USDHC2_CD_B of instance: USDHC2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_qtimer4_TIMER1</name>
                  <description>Select mux mode: ALT2 mux port: TMR4_TIMER1 of instance: TMR4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart6_RTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART6_RTS_B of instance: LPUART6</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_B_DATA5</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_B_DATA05 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO11</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO11 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT21</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT21 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_enet_qos_1588_EVENT1_IN</name>
                  <description>Select mux mode: ALT7 mux port: ENET_QOS_1588_EVENT1_IN of instance: ENET_QOS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi1_PCS0</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI1_PCS0 of instance: LPSPI1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpi2c2_SDA</name>
                  <description>Select mux mode: ALT9 mux port: LPI2C2_SDA of instance: LPI2C2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO11</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO11 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMB0</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM0_B of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_01</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
