nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_02</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_02 SW MUX Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA18</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA18 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_usdhc2_WP</name>
                  <description>Select mux mode: ALT1 mux port: USDHC2_WP of instance: USDHC2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_video_mux_CSI_DATA23</name>
                  <description>Select mux mode: ALT3 mux port: VIDEO_MUX_CSI_DATA23 of instance: VIDEO_MUX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_B_DATA4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_B_DATA04 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO12</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO12 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT22</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT22 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_enet_qos_1588_EVENT1_AUX_IN</name>
                  <description>Select mux mode: ALT7 mux port: ENET_QOS_1588_EVENT1_AUX_IN of instance: ENET_QOS</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi1_SDO</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI1_SOUT of instance: LPSPI1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO12</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO12 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMA1</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM1_A of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_02</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_03</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_03 SW MUX Control Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA19</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA19 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_usdhc2_VSELECT</name>
                  <description>Select mux mode: ALT1 mux port: USDHC2_VSELECT of instance: USDHC2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_video_mux_CSI_DATA22</name>
                  <description>Select mux mode: ALT3 mux port: VIDEO_MUX_CSI_DATA22 of instance: VIDEO_MUX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_B_DATA3</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_B_DATA03 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO13</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO13 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT23</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT23 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_ENET_1G_TX_DATA3</name>
                  <description>Select mux mode: ALT7 mux port: ENET_1G_TX_DATA03 of instance: ENET_1G</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi1_SDI</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI1_SIN of instance: LPSPI1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO13</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO13 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMB1</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM1_B of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_03</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_04</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_04 SW MUX Control Register</description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA20</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA20 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_usdhc2_RESET_B</name>
                  <description>Select mux mode: ALT1 mux port: USDHC2_RESET_B of instance: USDHC2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai2_MCLK</name>
                  <description>Select mux mode: ALT2 mux port: SAI2_MCLK of instance: SAI2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_video_mux_CSI_DATA21</name>
                  <description>Select mux mode: ALT3 mux port: VIDEO_MUX_CSI_DATA21 of instance: VIDEO_MUX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_B_DATA2</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_B_DATA02 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO14</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO14 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT24</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT24 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_ENET_1G_TX_DATA2</name>
                  <description>Select mux mode: ALT7 mux port: ENET_1G_TX_DATA02 of instance: ENET_1G</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi3_SCK</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI3_SCK of instance: LPSPI3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO14</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO14 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMA2</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM2_A of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_04</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_05</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_05 SW MUX Control Register</description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA21</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA21 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_gpt3_CLK</name>
                  <description>Select mux mode: ALT1 mux port: GPT3_CLK of instance: GPT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai2_RX_SYNC</name>
                  <description>Select mux mode: ALT2 mux port: SAI2_RX_SYNC of instance: SAI2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_video_mux_CSI_DATA20</name>
                  <description>Select mux mode: ALT3 mux port: VIDEO_MUX_CSI_DATA20 of instance: VIDEO_MUX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_B_DATA1</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_B_DATA01 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO15</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO15 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT25</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT25 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_enet_1g_RX_CLK</name>
                  <description>Select mux mode: ALT7 mux port: ENET_1G_RX_CLK of instance: ENET_1G</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi3_PCS0</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI3_PCS0 of instance: LPSPI3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_pit1_TRIGGER0</name>
                  <description>Select mux mode: ALT9 mux port: PIT1_TRIGGER0 of instance: PIT1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO15</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO15 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMB2</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM2_B of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_05</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_06</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_06 SW MUX Control Register</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA22</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA22 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_gpt3_CAPTURE1</name>
                  <description>Select mux mode: ALT1 mux port: GPT3_CAPTURE1 of instance: GPT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai2_RX_BCLK</name>
                  <description>Select mux mode: ALT2 mux port: SAI2_RX_BCLK of instance: SAI2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_video_mux_CSI_DATA19</name>
                  <description>Select mux mode: ALT3 mux port: VIDEO_MUX_CSI_DATA19 of instance: VIDEO_MUX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_B_DATA0</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_B_DATA00 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO16</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO16 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT26</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT26 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_enet_1g_TX_ER</name>
                  <description>Select mux mode: ALT7 mux port: ENET_1G_TX_ER of instance: ENET_1G</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi3_SDO</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI3_SOUT of instance: LPSPI3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_pit1_TRIGGER1</name>
                  <description>Select mux mode: ALT9 mux port: PIT1_TRIGGER1 of instance: PIT1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO16</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO16 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMA3</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM3_A of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_06</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
