nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_07</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_07 SW MUX Control Register</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA23</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA23 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_gpt3_CAPTURE2</name>
                  <description>Select mux mode: ALT1 mux port: GPT3_CAPTURE2 of instance: GPT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai2_RX_DATA</name>
                  <description>Select mux mode: ALT2 mux port: SAI2_RX_DATA of instance: SAI2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_video_mux_CSI_DATA18</name>
                  <description>Select mux mode: ALT3 mux port: VIDEO_MUX_CSI_DATA18 of instance: VIDEO_MUX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_B_DQS</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_B_DQS of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO17</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO17 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT27</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT27 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_ENET_1G_RX_DATA3</name>
                  <description>Select mux mode: ALT7 mux port: ENET_1G_RX_DATA03 of instance: ENET_1G</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi3_SDI</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI3_SIN of instance: LPSPI3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_pit1_TRIGGER2</name>
                  <description>Select mux mode: ALT9 mux port: PIT1_TRIGGER2 of instance: PIT1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO17</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO17 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMB3</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM3_B of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_07</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_08</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_08 SW MUX Control Register</description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DM2</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DM02 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_gpt3_COMPARE1</name>
                  <description>Select mux mode: ALT1 mux port: GPT3_COMPARE1 of instance: GPT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai2_TX_DATA</name>
                  <description>Select mux mode: ALT2 mux port: SAI2_TX_DATA of instance: SAI2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_video_mux_CSI_DATA17</name>
                  <description>Select mux mode: ALT3 mux port: VIDEO_MUX_CSI_DATA17 of instance: VIDEO_MUX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_B_SS0_B</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_B_SS0_B of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO18</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO18 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT28</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT28 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_ENET_1G_RX_DATA2</name>
                  <description>Select mux mode: ALT7 mux port: ENET_1G_RX_DATA02 of instance: ENET_1G</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi3_PCS1</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI3_PCS1 of instance: LPSPI3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_pit1_TRIGGER3</name>
                  <description>Select mux mode: ALT9 mux port: PIT1_TRIGGER3 of instance: PIT1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO18</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO18 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_08</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_09</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_09 SW MUX Control Register</description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA24</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA24 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_gpt3_COMPARE2</name>
                  <description>Select mux mode: ALT1 mux port: GPT3_COMPARE2 of instance: GPT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai2_TX_BCLK</name>
                  <description>Select mux mode: ALT2 mux port: SAI2_TX_BCLK of instance: SAI2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_video_mux_CSI_DATA16</name>
                  <description>Select mux mode: ALT3 mux port: VIDEO_MUX_CSI_DATA16 of instance: VIDEO_MUX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_B_SCLK</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_B_SCLK of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO19</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO19 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT29</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT29 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_enet_1g_CRS</name>
                  <description>Select mux mode: ALT7 mux port: ENET_1G_CRS of instance: ENET_1G</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi3_PCS2</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI3_PCS2 of instance: LPSPI3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer1_TIMER0</name>
                  <description>Select mux mode: ALT9 mux port: TMR1_TIMER0 of instance: TMR1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO19</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO19 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_09</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_10</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_10 SW MUX Control Register</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA25</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA25 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_gpt3_COMPARE3</name>
                  <description>Select mux mode: ALT1 mux port: GPT3_COMPARE3 of instance: GPT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai2_TX_SYNC</name>
                  <description>Select mux mode: ALT2 mux port: SAI2_TX_SYNC of instance: SAI2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_video_mux_CSI_FIELD</name>
                  <description>Select mux mode: ALT3 mux port: VIDEO_MUX_CSI_FIELD of instance: VIDEO_MUX</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_A_SCLK</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_A_SCLK of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO20</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO20 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT30</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT30 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_enet_1g_COL</name>
                  <description>Select mux mode: ALT7 mux port: ENET_1G_COL of instance: ENET_1G</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi3_PCS3</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI3_PCS3 of instance: LPSPI3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer1_TIMER1</name>
                  <description>Select mux mode: ALT9 mux port: TMR1_TIMER1 of instance: TMR1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO20</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO20 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_10</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_11</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_11 SW MUX Control Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DATA26</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DATA26 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_spdif_IN</name>
                  <description>Select mux mode: ALT1 mux port: SPDIF_IN of instance: SPDIF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_TX_DATA0</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_TX_DATA00 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_sai3_RX_SYNC</name>
                  <description>Select mux mode: ALT3 mux port: SAI3_RX_SYNC of instance: SAI3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_A_SS0_B</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_A_SS0_B of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO21</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO21 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_XBAR1_INOUT31</name>
                  <description>Select mux mode: ALT6 mux port: XBAR1_INOUT31 of instance: XBAR1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_EMVSIM1_TRXD</name>
                  <description>Select mux mode: ALT8 mux port: EMVSIM1_IO of instance: EMVSIM1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer1_TIMER2</name>
                  <description>Select mux mode: ALT9 mux port: TMR1_TIMER2 of instance: TMR1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO21</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO21 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
