nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_17</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_17 SW MUX Control Register</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DM3</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DM03 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_XBAR1_INOUT15</name>
                  <description>Select mux mode: ALT1 mux port: XBAR1_INOUT15 of instance: XBAR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_RX_EN</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_RX_EN of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_sai3_MCLK</name>
                  <description>Select mux mode: ALT3 mux port: SAI3_MCLK of instance: SAI3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_A_DATA4</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_A_DATA04 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO27</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO27 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_WDOG1_ANY</name>
                  <description>Select mux mode: ALT8 mux port: WDOG1_ANY of instance: WDOG1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer3_TIMER0</name>
                  <description>Select mux mode: ALT9 mux port: TMR3_TIMER0 of instance: TMR3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO27</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO27 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_17</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_18</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_18 SW MUX Control Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_DQS4</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_DQS4 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_XBAR1_INOUT16</name>
                  <description>Select mux mode: ALT1 mux port: XBAR1_INOUT16 of instance: XBAR1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_RX_ER</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_RX_ER of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_EWM_OUT_B</name>
                  <description>Select mux mode: ALT3 mux port: EWM_OUT_B of instance: EWM</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_A_DATA5</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_A_DATA05 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO28</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO28 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_flexspi1_A_DQS</name>
                  <description>Select mux mode: ALT6 mux port: FLEXSPI1_A_DQS of instance: FLEXSPI1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_WDOG1_B</name>
                  <description>Select mux mode: ALT8 mux port: WDOG1_B of instance: WDOG1</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer3_TIMER1</name>
                  <description>Select mux mode: ALT9 mux port: TMR3_TIMER1 of instance: TMR3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO28</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO28 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_18</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_19</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_19 SW MUX Control Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_CLKX0</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_CLKX00 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_enet_MDC</name>
                  <description>Select mux mode: ALT1 mux port: ENET_MDC of instance: ENET</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_MDC</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_MDC of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_enet_1g_REF_CLK1</name>
                  <description>Select mux mode: ALT3 mux port: ENET_1G_REF_CLK1 of instance: ENET_1G</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_A_DATA6</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_A_DATA06 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO29</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO29 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_MDC</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_MDC of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer3_TIMER2</name>
                  <description>Select mux mode: ALT9 mux port: TMR3_TIMER2 of instance: TMR3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO29</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO29 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_19</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_EMC_B2_20</name>
          <description>SW_MUX_CTL_PAD_GPIO_EMC_B2_20 SW MUX Control Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_semc_CLKX1</name>
                  <description>Select mux mode: ALT0 mux port: SEMC_CLKX01 of instance: SEMC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_enet_MDIO</name>
                  <description>Select mux mode: ALT1 mux port: ENET_MDIO of instance: ENET</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_MDIO</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_MDIO of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_CCM_enet_qos_clock_generate_REF_CLK1</name>
                  <description>Select mux mode: ALT3 mux port: ENET_QOS_REF_CLK1 of instance: ENET_QOS</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexspi2_A_DATA7</name>
                  <description>Select mux mode: ALT4 mux port: FLEXSPI2_A_DATA07 of instance: FLEXSPI2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO30</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO30 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_MDIO</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_MDIO of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer3_TIMER3</name>
                  <description>Select mux mode: ALT9 mux port: TMR3_TIMER3 of instance: TMR3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO30</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO30 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_EMC_B2_20</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_00</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_00 SW MUX Control Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_EMVSIM1_TRXD</name>
                  <description>Select mux mode: ALT0 mux port: EMVSIM1_IO of instance: EMVSIM1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_can2_TX</name>
                  <description>Select mux mode: ALT1 mux port: FLEXCAN2_TX of instance: FLEXCAN2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_1588_EVENT1_IN</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_1588_EVENT1_IN of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt2_CAPTURE1</name>
                  <description>Select mux mode: ALT3 mux port: GPT2_CAPTURE1 of instance: GPT2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm1_PWMA0</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM1_PWM0_A of instance: FLEXPWM1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux2_IO31</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX2_IO31 of instance: GPIO_MUX2</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpuart7_TX</name>
                  <description>Select mux mode: ALT6 mux port: LPUART7_TXD of instance: LPUART7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO0</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D00 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_flexspi2_B_SS1_B</name>
                  <description>Select mux mode: ALT9 mux port: FLEXSPI2_B_SS1_B of instance: FLEXSPI2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio8_IO31</name>
                  <description>Select mux mode: ALT10 mux port: GPIO8_IO31 of instance: GPIO8</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_00</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
