nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_01</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_01 SW MUX Control Register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_EMVSIM1_CLK</name>
                  <description>Select mux mode: ALT0 mux port: EMVSIM1_CLK of instance: EMVSIM1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_can2_RX</name>
                  <description>Select mux mode: ALT1 mux port: FLEXCAN2_RX of instance: FLEXCAN2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_1588_EVENT1_OUT</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_1588_EVENT1_OUT of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt2_CAPTURE2</name>
                  <description>Select mux mode: ALT3 mux port: GPT2_CAPTURE2 of instance: GPT2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm1_PWMB0</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM1_PWM0_B of instance: FLEXPWM1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO0</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO00 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpuart7_RX</name>
                  <description>Select mux mode: ALT6 mux port: LPUART7_RXD of instance: LPUART7</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO1</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D01 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_flexspi2_A_SS1_B</name>
                  <description>Select mux mode: ALT9 mux port: FLEXSPI2_A_SS1_B of instance: FLEXSPI2</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO0</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO00 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_01</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_02</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_02 SW MUX Control Register</description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_EMVSIM1_RST_B</name>
                  <description>Select mux mode: ALT0 mux port: EMVSIM1_RST of instance: EMVSIM1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpuart7_CTS_B</name>
                  <description>Select mux mode: ALT1 mux port: LPUART7_CTS_B of instance: LPUART7</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_1588_EVENT2_IN</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_1588_EVENT2_IN of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt2_COMPARE1</name>
                  <description>Select mux mode: ALT3 mux port: GPT2_COMPARE1 of instance: GPT2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm1_PWMA1</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM1_PWM1_A of instance: FLEXPWM1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO1</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO01 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpuart8_TX</name>
                  <description>Select mux mode: ALT6 mux port: LPUART8_TXD of instance: LPUART8</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO2</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D02 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_video_mux_EXT_DCIC1</name>
                  <description>Select mux mode: ALT9 mux port: VIDEO_MUX_EXT_DCIC1 of instance: VIDEO_MUX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO1</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO01 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_02</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_03</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_03 SW MUX Control Register</description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_EMVSIM1_SVEN</name>
                  <description>Select mux mode: ALT0 mux port: EMVSIM1_SVEN of instance: EMVSIM1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpuart7_RTS_B</name>
                  <description>Select mux mode: ALT1 mux port: LPUART7_RTS_B of instance: LPUART7</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_1588_EVENT2_OUT</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_1588_EVENT2_OUT of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt2_COMPARE2</name>
                  <description>Select mux mode: ALT3 mux port: GPT2_COMPARE2 of instance: GPT2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm1_PWMB1</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM1_PWM1_B of instance: FLEXPWM1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO2</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO02 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpuart8_RX</name>
                  <description>Select mux mode: ALT6 mux port: LPUART8_RXD of instance: LPUART8</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO3</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D03 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_video_mux_EXT_DCIC2</name>
                  <description>Select mux mode: ALT9 mux port: VIDEO_MUX_EXT_DCIC2 of instance: VIDEO_MUX</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO2</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO02 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_03</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_04</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_04 SW MUX Control Register</description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_EMVSIM1_PD</name>
                  <description>Select mux mode: ALT0 mux port: EMVSIM1_PD of instance: EMVSIM1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpuart8_CTS_B</name>
                  <description>Select mux mode: ALT1 mux port: LPUART8_CTS_B of instance: LPUART8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_1588_EVENT3_IN</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_1588_EVENT3_IN of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt2_COMPARE3</name>
                  <description>Select mux mode: ALT3 mux port: GPT2_COMPARE3 of instance: GPT2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm1_PWMA2</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM1_PWM2_A of instance: FLEXPWM1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO3</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO03 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_WDOG1_B</name>
                  <description>Select mux mode: ALT6 mux port: WDOG1_B of instance: WDOG1</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO4</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D04 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer4_TIMER0</name>
                  <description>Select mux mode: ALT9 mux port: TMR4_TIMER0 of instance: TMR4</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO3</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO03 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_04</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_05</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_05 SW MUX Control Register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_EMVSIM1_POWER_FAIL</name>
                  <description>Select mux mode: ALT0 mux port: EMVSIM1_POWER_FAIL of instance: EMVSIM1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpuart8_RTS_B</name>
                  <description>Select mux mode: ALT1 mux port: LPUART8_RTS_B of instance: LPUART8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_1588_EVENT3_OUT</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_1588_EVENT3_OUT of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt2_CLK</name>
                  <description>Select mux mode: ALT3 mux port: GPT2_CLK of instance: GPT2</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_flexpwm1_PWMB2</name>
                  <description>Select mux mode: ALT4 mux port: FLEXPWM1_PWM2_B of instance: FLEXPWM1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO4</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO04 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_WDOG2_B</name>
                  <description>Select mux mode: ALT6 mux port: WDOG2_B of instance: WDOG2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO5</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D05 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer4_TIMER1</name>
                  <description>Select mux mode: ALT9 mux port: TMR4_TIMER1 of instance: TMR4</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO4</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO04 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_05</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
