nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_06</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_06 SW MUX Control Register</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usb_OTG2_OC</name>
                  <description>Select mux mode: ALT0 mux port: USB_OTG2_OC of instance: USB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_can1_TX</name>
                  <description>Select mux mode: ALT1 mux port: FLEXCAN1_TX of instance: FLEXCAN1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_EMVSIM2_TRXD</name>
                  <description>Select mux mode: ALT2 mux port: EMVSIM2_IO of instance: EMVSIM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt3_CAPTURE1</name>
                  <description>Select mux mode: ALT3 mux port: GPT3_CAPTURE1 of instance: GPT3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA15</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA15 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO5</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO05 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_enet_1588_EVENT1_IN</name>
                  <description>Select mux mode: ALT6 mux port: ENET_1588_EVENT1_IN of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO6</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D06 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer4_TIMER2</name>
                  <description>Select mux mode: ALT9 mux port: TMR4_TIMER2 of instance: TMR4</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO5</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO05 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm1_PWMX0</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM1_PWM0_X of instance: FLEXPWM1</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_06</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_07</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_07 SW MUX Control Register</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usb_OTG2_PWR</name>
                  <description>Select mux mode: ALT0 mux port: USB_OTG2_PWR of instance: USB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_can1_RX</name>
                  <description>Select mux mode: ALT1 mux port: FLEXCAN1_RX of instance: FLEXCAN1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_EMVSIM2_CLK</name>
                  <description>Select mux mode: ALT2 mux port: EMVSIM2_CLK of instance: EMVSIM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt3_CAPTURE2</name>
                  <description>Select mux mode: ALT3 mux port: GPT3_CAPTURE2 of instance: GPT3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA14</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA14 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO6</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO06 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_enet_1588_EVENT1_OUT</name>
                  <description>Select mux mode: ALT6 mux port: ENET_1588_EVENT1_OUT of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO7</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D07 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_qtimer4_TIMER3</name>
                  <description>Select mux mode: ALT9 mux port: TMR4_TIMER3 of instance: TMR4</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO6</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO06 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm1_PWMX1</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM1_PWM1_X of instance: FLEXPWM1</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_07</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_08</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_08 SW MUX Control Register</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usbphy2_OTG_ID</name>
                  <description>Select mux mode: ALT0 mux port: USBPHY2_OTG_ID of instance: USBPHY2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpi2c1_SCL</name>
                  <description>Select mux mode: ALT1 mux port: LPI2C1_SCL of instance: LPI2C1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_EMVSIM2_RST_B</name>
                  <description>Select mux mode: ALT2 mux port: EMVSIM2_RST of instance: EMVSIM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt3_COMPARE1</name>
                  <description>Select mux mode: ALT3 mux port: GPT3_COMPARE1 of instance: GPT3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA13</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA13 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO7</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO07 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_enet_1588_EVENT2_IN</name>
                  <description>Select mux mode: ALT6 mux port: ENET_1588_EVENT2_IN of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO8</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D08 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO7</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO07 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm1_PWMX2</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM1_PWM2_X of instance: FLEXPWM1</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_08</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_09</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_09 SW MUX Control Register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usbphy1_OTG_ID</name>
                  <description>Select mux mode: ALT0 mux port: USBPHY1_OTG_ID of instance: USBPHY1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpi2c1_SDA</name>
                  <description>Select mux mode: ALT1 mux port: LPI2C1_SDA of instance: LPI2C1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_EMVSIM2_SVEN</name>
                  <description>Select mux mode: ALT2 mux port: EMVSIM2_SVEN of instance: EMVSIM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt3_COMPARE2</name>
                  <description>Select mux mode: ALT3 mux port: GPT3_COMPARE2 of instance: GPT3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA12</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA12 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO8</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO08 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_enet_1588_EVENT2_OUT</name>
                  <description>Select mux mode: ALT6 mux port: ENET_1588_EVENT2_OUT of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO9</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D09 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO8</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO08 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm1_PWMX3</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM1_PWM3_X of instance: FLEXPWM1</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_09</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_10</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_10 SW MUX Control Register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usb_OTG1_PWR</name>
                  <description>Select mux mode: ALT0 mux port: USB_OTG1_PWR of instance: USB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpi2c1_SCLS</name>
                  <description>Select mux mode: ALT1 mux port: LPI2C1_SCLS of instance: LPI2C1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_EMVSIM2_PD</name>
                  <description>Select mux mode: ALT2 mux port: EMVSIM2_PD of instance: EMVSIM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt3_COMPARE3</name>
                  <description>Select mux mode: ALT3 mux port: GPT3_COMPARE3 of instance: GPT3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA11</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA11 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO9</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO09 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_enet_1588_EVENT3_IN</name>
                  <description>Select mux mode: ALT6 mux port: ENET_1588_EVENT3_IN of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO10</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D10 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO9</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO09 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm2_PWMX0</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM2_PWM0_X of instance: FLEXPWM2</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_10</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
