nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_11</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_11 SW MUX Control Register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usb_OTG1_OC</name>
                  <description>Select mux mode: ALT0 mux port: USB_OTG1_OC of instance: USB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpi2c1_SDAS</name>
                  <description>Select mux mode: ALT1 mux port: LPI2C1_SDAS of instance: LPI2C1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_EMVSIM2_POWER_FAIL</name>
                  <description>Select mux mode: ALT2 mux port: EMVSIM2_POWER_FAIL of instance: EMVSIM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_gpt3_CLK</name>
                  <description>Select mux mode: ALT3 mux port: GPT3_CLK of instance: GPT3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_DATA10</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_DATA10 of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO10</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO10 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_enet_1588_EVENT3_OUT</name>
                  <description>Select mux mode: ALT6 mux port: ENET_1588_EVENT3_OUT of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO11</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D11 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO10</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO10 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm2_PWMX1</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM2_PWM1_X of instance: FLEXPWM2</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_12</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_12 SW MUX Control Register</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_spdif_LOCK</name>
                  <description>Select mux mode: ALT0 mux port: SPDIF_LOCK of instance: SPDIF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpi2c1_HREQ</name>
                  <description>Select mux mode: ALT1 mux port: LPI2C1_HREQ of instance: LPI2C1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt1_CAPTURE1</name>
                  <description>Select mux mode: ALT2 mux port: GPT1_CAPTURE1 of instance: GPT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_B_DATA3</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_B_DATA03 of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_PIXCLK</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_PIXCLK of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO11</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO11 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_ENET_TX_DATA3</name>
                  <description>Select mux mode: ALT6 mux port: ENET_TX_DATA03 of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO12</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D12 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_EWM_OUT_B</name>
                  <description>Select mux mode: ALT9 mux port: EWM_OUT_B of instance: EWM</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO11</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO11 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm2_PWMX2</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM2_PWM2_X of instance: FLEXPWM2</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_12</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_13</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_13 SW MUX Control Register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_spdif_SR_CLK</name>
                  <description>Select mux mode: ALT0 mux port: SPDIF_SR_CLK of instance: SPDIF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_pit1_TRIGGER0</name>
                  <description>Select mux mode: ALT1 mux port: PIT1_TRIGGER0 of instance: PIT1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt1_CAPTURE2</name>
                  <description>Select mux mode: ALT2 mux port: GPT1_CAPTURE2 of instance: GPT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_B_DATA2</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_B_DATA02 of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_MCLK</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_MCLK of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO12</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO12 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_ENET_TX_DATA2</name>
                  <description>Select mux mode: ALT6 mux port: ENET_TX_DATA02 of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO13</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D13 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_anatop_32K_OUT</name>
                  <description>Select mux mode: ALT9 mux port: REF_CLK_32K of instance: XTAL OSC</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO12</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO12 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm2_PWMX3</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM2_PWM3_X of instance: FLEXPWM2</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_13</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_14</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_14 SW MUX Control Register</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_spdif_EXT_CLK</name>
                  <description>Select mux mode: ALT0 mux port: SPDIF_EXT_CLK of instance: SPDIF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_anatop_24M_OUT</name>
                  <description>Select mux mode: ALT1 mux port: REF_CLK_24M of instance: XTAL OSC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt1_COMPARE1</name>
                  <description>Select mux mode: ALT2 mux port: GPT1_COMPARE1 of instance: GPT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_B_DATA1</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_B_DATA01 of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_VSYNC</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_VSYNC of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO13</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO13 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_enet_RX_CLK</name>
                  <description>Select mux mode: ALT6 mux port: ENET_RX_CLK of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO14</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D14 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_CCM_ENET_REF_CLK_25M</name>
                  <description>Select mux mode: ALT9 mux port: CCM_ENET_REF_CLK_25M of instance: CCM</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO13</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO13 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMX0</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM0_X of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_14</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_15</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_15 SW MUX Control Register</description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_spdif_IN</name>
                  <description>Select mux mode: ALT0 mux port: SPDIF_IN of instance: SPDIF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpuart10_TX</name>
                  <description>Select mux mode: ALT1 mux port: LPUART10_TXD of instance: LPUART10</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_gpt1_COMPARE2</name>
                  <description>Select mux mode: ALT2 mux port: GPT1_COMPARE2 of instance: GPT1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_flexspi1_B_DATA0</name>
                  <description>Select mux mode: ALT3 mux port: FLEXSPI1_B_DATA00 of instance: FLEXSPI1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_video_mux_CSI_HSYNC</name>
                  <description>Select mux mode: ALT4 mux port: VIDEO_MUX_CSI_HSYNC of instance: VIDEO_MUX</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO14</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO14 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_enet_TX_ER</name>
                  <description>Select mux mode: ALT6 mux port: ENET_TX_ER of instance: ENET</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO15</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D15 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO14</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO14 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT11_flexpwm3_PWMX1</name>
                  <description>Select mux mode: ALT11 mux port: FLEXPWM3_PWM1_X of instance: FLEXPWM3</description>
                  <value>0xB</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_15</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
