nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_31</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_31 SW MUX Control Register</description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpspi1_SDI</name>
                  <description>Select mux mode: ALT0 mux port: LPSPI1_SIN of instance: LPSPI1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_usb_OTG2_PWR</name>
                  <description>Select mux mode: ALT1 mux port: USB_OTG2_PWR of instance: USB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_can2_RX</name>
                  <description>Select mux mode: ALT2 mux port: FLEXCAN2_RX of instance: FLEXCAN2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_ENET_TX_DATA1</name>
                  <description>Select mux mode: ALT3 mux port: ENET_TX_DATA01 of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpuart3_RX</name>
                  <description>Select mux mode: ALT4 mux port: LPUART3_RXD of instance: LPUART3</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO30</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO30 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_COL2</name>
                  <description>Select mux mode: ALT6 mux port: KPP_COL02 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_flexio2_FLEXIO31</name>
                  <description>Select mux mode: ALT8 mux port: FLEXIO2_D31 of instance: FLEXIO2</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_WDOG1_RST_B_DEB</name>
                  <description>Select mux mode: ALT9 mux port: WDOG1_RST_B_DEB of instance: WDOG1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO30</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO30 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_31</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_32</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_32 SW MUX Control Register</description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpi2c1_SCL</name>
                  <description>Select mux mode: ALT0 mux port: LPI2C1_SCL of instance: LPI2C1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_usbphy2_OTG_ID</name>
                  <description>Select mux mode: ALT1 mux port: USBPHY2_OTG_ID of instance: USBPHY2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_pgmc_PMIC_RDY</name>
                  <description>Select mux mode: ALT2 mux port: PGMC_PMIC_RDY of instance: pgmc</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_enet_MDC</name>
                  <description>Select mux mode: ALT3 mux port: ENET_MDC of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_usdhc1_CD_B</name>
                  <description>Select mux mode: ALT4 mux port: USDHC1_CD_B of instance: USDHC1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux3_IO31</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX3_IO31 of instance: GPIO_MUX3</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_ROW1</name>
                  <description>Select mux mode: ALT6 mux port: KPP_ROW01 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpuart10_TX</name>
                  <description>Select mux mode: ALT8 mux port: LPUART10_TXD of instance: LPUART10</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_1g_MDC</name>
                  <description>Select mux mode: ALT9 mux port: ENET_1G_MDC of instance: ENET_1G</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio9_IO31</name>
                  <description>Select mux mode: ALT10 mux port: GPIO9_IO31 of instance: GPIO9</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_32</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_33</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_33 SW MUX Control Register</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpi2c1_SDA</name>
                  <description>Select mux mode: ALT0 mux port: LPI2C1_SDA of instance: LPI2C1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_usbphy1_OTG_ID</name>
                  <description>Select mux mode: ALT1 mux port: USBPHY1_OTG_ID of instance: USBPHY1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_XBAR1_INOUT17</name>
                  <description>Select mux mode: ALT2 mux port: XBAR1_INOUT17 of instance: XBAR1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_enet_MDIO</name>
                  <description>Select mux mode: ALT3 mux port: ENET_MDIO of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_usdhc1_WP</name>
                  <description>Select mux mode: ALT4 mux port: USDHC1_WP of instance: USDHC1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO0</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO00 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_COL1</name>
                  <description>Select mux mode: ALT6 mux port: KPP_COL01 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpuart10_RX</name>
                  <description>Select mux mode: ALT8 mux port: LPUART10_RXD of instance: LPUART10</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_enet_1g_MDIO</name>
                  <description>Select mux mode: ALT9 mux port: ENET_1G_MDIO of instance: ENET_1G</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO0</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO00 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_33</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_34</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_34 SW MUX Control Register</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_enet_1g_1588_EVENT0_IN</name>
                  <description>Select mux mode: ALT0 mux port: ENET_1G_1588_EVENT0_IN of instance: ENET_1G</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_usb_OTG1_PWR</name>
                  <description>Select mux mode: ALT1 mux port: USB_OTG1_PWR of instance: USB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_XBAR1_INOUT18</name>
                  <description>Select mux mode: ALT2 mux port: XBAR1_INOUT18 of instance: XBAR1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_enet_1588_EVENT0_IN</name>
                  <description>Select mux mode: ALT3 mux port: ENET_1588_EVENT0_IN of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_usdhc1_VSELECT</name>
                  <description>Select mux mode: ALT4 mux port: USDHC1_VSELECT of instance: USDHC1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO1</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO01 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_ROW0</name>
                  <description>Select mux mode: ALT6 mux port: KPP_ROW00 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpuart10_CTS_B</name>
                  <description>Select mux mode: ALT8 mux port: LPUART10_CTS_B of instance: LPUART10</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_WDOG1_ANY</name>
                  <description>Select mux mode: ALT9 mux port: WDOG1_ANY of instance: WDOG1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO1</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO01 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_34</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_AD_35</name>
          <description>SW_MUX_CTL_PAD_GPIO_AD_35 SW MUX Control Register</description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_enet_1g_1588_EVENT0_OUT</name>
                  <description>Select mux mode: ALT0 mux port: ENET_1G_1588_EVENT0_OUT of instance: ENET_1G</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_usb_OTG1_OC</name>
                  <description>Select mux mode: ALT1 mux port: USB_OTG1_OC of instance: USB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_XBAR1_INOUT19</name>
                  <description>Select mux mode: ALT2 mux port: XBAR1_INOUT19 of instance: XBAR1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_enet_1588_EVENT0_OUT</name>
                  <description>Select mux mode: ALT3 mux port: ENET_1588_EVENT0_OUT of instance: ENET</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_usdhc1_RESET_B</name>
                  <description>Select mux mode: ALT4 mux port: USDHC1_RESET_B of instance: USDHC1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO2</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO02 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_kpp_COL0</name>
                  <description>Select mux mode: ALT6 mux port: KPP_COL00 of instance: KPP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpuart10_RTS_B</name>
                  <description>Select mux mode: ALT8 mux port: LPUART10_RTS_B of instance: LPUART10</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_flexspi1_B_SS1_B</name>
                  <description>Select mux mode: ALT9 mux port: FLEXSPI1_B_SS1_B of instance: FLEXSPI1</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO2</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO02 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_AD_35</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
