nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_07</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_07 SW MUX Control Register</description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_STROBE</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_STROBE of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_A_SCLK</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_A_SCLK of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_TX_DATA2</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_TX_DATA02 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart3_CTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART3_CTS_B of instance: LPUART3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_gpt6_CAPTURE2</name>
                  <description>Select mux mode: ALT4 mux port: GPT6_CAPTURE2 of instance: GPT6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO16</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO16 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpspi2_SCK</name>
                  <description>Select mux mode: ALT6 mux port: LPSPI2_SCK of instance: LPSPI2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_TX_ER</name>
                  <description>Select mux mode: ALT8 mux port: ENET_TX_ER of instance: ENET</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_CCM_enet_qos_clock_generate_REF_CLK1</name>
                  <description>Select mux mode: ALT9 mux port: ENET_QOS_REF_CLK1 of instance: ENET_QOS</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO16</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO16 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_07</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_08</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_08 SW MUX Control Register</description>
          <addressOffset>0x1D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_DATA4</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_DATA4 of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_A_DATA0</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_A_DATA00 of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_TX_DATA1</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_TX_DATA01 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart3_RTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART3_RTS_B of instance: LPUART3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_gpt6_COMPARE1</name>
                  <description>Select mux mode: ALT4 mux port: GPT6_COMPARE1 of instance: GPT6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO17</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO17 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpspi2_PCS0</name>
                  <description>Select mux mode: ALT6 mux port: LPSPI2_PCS0 of instance: LPSPI2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO17</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO17 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_08</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_09</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_09 SW MUX Control Register</description>
          <addressOffset>0x1D8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_DATA5</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_DATA5 of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_A_DATA1</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_A_DATA01 of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_ENET_1G_TX_DATA0</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_TX_DATA00 of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart5_CTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART5_CTS_B of instance: LPUART5</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_gpt6_COMPARE2</name>
                  <description>Select mux mode: ALT4 mux port: GPT6_COMPARE2 of instance: GPT6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO18</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO18 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpspi2_SDO</name>
                  <description>Select mux mode: ALT6 mux port: LPSPI2_SOUT of instance: LPSPI2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO18</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO18 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_09</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_10</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_10 SW MUX Control Register</description>
          <addressOffset>0x1DC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_DATA6</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_DATA6 of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_A_DATA2</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_A_DATA02 of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_TX_EN</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_TX_EN of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart5_RTS_B</name>
                  <description>Select mux mode: ALT3 mux port: LPUART5_RTS_B of instance: LPUART5</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_gpt6_COMPARE3</name>
                  <description>Select mux mode: ALT4 mux port: GPT6_COMPARE3 of instance: GPT6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO19</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO19 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpspi2_SDI</name>
                  <description>Select mux mode: ALT6 mux port: LPSPI2_SIN of instance: LPSPI2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO19</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO19 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_10</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_SD_B2_11</name>
          <description>SW_MUX_CTL_PAD_GPIO_SD_B2_11 SW MUX Control Register</description>
          <addressOffset>0x1E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_usdhc2_DATA7</name>
                  <description>Select mux mode: ALT0 mux port: USDHC2_DATA7 of instance: USDHC2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_flexspi1_A_DATA3</name>
                  <description>Select mux mode: ALT1 mux port: FLEXSPI1_A_DATA03 of instance: FLEXSPI1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_enet_1g_TX_CLK_IO</name>
                  <description>Select mux mode: ALT2 mux port: ENET_1G_TX_CLK_IO of instance: ENET_1G</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_enet_1g_REF_CLK1</name>
                  <description>Select mux mode: ALT3 mux port: ENET_1G_REF_CLK1 of instance: ENET_1G</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_gpt6_CLK</name>
                  <description>Select mux mode: ALT4 mux port: GPT6_CLK of instance: GPT6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO20</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO20 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpspi2_PCS1</name>
                  <description>Select mux mode: ALT6 mux port: LPSPI2_PCS1 of instance: LPSPI2</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO20</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO20 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_SD_B2_11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_00</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_00 SW MUX Control Register</description>
          <addressOffset>0x1E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_CLK</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_CLK of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_enet_1g_RX_EN</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_RX_EN of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer1_TIMER0</name>
                  <description>Select mux mode: ALT3 mux port: TMR1_TIMER0 of instance: TMR1</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT26</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT26 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO21</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO21 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_RX_EN</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_RX_EN of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO21</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO21 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_00</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
