nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_06</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_06 SW MUX Control Register</description>
          <addressOffset>0x1FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA2</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA02 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_1G_TX_DATA3</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_TX_DATA03 of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpuart4_TX</name>
                  <description>Select mux mode: ALT2 mux port: LPUART4_TXD of instance: LPUART4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer3_TIMER0</name>
                  <description>Select mux mode: ALT3 mux port: TMR3_TIMER0 of instance: TMR3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT32</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT32 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO27</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO27 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG0</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG00 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_TX_DATA3</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_TX_DATA03 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpspi3_SDO</name>
                  <description>Select mux mode: ALT9 mux port: LPSPI3_SOUT of instance: LPSPI3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO27</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO27 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_06</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_07</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_07 SW MUX Control Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA3</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA03 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_1G_TX_DATA2</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_TX_DATA02 of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpuart4_RTS_B</name>
                  <description>Select mux mode: ALT2 mux port: LPUART4_RTS_B of instance: LPUART4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer3_TIMER1</name>
                  <description>Select mux mode: ALT3 mux port: TMR3_TIMER1 of instance: TMR3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT33</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT33 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO28</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO28 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG1</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG01 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_TX_DATA2</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_TX_DATA02 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpspi3_PCS0</name>
                  <description>Select mux mode: ALT9 mux port: LPSPI3_PCS0 of instance: LPSPI3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO28</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO28 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_07</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_08</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_08 SW MUX Control Register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA4</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA04 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_1G_TX_DATA1</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_TX_DATA01 of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_usdhc1_CD_B</name>
                  <description>Select mux mode: ALT2 mux port: USDHC1_CD_B of instance: USDHC1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer3_TIMER2</name>
                  <description>Select mux mode: ALT3 mux port: TMR3_TIMER2 of instance: TMR3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT34</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT34 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO29</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO29 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG2</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG02 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_TX_DATA1</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_TX_DATA01 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpspi3_PCS1</name>
                  <description>Select mux mode: ALT9 mux port: LPSPI3_PCS1 of instance: LPSPI3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO29</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO29 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_08</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_09</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_09 SW MUX Control Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA5</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA05 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_ENET_1G_TX_DATA0</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_TX_DATA00 of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_usdhc1_WP</name>
                  <description>Select mux mode: ALT2 mux port: USDHC1_WP of instance: USDHC1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer4_TIMER0</name>
                  <description>Select mux mode: ALT3 mux port: TMR4_TIMER0 of instance: TMR4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT35</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT35 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO30</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO30 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG3</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG03 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_ENET_QOS_TX_DATA0</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_TX_DATA00 of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpspi3_PCS2</name>
                  <description>Select mux mode: ALT9 mux port: LPSPI3_PCS2 of instance: LPSPI3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO30</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO30 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_09</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_DISP_B1_10</name>
          <description>SW_MUX_CTL_PAD_GPIO_DISP_B1_10 SW MUX Control Register</description>
          <addressOffset>0x20C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_video_mux_LCDIF_DATA6</name>
                  <description>Select mux mode: ALT0 mux port: VIDEO_MUX_LCDIF_DATA06 of instance: VIDEO_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_enet_1g_TX_EN</name>
                  <description>Select mux mode: ALT1 mux port: ENET_1G_TX_EN of instance: ENET_1G</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_usdhc1_RESET_B</name>
                  <description>Select mux mode: ALT2 mux port: USDHC1_RESET_B of instance: USDHC1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_qtimer4_TIMER1</name>
                  <description>Select mux mode: ALT3 mux port: TMR4_TIMER1 of instance: TMR4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_XBAR1_INOUT36</name>
                  <description>Select mux mode: ALT4 mux port: XBAR1_INOUT36 of instance: XBAR1</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux4_IO31</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX4_IO31 of instance: GPIO_MUX4</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_src_BT_CFG4</name>
                  <description>Select mux mode: ALT6 mux port: SRC_BT_CFG04 of instance: SRC</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_enet_qos_TX_EN</name>
                  <description>Select mux mode: ALT8 mux port: ENET_QOS_TX_EN of instance: ENET_QOS</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT9_lpspi3_PCS3</name>
                  <description>Select mux mode: ALT9 mux port: LPSPI3_PCS3 of instance: LPSPI3</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio10_IO31</name>
                  <description>Select mux mode: ALT10 mux port: GPIO10_IO31 of instance: GPIO10</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_DISP_B1_10</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
