nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>ENET_QOS_PHY_RXDV_I_SELECT_INPUT</name>
          <description>ENET_QOS_PHY_RXDV_I_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x4F8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_00_ALT8</name>
                  <description>Selecting Pad: GPIO_DISP_B1_00 for Mode: ALT8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_08_ALT8</name>
                  <description>Selecting Pad: GPIO_DISP_B2_08 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ENET_QOS_PHY_RXER_I_SELECT_INPUT</name>
          <description>ENET_QOS_PHY_RXER_I_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x4FC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B1_01_ALT9</name>
                  <description>Selecting Pad: GPIO_DISP_B1_01 for Mode: ALT9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_09_ALT8</name>
                  <description>Selecting Pad: GPIO_DISP_B2_09 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_DISP_B2_10_ALT8</name>
                  <description>Selecting Pad: GPIO_DISP_B2_10 for Mode: ALT8</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMA_SELECT_INPUT_0</name>
          <description>FLEXPWM1_PWMA_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_23_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_23 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_00_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_00 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMA_SELECT_INPUT_1</name>
          <description>FLEXPWM1_PWMA_SELECT_INPUT_1 DAISY Register</description>
          <addressOffset>0x504</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_25_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_25 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_02_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_02 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMA_SELECT_INPUT_2</name>
          <description>FLEXPWM1_PWMA_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x508</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_27_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_27 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_04_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_04 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMB_SELECT_INPUT_0</name>
          <description>FLEXPWM1_PWMB_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x50C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_24_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_24 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_01_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_01 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMB_SELECT_INPUT_1</name>
          <description>FLEXPWM1_PWMB_SELECT_INPUT_1 DAISY Register</description>
          <addressOffset>0x510</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_26_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_26 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_03_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_03 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM1_PWMB_SELECT_INPUT_2</name>
          <description>FLEXPWM1_PWMB_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x514</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_28_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_28 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_05_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_05 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMA_SELECT_INPUT_0</name>
          <description>FLEXPWM2_PWMA_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x518</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_06_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_06 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_24_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_24 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMA_SELECT_INPUT_1</name>
          <description>FLEXPWM2_PWMA_SELECT_INPUT_1 DAISY Register</description>
          <addressOffset>0x51C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_08_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_08 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_26_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_26 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMA_SELECT_INPUT_2</name>
          <description>FLEXPWM2_PWMA_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x520</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_10_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_10 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_28_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_28 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMB_SELECT_INPUT_0</name>
          <description>FLEXPWM2_PWMB_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x524</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_07_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_07 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_25_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_25 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMB_SELECT_INPUT_1</name>
          <description>FLEXPWM2_PWMB_SELECT_INPUT_1 DAISY Register</description>
          <addressOffset>0x528</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_09_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_09 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_27_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_27 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM2_PWMB_SELECT_INPUT_2</name>
          <description>FLEXPWM2_PWMB_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x52C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_11_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_11 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_29_ALT4</name>
                  <description>Selecting Pad: GPIO_AD_29 for Mode: ALT4</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM3_PWMA_SELECT_INPUT_0</name>
          <description>FLEXPWM3_PWMA_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x530</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_29_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_29 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_00_ALT11</name>
                  <description>Selecting Pad: GPIO_EMC_B2_00 for Mode: ALT11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM3_PWMA_SELECT_INPUT_1</name>
          <description>FLEXPWM3_PWMA_SELECT_INPUT_1 DAISY Register</description>
          <addressOffset>0x534</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_31_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_31 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_02_ALT11</name>
                  <description>Selecting Pad: GPIO_EMC_B2_02 for Mode: ALT11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM3_PWMA_SELECT_INPUT_2</name>
          <description>FLEXPWM3_PWMA_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x538</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_33_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_33 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_04_ALT11</name>
                  <description>Selecting Pad: GPIO_EMC_B2_04 for Mode: ALT11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM3_PWMA_SELECT_INPUT_3</name>
          <description>FLEXPWM3_PWMA_SELECT_INPUT_3 DAISY Register</description>
          <addressOffset>0x53C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_21_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_21 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_06_ALT11</name>
                  <description>Selecting Pad: GPIO_EMC_B2_06 for Mode: ALT11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM3_PWMB_SELECT_INPUT_0</name>
          <description>FLEXPWM3_PWMB_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x540</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_30_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_30 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_01_ALT11</name>
                  <description>Selecting Pad: GPIO_EMC_B2_01 for Mode: ALT11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
