nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>FLEXPWM3_PWMB_SELECT_INPUT_1</name>
          <description>FLEXPWM3_PWMB_SELECT_INPUT_1 DAISY Register</description>
          <addressOffset>0x544</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_32_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_32 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_03_ALT11</name>
                  <description>Selecting Pad: GPIO_EMC_B2_03 for Mode: ALT11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM3_PWMB_SELECT_INPUT_2</name>
          <description>FLEXPWM3_PWMB_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x548</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_34_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_34 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_05_ALT11</name>
                  <description>Selecting Pad: GPIO_EMC_B2_05 for Mode: ALT11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXPWM3_PWMB_SELECT_INPUT_3</name>
          <description>FLEXPWM3_PWMB_SELECT_INPUT_3 DAISY Register</description>
          <addressOffset>0x54C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B1_22_ALT1</name>
                  <description>Selecting Pad: GPIO_EMC_B1_22 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_07_ALT11</name>
                  <description>Selecting Pad: GPIO_EMC_B2_07 for Mode: ALT11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1_I_DQS_FA_SELECT_INPUT</name>
          <description>FLEXSPI1_I_DQS_FA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x550</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_18_ALT6</name>
                  <description>Selecting Pad: GPIO_EMC_B2_18 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_17_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_17 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B2_05_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B2_05 for Mode: ALT1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1_I_IO_FA_SELECT_INPUT_0</name>
          <description>FLEXSPI1_I_IO_FA_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x554</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_20_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_20 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B2_08_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B2_08 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1_I_IO_FA_SELECT_INPUT_1</name>
          <description>FLEXSPI1_I_IO_FA_SELECT_INPUT_1 DAISY Register</description>
          <addressOffset>0x558</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_21_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_21 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B2_09_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B2_09 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1_I_IO_FA_SELECT_INPUT_2</name>
          <description>FLEXSPI1_I_IO_FA_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x55C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_22_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_22 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B2_10_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B2_10 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1_I_IO_FA_SELECT_INPUT_3</name>
          <description>FLEXSPI1_I_IO_FA_SELECT_INPUT_3 DAISY Register</description>
          <addressOffset>0x560</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_23_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_23 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B2_11_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B2_11 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1_I_IO_FB_SELECT_INPUT_0</name>
          <description>FLEXSPI1_I_IO_FB_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x564</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_15_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_15 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B2_03_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B2_03 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1_I_IO_FB_SELECT_INPUT_1</name>
          <description>FLEXSPI1_I_IO_FB_SELECT_INPUT_1 DAISY Register</description>
          <addressOffset>0x568</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_14_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_14 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B2_02_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B2_02 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1_I_IO_FB_SELECT_INPUT_2</name>
          <description>FLEXSPI1_I_IO_FB_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x56C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_13_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_13 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B2_01_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B2_01 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1_I_IO_FB_SELECT_INPUT_3</name>
          <description>FLEXSPI1_I_IO_FB_SELECT_INPUT_3 DAISY Register</description>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_12_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_12 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B2_00_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B2_00 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1_I_SCK_FA_SELECT_INPUT</name>
          <description>FLEXSPI1_I_SCK_FA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x574</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_19_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_19 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B2_07_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B2_07 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI1_I_SCK_FB_SELECT_INPUT</name>
          <description>FLEXSPI1_I_SCK_FB_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x578</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_AD_16_ALT3</name>
                  <description>Selecting Pad: GPIO_AD_16 for Mode: ALT3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B2_04_ALT1</name>
                  <description>Selecting Pad: GPIO_SD_B2_04 for Mode: ALT1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_I_IO_FA_SELECT_INPUT_0</name>
          <description>FLEXSPI2_I_IO_FA_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x57C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_13_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_B2_13 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B1_02_ALT6</name>
                  <description>Selecting Pad: GPIO_SD_B1_02 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_I_IO_FA_SELECT_INPUT_1</name>
          <description>FLEXSPI2_I_IO_FA_SELECT_INPUT_1 DAISY Register</description>
          <addressOffset>0x580</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_14_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_B2_14 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B1_03_ALT6</name>
                  <description>Selecting Pad: GPIO_SD_B1_03 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_I_IO_FA_SELECT_INPUT_2</name>
          <description>FLEXSPI2_I_IO_FA_SELECT_INPUT_2 DAISY Register</description>
          <addressOffset>0x584</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_15_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_B2_15 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B1_04_ALT6</name>
                  <description>Selecting Pad: GPIO_SD_B1_04 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_I_IO_FA_SELECT_INPUT_3</name>
          <description>FLEXSPI2_I_IO_FA_SELECT_INPUT_3 DAISY Register</description>
          <addressOffset>0x588</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_16_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_B2_16 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B1_05_ALT6</name>
                  <description>Selecting Pad: GPIO_SD_B1_05 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLEXSPI2_I_SCK_FA_SELECT_INPUT</name>
          <description>FLEXSPI2_I_SCK_FA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x58C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_EMC_B2_10_ALT4</name>
                  <description>Selecting Pad: GPIO_EMC_B2_10 for Mode: ALT4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_SD_B1_01_ALT6</name>
                  <description>Selecting Pad: GPIO_SD_B1_01 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
