nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>EMVSIM1</name>
      <description>EMVSIM</description>
      <groupName>EMVSIM</groupName>
      <headerStructName>EMVSIM</headerStructName>
      <baseAddress>0x40154000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4C</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EMVSIM1</name>
        <value>204</value>
      </interrupt>
      <registers>
        <register>
          <name>VER_ID</name>
          <description>Version ID Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VER</name>
              <description>Version ID of the module</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RX_FIFO_DEPTH</name>
              <description>Receive FIFO Depth</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_FIFO_DEPTH</name>
              <description>Transmit FIFO Depth</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKCFG</name>
          <description>Clock Configuration Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLK_PRSC</name>
              <description>Clock Prescaler Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLK_PRSC_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPCNT1_CLK_SEL</name>
              <description>General Purpose Counter 1 Clock Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPCNT1_CLK_SEL_0</name>
                  <description>Disabled / Reset (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPCNT1_CLK_SEL_1</name>
                  <description>Card Clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPCNT1_CLK_SEL_2</name>
                  <description>Receive Clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPCNT1_CLK_SEL_3</name>
                  <description>ETU Clock (transmit clock)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GPCNT0_CLK_SEL</name>
              <description>General Purpose Counter 0 Clock Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPCNT0_CLK_SEL_0</name>
                  <description>Disabled / Reset (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPCNT0_CLK_SEL_1</name>
                  <description>Card Clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPCNT0_CLK_SEL_2</name>
                  <description>Receive Clock</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPCNT0_CLK_SEL_3</name>
                  <description>ETU Clock (transmit clock)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DIVISOR</name>
          <description>Baud Rate Divisor Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x174</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVISOR_VALUE</name>
              <description>Divisor (F/D) Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVISOR_VALUE_0</name>
                  <description>Invalid. As per ISO 7816 specification, minimum value of F/D is 5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISOR_VALUE_1</name>
                  <description>Invalid. As per ISO 7816 specification, minimum value of F/D is 5</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISOR_VALUE_2</name>
                  <description>Invalid. As per ISO 7816 specification, minimum value of F/D is 5</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISOR_VALUE_3</name>
                  <description>Invalid. As per ISO 7816 specification, minimum value of F/D is 5</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISOR_VALUE_4</name>
                  <description>Invalid. As per ISO 7816 specification, minimum value of F/D is 5</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVISOR_VALUE_372</name>
                  <description>Divisor value for F = 372 and D = 1 (default)</description>
                  <value>0x174</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
