nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>C3</name>
          <description>CMP Control Register 3</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x11000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACPH2TC</name>
              <description>Analog Comparator Phase2 Timing Control.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACPH2TC_0</name>
                  <description>Phase2 active time in one sampling period equals to T</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH2TC_1</name>
                  <description>Phase2 active time in one sampling period equals to 2*T</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH2TC_2</name>
                  <description>Phase2 active time in one sampling period equals to 4*T</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH2TC_3</name>
                  <description>Phase2 active time in one sampling period equals to 8*T</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH2TC_4</name>
                  <description>Phase2 active time in one sampling period equals to 16*T</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH2TC_5</name>
                  <description>Phase2 active time in one sampling period equals to 32*T</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH2TC_6</name>
                  <description>Phase2 active time in one sampling period equals to 64*T</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH2TC_7</name>
                  <description>Phase2 active time in one sampling period equals to 16*T</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACPH1TC</name>
              <description>Analog Comparator Phase1 Timing Control.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACPH1TC_0</name>
                  <description>Phase1 active time in one sampling period equals to T</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH1TC_1</name>
                  <description>Phase1 active time in one sampling period equals to 2*T</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH1TC_2</name>
                  <description>Phase1 active time in one sampling period equals to 4*T</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH1TC_3</name>
                  <description>Phase1 active time in one sampling period equals to 8*T</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH1TC_4</name>
                  <description>Phase1 active time in one sampling period equals to T</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH1TC_5</name>
                  <description>Phase1 active time in one sampling period equals to T</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH1TC_6</name>
                  <description>Phase1 active time in one sampling period equals to T</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACPH1TC_7</name>
                  <description>Phase1 active time in one sampling period equals to 0</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACSAT</name>
              <description>Analog Comparator Sampling Time control.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACSAT_0</name>
                  <description>The sampling time equals to T</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACSAT_1</name>
                  <description>The sampling time equasl to 2*T</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACSAT_2</name>
                  <description>The sampling time equasl to 4*T</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACSAT_3</name>
                  <description>The sampling time equasl to 8*T</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACSAT_4</name>
                  <description>The sampling time equasl to 16*T</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACSAT_5</name>
                  <description>The sampling time equasl to 32*T</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACSAT_6</name>
                  <description>The sampling time equasl to 64*T</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACSAT_7</name>
                  <description>The sampling time equasl to 256*T</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMCS</name>
              <description>Discrete Mode Clock Selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMCS_0</name>
                  <description>Slow clock is selected for the timing generation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMCS_1</name>
                  <description>Fast clock is selected for the timing generation.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RDIVE</name>
              <description>Resistor Divider Enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RDIVE_0</name>
                  <description>The resistor is not enabled even when either NCHEN or PCHEN is set to1 but the actual input is in the range of 0 - 1.8v.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RDIVE_1</name>
                  <description>The resistor is enabled because the inputs are above 1.8v.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCHCTEN</name>
              <description>Negative Channel Continuous Mode Enable.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NCHCTEN_0</name>
                  <description>Negative channel is in Discrete Mode and special timing needs to be configured.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NCHCTEN_1</name>
                  <description>Negative channel is in Continuous Mode and no special timing is requried.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PCHCTEN</name>
              <description>Positive Channel Continuous Mode Enable.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PCHCTEN_0</name>
                  <description>Positive channel is in Discrete Mode and special timing needs to be configured.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PCHCTEN_1</name>
                  <description>Positive channel is in Continuous Mode and no special timing is requried.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
