nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="SAI2">
      <name>SAI3</name>
      <description>I2S</description>
      <groupName>SAI</groupName>
      <baseAddress>0x4040C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SAI3_RX</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>SAI3_TX</name>
        <value>79</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="SAI2">
      <name>SAI4</name>
      <description>I2S</description>
      <groupName>SAI</groupName>
      <baseAddress>0x40C40000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE4</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>SAI4_RX</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>SAI4_TX</name>
        <value>81</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>ASRC</name>
      <description>ASRC Registers</description>
      <groupName>ASRC</groupName>
      <prependToName>ASRC_</prependToName>
      <baseAddress>0x40414000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xCC</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ASRC</name>
        <value>97</value>
      </interrupt>
      <registers>
        <register>
          <name>ASRCTR</name>
          <description>ASRC Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ASRCEN</name>
              <description>ASRC Enable Enable the operation of ASRC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASREA</name>
              <description>ASRC Enable A Enable the operation of the conversion A of ASRC</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASREB</name>
              <description>ASRC Enable B Enable the operation of the conversion B of ASRC</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASREC</name>
              <description>ASRC Enable C Enable the operation of the conversion C of ASRC</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SRST</name>
              <description>Software Reset This bit is self-clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>IDRA</name>
              <description>Use Ideal Ratio for Pair A When USRA=0, this bit has no usage</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USRA</name>
              <description>Use Ratio for Pair A Use ratio as the input to ASRC</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDRB</name>
              <description>Use Ideal Ratio for Pair B When USRB=0, this bit has no usage</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USRB</name>
              <description>Use Ratio for Pair B Use ratio as the input to ASRC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IDRC</name>
              <description>Use Ideal Ratio for Pair C When USRC=0, this bit has no usage</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USRC</name>
              <description>Use Ratio for Pair C Use ratio as the input to ASRC</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSA</name>
              <description>ASRC Pair A Automatic Selection For Processing Options When this bit is 1, pair A will automatic update its pre-processing and post-processing options (ASRCFG: PREMODA, ASRCFG:POSTMODA see ASRC Misc Control Register 1 for Pair CASRC Filter Configuration Status Register ) based on the frequencies it detected</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSB</name>
              <description>ASRC Pair B Automatic Selection For Processing Options When this bit is 1, pair B will automatic update its pre-processing and post-processing options (ASRCFG: PREMODB, ASRCFG:POSTMODB see ASRC Misc Control Register 1 for Pair CASRC Filter Configuration Status Register ) based on the frequencies it detected</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ATSC</name>
              <description>ASRC Pair C Automatic Selection For Processing Options When this bit is 1, pair C will automatic update its pre-processing and post-processing options (ASRCFG: PREMODC, ASRCFG:POSTMODC see ASRC Misc Control Register 1 for Pair CASRC Filter Configuration Status Register ) based on the frequencies it detected</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASRIER</name>
          <description>ASRC Interrupt Enable Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADIEA</name>
              <description>Data Input A Interrupt Enable Enables the data input A Interrupt.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADIEA_0</name>
                  <description>interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADIEA_1</name>
                  <description>interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADIEB</name>
              <description>Data Input B Interrupt Enable Enables the data input B interrupt.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADIEB_0</name>
                  <description>interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADIEB_1</name>
                  <description>interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADIEC</name>
              <description>Data Input C Interrupt Enable Enables the data input C interrupt.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADIEC_0</name>
                  <description>interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADIEC_1</name>
                  <description>interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADOEA</name>
              <description>Data Output A Interrupt Enable Enables the data output A interrupt.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADOEA_0</name>
                  <description>interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADOEA_1</name>
                  <description>interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADOEB</name>
              <description>Data Output B Interrupt Enable Enables the data output B interrupt.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADOEB_0</name>
                  <description>interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADOEB_1</name>
                  <description>interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADOEC</name>
              <description>Data Output C Interrupt Enable Enables the data output C interrupt.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADOEC_0</name>
                  <description>interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADOEC_1</name>
                  <description>interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AOLIE</name>
              <description>Overload Interrupt Enable Enables the overload interrupt.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AOLIE_0</name>
                  <description>interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOLIE_1</name>
                  <description>interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AFPWE</name>
              <description>FP in Wait State Interrupt Enable Enables the FP in wait state interrupt.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AFPWE_0</name>
                  <description>interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFPWE_1</name>
                  <description>interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASRCNCR</name>
          <description>ASRC Channel Number Configuration Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANCA</name>
              <description>Number of A Channels</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANCA_0</name>
                  <description>0 channels in A (Pair A is disabled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCA_1</name>
                  <description>1 channel in A</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCA_2</name>
                  <description>2 channels in A</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCA_3</name>
                  <description>3 channels in A</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCA_4</name>
                  <description>4 channels in A</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCA_5</name>
                  <description>5 channels in A</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCA_6</name>
                  <description>6 channels in A</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCA_7</name>
                  <description>7 channels in A</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCA_8</name>
                  <description>8 channels in A</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCA_9</name>
                  <description>9 channels in A</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCA_10</name>
                  <description>10 channels in A</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANCB</name>
              <description>Number of B Channels</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANCB_0</name>
                  <description>0 channels in B (Pair B is disabled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCB_1</name>
                  <description>1 channel in B</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCB_2</name>
                  <description>2 channels in B</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCB_3</name>
                  <description>3 channels in B</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCB_4</name>
                  <description>4 channels in B</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCB_5</name>
                  <description>5 channels in B</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCB_6</name>
                  <description>6 channels in B</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCB_7</name>
                  <description>7 channels in B</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCB_8</name>
                  <description>8 channels in B</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCB_9</name>
                  <description>9 channels in B</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCB_10</name>
                  <description>10 channels in B</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ANCC</name>
              <description>Number of C ChannelsANCC+ANCB+ANCA&lt;=10</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ANCC_0</name>
                  <description>0 channels in C (Pair C is disabled)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCC_1</name>
                  <description>1 channel in C</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCC_2</name>
                  <description>2 channels in C</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCC_3</name>
                  <description>3 channels in C</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCC_4</name>
                  <description>4 channels in C</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCC_5</name>
                  <description>5 channels in C</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCC_6</name>
                  <description>6 channels in C</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCC_7</name>
                  <description>7 channels in C</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCC_8</name>
                  <description>8 channels in C</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCC_9</name>
                  <description>9 channels in C</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ANCC_10</name>
                  <description>10 channels in C</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
