nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>ASRCSR</name>
          <description>ASRC Clock Source Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AICSA</name>
              <description>Input Clock Source A</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AICSA_0</name>
                  <description>bit clock 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_1</name>
                  <description>bit clock 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_2</name>
                  <description>bit clock 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_3</name>
                  <description>bit clock 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_4</name>
                  <description>bit clock 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_5</name>
                  <description>bit clock 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_6</name>
                  <description>bit clock 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_7</name>
                  <description>bit clock 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_8</name>
                  <description>bit clock 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_9</name>
                  <description>bit clock 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_10</name>
                  <description>bit clock A</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_11</name>
                  <description>bit clock B</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_12</name>
                  <description>bit clock C</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_13</name>
                  <description>bit clock D</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_14</name>
                  <description>bit clock E</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSA_15</name>
                  <description>clock disabled, connected to zero</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AICSB</name>
              <description>Input Clock Source B</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AICSB_0</name>
                  <description>bit clock 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_1</name>
                  <description>bit clock 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_2</name>
                  <description>bit clock 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_3</name>
                  <description>bit clock 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_4</name>
                  <description>bit clock 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_5</name>
                  <description>bit clock 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_6</name>
                  <description>bit clock 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_7</name>
                  <description>bit clock 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_8</name>
                  <description>bit clock 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_9</name>
                  <description>bit clock 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_10</name>
                  <description>bit clock A</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_11</name>
                  <description>bit clock B</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_12</name>
                  <description>bit clock C</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_13</name>
                  <description>bit clock D</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_14</name>
                  <description>bit clock E</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSB_15</name>
                  <description>clock disabled, connected to zero</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AICSC</name>
              <description>Input Clock Source C</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AICSC_0</name>
                  <description>bit clock 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_1</name>
                  <description>bit clock 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_2</name>
                  <description>bit clock 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_3</name>
                  <description>bit clock 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_4</name>
                  <description>bit clock 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_5</name>
                  <description>bit clock 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_6</name>
                  <description>bit clock 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_7</name>
                  <description>bit clock 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_8</name>
                  <description>bit clock 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_9</name>
                  <description>bit clock 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_10</name>
                  <description>bit clock A</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_11</name>
                  <description>bit clock B</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_12</name>
                  <description>bit clock C</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_13</name>
                  <description>bit clock D</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_14</name>
                  <description>bit clock E</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AICSC_15</name>
                  <description>clock disabled, connected to zero</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AOCSA</name>
              <description>Output Clock Source A</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AOCSA_0</name>
                  <description>bit clock 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_1</name>
                  <description>bit clock 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_2</name>
                  <description>bit clock 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_3</name>
                  <description>bit clock 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_4</name>
                  <description>bit clock 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_5</name>
                  <description>bit clock 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_6</name>
                  <description>bit clock 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_7</name>
                  <description>bit clock 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_8</name>
                  <description>bit clock 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_9</name>
                  <description>bit clock 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_10</name>
                  <description>bit clock A</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_11</name>
                  <description>bit clock B</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_12</name>
                  <description>bit clock C</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_13</name>
                  <description>bit clock D</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_14</name>
                  <description>bit clock E</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSA_15</name>
                  <description>clock disabled, connected to zero</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AOCSB</name>
              <description>Output Clock Source B</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AOCSB_0</name>
                  <description>bit clock 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_1</name>
                  <description>bit clock 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_2</name>
                  <description>bit clock 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_3</name>
                  <description>bit clock 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_4</name>
                  <description>bit clock 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_5</name>
                  <description>bit clock 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_6</name>
                  <description>bit clock 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_7</name>
                  <description>bit clock 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_8</name>
                  <description>bit clock 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_9</name>
                  <description>bit clock 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_10</name>
                  <description>bit clock A</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_11</name>
                  <description>bit clock B</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_12</name>
                  <description>bit clock C</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_13</name>
                  <description>bit clock D</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_14</name>
                  <description>bit clock E</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSB_15</name>
                  <description>clock disabled, connected to zero</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AOCSC</name>
              <description>Output Clock Source C</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AOCSC_0</name>
                  <description>bit clock 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_1</name>
                  <description>bit clock 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_2</name>
                  <description>bit clock 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_3</name>
                  <description>bit clock 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_4</name>
                  <description>bit clock 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_5</name>
                  <description>bit clock 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_6</name>
                  <description>bit clock 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_7</name>
                  <description>bit clock 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_8</name>
                  <description>bit clock 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_9</name>
                  <description>bit clock 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_10</name>
                  <description>bit clock A</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_11</name>
                  <description>bit clock B</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_12</name>
                  <description>bit clock C</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_13</name>
                  <description>bit clock D</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_14</name>
                  <description>bit clock E</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AOCSC_15</name>
                  <description>clock disabled, connected to zero</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
