nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>ASR56K</name>
          <description>ASRC 56 kHz Period in terms of ASRC processing clock</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xDF3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ASR56K</name>
              <description>Value for the period of the 56 kHz sampling clock</description>
              <bitOffset>0</bitOffset>
              <bitWidth>17</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASRMCRA</name>
          <description>ASRC Misc Control Register for Pair A</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INFIFO_THRESHOLDA</name>
              <description>The threshold for Pair A's input FIFO per channel These bits stand for the threshold for Pair A's input FIFO per channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSYNOFA</name>
              <description>Re-sync Output FIFO Channel Counter If bit set, force ASRCCR:ACOA=0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSYNIFA</name>
              <description>Re-sync Input FIFO Channel Counter If bit set, force ASRCCR:ACIA=0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_THRESHOLDA</name>
              <description>The threshold for Pair A's output FIFO per channel These bits stand for the threshold for Pair A's output FIFO per channel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASSPOLYA</name>
              <description>Bypass Polyphase Filtering for Pair A This bit will determine whether the polyphase filtering part of Pair A conversion will be bypassed</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASSPOLYA_0</name>
                  <description>Don't bypass polyphase filtering.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASSPOLYA_1</name>
                  <description>Bypass polyphase filtering.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUFSTALLA</name>
              <description>Stall Pair A conversion in case of Buffer Near Empty/Full Condition This bit will determine whether the near empty/full FIFO condition will stall the rate conversion for pair A</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFSTALLA_0</name>
                  <description>Don't stall Pair A conversion even in case of near empty/full FIFO conditions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFSTALLA_1</name>
                  <description>Stall Pair A conversion in case of near empty/full FIFO conditions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTTHRSHA</name>
              <description>Use external thresholds for FIFO control of Pair A This bit will determine whether the FIFO thresholds externally defined in this register is used to control ASRC internal FIFO logic for pair A</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTTHRSHA_0</name>
                  <description>Use default thresholds.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTTHRSHA_1</name>
                  <description>Use external defined thresholds.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZEROBUFA</name>
              <description>Initialize buf of Pair A when pair A is enabled</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZEROBUFA_0</name>
                  <description>Zeroize the buffer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZEROBUFA_1</name>
                  <description>Don't zeroize the buffer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASRFSTA</name>
          <description>ASRC FIFO Status Register for Pair A</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INFIFO_FILLA</name>
              <description>The fillings for Pair A's input FIFO per channel These bits stand for the fillings for Pair A's input FIFO per channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAEA</name>
              <description>Input FIFO is near Empty for Pair A This bit is to indicate whether the input FIFO of Pair A is near empty</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_FILLA</name>
              <description>The fillings for Pair A's output FIFO per channel These bits stand for the fillings for Pair A's output FIFO per channel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OAFA</name>
              <description>Output FIFO is near Full for Pair A This bit is to indicate whether the output FIFO of Pair A is near full</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASRMCRB</name>
          <description>ASRC Misc Control Register for Pair B</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INFIFO_THRESHOLDB</name>
              <description>The threshold for Pair B's input FIFO per channel These bits stand for the threshold for Pair B's input FIFO per channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSYNOFB</name>
              <description>Re-sync Output FIFO Channel Counter If bit set, force ASRCCR:ACOB=0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSYNIFB</name>
              <description>Re-sync Input FIFO Channel Counter If bit set, force ASRCCR:ACIB=0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_THRESHOLDB</name>
              <description>The threshold for Pair B's output FIFO per channel These bits stand for the threshold for Pair B's output FIFO per channel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASSPOLYB</name>
              <description>Bypass Polyphase Filtering for Pair B This bit will determine whether the polyphase filtering part of Pair B conversion will be bypassed</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASSPOLYB_0</name>
                  <description>Don't bypass polyphase filtering.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASSPOLYB_1</name>
                  <description>Bypass polyphase filtering.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUFSTALLB</name>
              <description>Stall Pair B conversion in case of Buffer Near Empty/Full Condition This bit will determine whether the near empty/full FIFO condition will stall the rate conversion for pair B</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFSTALLB_0</name>
                  <description>Don't stall Pair B conversion even in case of near empty/full FIFO conditions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFSTALLB_1</name>
                  <description>Stall Pair B conversion in case of near empty/full FIFO conditions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTTHRSHB</name>
              <description>Use external thresholds for FIFO control of Pair B This bit will determine whether the FIFO thresholds externally defined in this register is used to control ASRC internal FIFO logic for pair B</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTTHRSHB_0</name>
                  <description>Use default thresholds.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTTHRSHB_1</name>
                  <description>Use external defined thresholds.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZEROBUFB</name>
              <description>Initialize buf of Pair B when pair B is enabled This bit is used to control whether the buffer is to be zeroized when pair B is enabled</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZEROBUFB_0</name>
                  <description>Zeroize the buffer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZEROBUFB_1</name>
                  <description>Don't zeroize the buffer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASRFSTB</name>
          <description>ASRC FIFO Status Register for Pair B</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INFIFO_FILLB</name>
              <description>The fillings for Pair B's input FIFO per channel These bits stand for the fillings for Pair B's input FIFO per channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAEB</name>
              <description>Input FIFO is near Empty for Pair B This bit is to indicate whether the input FIFO of Pair B is near empty</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_FILLB</name>
              <description>The fillings for Pair B's output FIFO per channel These bits stand for the fillings for Pair B's output FIFO per channel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OAFB</name>
              <description>Output FIFO is near Full for Pair B This bit is to indicate whether the output FIFO of Pair B is near full</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASRMCRC</name>
          <description>ASRC Misc Control Register for Pair C</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INFIFO_THRESHOLDC</name>
              <description>The threshold for Pair C's input FIFO per channel These bits stand for the threshold for Pair C's input FIFO per channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSYNOFC</name>
              <description>Re-sync Output FIFO Channel Counter If bit set, force ASRCCR:ACOC=0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSYNIFC</name>
              <description>Re-sync Input FIFO Channel Counter If bit set, force ASRCCR:ACIC=0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTFIFO_THRESHOLDC</name>
              <description>The threshold for Pair C's output FIFO per channel These bits stand for the threshold for Pair C's output FIFO per channel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASSPOLYC</name>
              <description>Bypass Polyphase Filtering for Pair C This bit will determine whether the polyphase filtering part of Pair C conversion will be bypassed</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BYPASSPOLYC_0</name>
                  <description>Don't bypass polyphase filtering.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASSPOLYC_1</name>
                  <description>Bypass polyphase filtering.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BUFSTALLC</name>
              <description>Stall Pair C conversion in case of Buffer Near Empty/Full Condition This bit will determine whether the near empty/full FIFO condition will stall the rate conversion for pair C</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUFSTALLC_0</name>
                  <description>Don't stall Pair C conversion even in case of near empty/full FIFO conditions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUFSTALLC_1</name>
                  <description>Stall Pair C conversion in case of near empty/full FIFO conditions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXTTHRSHC</name>
              <description>Use external thresholds for FIFO control of Pair C This bit will determine whether the FIFO thresholds externally defined in this register is used to control ASRC internal FIFO logic for pair C</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EXTTHRSHC_0</name>
                  <description>Use default thresholds.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXTTHRSHC_1</name>
                  <description>Use external defined thresholds.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ZEROBUFC</name>
              <description>Initialize buf of Pair C when pair C is enabled This bit is used to control whether the buffer is to be zeroized when pair C is enabled</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZEROBUFC_0</name>
                  <description>Zeroize the buffer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZEROBUFC_1</name>
                  <description>Don't zeroize the buffer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ASRFSTC</name>
          <description>ASRC FIFO Status Register for Pair C</description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INFIFO_FILLC</name>
              <description>The fillings for Pair C's input FIFO per channel These bits stand for the fillings for Pair C's input FIFO per channel</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IAEC</name>
              <description>Input FIFO is near Empty for Pair C This bit is to indicate whether the input FIFO of Pair C is near empty</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUTFIFO_FILLC</name>
              <description>The fillings for Pair C's output FIFO per channel These bits stand for the fillings for Pair C's output FIFO per channel</description>
              <bitOffset>12</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OAFC</name>
              <description>Output FIFO is near Full for Pair C This bit is to indicate whether the output FIFO of Pair C is near full</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
