nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <dim>3</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>A,B,C</dimIndex>
          <name>ASRMCR1%s</name>
          <description>ASRC Misc Control Register 1 for Pair X</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OW16</name>
              <description>Bit Width Option of the output FIFO This bit will determine the bit width option of the output FIFO</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OW16_0</name>
                  <description>24-bit output data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OW16_1</name>
                  <description>16-bit output data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OSGN</name>
              <description>Sign Extension Option of the output FIFO This bit will determine the sign extension option of the output FIFO</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSGN_0</name>
                  <description>No sign extension.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSGN_1</name>
                  <description>Sign extension.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OMSB</name>
              <description>Data Alignment of the output FIFO This bit will determine the data alignment of the output FIFO.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OMSB_0</name>
                  <description>LSB aligned.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OMSB_1</name>
                  <description>MSB aligned.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IMSB</name>
              <description>Data Alignment of the input FIFO This bit will determine the data alignment of the input FIFO.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IMSB_0</name>
                  <description>LSB aligned.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IMSB_1</name>
                  <description>MSB aligned.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IWD</name>
              <description>Data Width of the input FIFO These three bits will determine the bitwidth for the audio data into ASRC All other settings not shown are reserved</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USDHC1</name>
      <description>uSDHC</description>
      <groupName>USDHC</groupName>
      <headerStructName>USDHC</headerStructName>
      <baseAddress>0x40418000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x160</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>USDHC1</name>
        <value>133</value>
      </interrupt>
      <registers>
        <register>
          <name>DS_ADDR</name>
          <description>DMA System Address</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DS_ADDR</name>
              <description>System address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLK_ATT</name>
          <description>Block Attributes</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BLKSIZE</name>
              <description>Transfer block size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLKSIZE_0</name>
                  <description>No data transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_1</name>
                  <description>1 byte</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_2</name>
                  <description>2 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_3</name>
                  <description>3 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_4</name>
                  <description>4 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_511</name>
                  <description>511 bytes</description>
                  <value>0x1FF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_512</name>
                  <description>512 bytes</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_2048</name>
                  <description>2048 bytes</description>
                  <value>0x800</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKSIZE_4096</name>
                  <description>4096 bytes</description>
                  <value>0x1000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLKCNT</name>
              <description>Blocks count for current transfer</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BLKCNT_0</name>
                  <description>Stop count</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKCNT_1</name>
                  <description>1 block</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKCNT_2</name>
                  <description>2 blocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BLKCNT_65535</name>
                  <description>65535 blocks</description>
                  <value>0xFFFF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_ARG</name>
          <description>Command Argument</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDARG</name>
              <description>Command argument</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_XFR_TYP</name>
          <description>Command Transfer Type</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSPTYP</name>
              <description>Response type select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RSPTYP_0</name>
                  <description>No response</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSPTYP_1</name>
                  <description>Response length 136</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSPTYP_2</name>
                  <description>Response length 48</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSPTYP_3</name>
                  <description>Response length 48, check busy after response</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCCEN</name>
              <description>Command CRC check enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCCEN_0</name>
                  <description>Disables command CRC check</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCCEN_1</name>
                  <description>Enables command CRC check</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CICEN</name>
              <description>Command index check enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CICEN_0</name>
                  <description>Disable command index check</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CICEN_1</name>
                  <description>Enables command index check</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPSEL</name>
              <description>Data present select</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPSEL_0</name>
                  <description>No data present</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPSEL_1</name>
                  <description>Data present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDTYP</name>
              <description>Command type</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMDTYP_0</name>
                  <description>Normal other commands</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDTYP_1</name>
                  <description>Suspend CMD52 for writing bus suspend in CCCR</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDTYP_2</name>
                  <description>Resume CMD52 for writing function select in CCCR</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMDTYP_3</name>
                  <description>Abort CMD12, CMD52 for writing I/O Abort in CCCR</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDINX</name>
              <description>Command index</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_RSP0</name>
          <description>Command Response0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDRSP0</name>
              <description>Command response 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_RSP1</name>
          <description>Command Response1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDRSP1</name>
              <description>Command response 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_RSP2</name>
          <description>Command Response2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDRSP2</name>
              <description>Command response 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CMD_RSP3</name>
          <description>Command Response3</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMDRSP3</name>
              <description>Command response 3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DATA_BUFF_ACC_PORT</name>
          <description>Data Buffer Access Port</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATCONT</name>
              <description>Data content</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
