nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>PWD_TOG</name>
          <description>USB PHY Power-Down Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1E1C00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TXPWDFS</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXPWDFS_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXPWDFS_1</name>
                  <description>Power-down the USB full-speed drivers. This turns off the current starvation sources and puts the drivers into high-impedance output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPWDIBIAS</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXPWDIBIAS_0</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXPWDIBIAS_1</name>
                  <description>Power-down the USB PHY current bias block for the transmitter. This bit should be set only when the USB is in suspend mode. This effectively powers down the entire USB transmit path</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXPWDV2I</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXPWDV2I_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXPWDV2I_1</name>
                  <description>Power-down the USB PHY transmit V-to-I converter and the current mirror</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXPWDENV</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXPWDENV_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPWDENV_1</name>
                  <description>Power-down the USB high-speed receiver envelope detector (squelch signal)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXPWD1PT1</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXPWD1PT1_0</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPWD1PT1_1</name>
                  <description>Power-down the USB full-speed differential receiver.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXPWDDIFF</name>
              <description>Note that this bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXPWDDIFF_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPWDDIFF_1</name>
                  <description>Power-down the USB high-speed differential receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXPWDRX</name>
              <description>This bit will be auto cleared if there is USB wakeup event while ENAUTOCLR_PHY_PWD bit of USBPHY_CTRL is enabled</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXPWDRX_0</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXPWDRX_1</name>
                  <description>Power-down the entire USB PHY receiver block except for the full-speed differential receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TX</name>
          <description>USB PHY Transmitter Control Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10080807</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D_CAL</name>
              <description>Decode to trim the nominal 17</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D_CAL_0</name>
                  <description>Maximum current, approximately 19% above nominal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_CAL_7</name>
                  <description>Nominal</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_CAL_15</name>
                  <description>Minimum current, approximately 19% below nominal.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXCAL45DM</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DM output pin</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXCAL45DM_0</name>
                  <description>+19.95%</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_1</name>
                  <description>+17.35%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_2</name>
                  <description>+14.85%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_3</name>
                  <description>+12.46%</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_4</name>
                  <description>+9.07%</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_5</name>
                  <description>+5.87%</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_6</name>
                  <description>+2.85%</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_7</name>
                  <description>0%</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_8</name>
                  <description>-2.70%</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_9</name>
                  <description>-5.25%</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_10</name>
                  <description>-7.67%</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_11</name>
                  <description>-9.98%</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_12</name>
                  <description>-12.17%</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_13</name>
                  <description>-14.25%</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_14</name>
                  <description>-18.14%</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_15</name>
                  <description>-21.68%</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXENCAL45DM</name>
              <description>Enable resistance calibration on DM.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCAL45DP</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DP output pin</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXCAL45DP_0</name>
                  <description>+19.95%</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_1</name>
                  <description>+17.35%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_2</name>
                  <description>+14.85%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_3</name>
                  <description>+12.46%</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_4</name>
                  <description>+9.07%</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_5</name>
                  <description>+5.87%</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_6</name>
                  <description>+2.85%</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_7</name>
                  <description>0%</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_8</name>
                  <description>-2.70%</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_9</name>
                  <description>-5.25%</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_10</name>
                  <description>-7.67%</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_11</name>
                  <description>-9.98%</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_12</name>
                  <description>-12.17%</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_13</name>
                  <description>-14.25%</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_14</name>
                  <description>-18.14%</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_15</name>
                  <description>-21.68%</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXENCAL45DP</name>
              <description>Enable resistance calibration on DP.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
