nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>TX_TOG</name>
          <description>USB PHY Transmitter Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10080807</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>D_CAL</name>
              <description>Decode to trim the nominal 17</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D_CAL_0</name>
                  <description>Maximum current, approximately 19% above nominal.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_CAL_7</name>
                  <description>Nominal</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_CAL_15</name>
                  <description>Minimum current, approximately 19% below nominal.</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXCAL45DM</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DM output pin</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXCAL45DM_0</name>
                  <description>+19.95%</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_1</name>
                  <description>+17.35%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_2</name>
                  <description>+14.85%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_3</name>
                  <description>+12.46%</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_4</name>
                  <description>+9.07%</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_5</name>
                  <description>+5.87%</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_6</name>
                  <description>+2.85%</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_7</name>
                  <description>0%</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_8</name>
                  <description>-2.70%</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_9</name>
                  <description>-5.25%</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_10</name>
                  <description>-7.67%</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_11</name>
                  <description>-9.98%</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_12</name>
                  <description>-12.17%</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_13</name>
                  <description>-14.25%</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_14</name>
                  <description>-18.14%</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DM_15</name>
                  <description>-21.68%</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXENCAL45DM</name>
              <description>Enable resistance calibration on DM.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCAL45DP</name>
              <description>Decode to trim the nominal 45ohm series termination resistance to the USB_DP output pin</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXCAL45DP_0</name>
                  <description>+19.95%</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_1</name>
                  <description>+17.35%</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_2</name>
                  <description>+14.85%</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_3</name>
                  <description>+12.46%</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_4</name>
                  <description>+9.07%</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_5</name>
                  <description>+5.87%</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_6</name>
                  <description>+2.85%</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_7</name>
                  <description>0%</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_8</name>
                  <description>-2.70%</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_9</name>
                  <description>-5.25%</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_10</name>
                  <description>-7.67%</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_11</name>
                  <description>-9.98%</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_12</name>
                  <description>-12.17%</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_13</name>
                  <description>-14.25%</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_14</name>
                  <description>-18.14%</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXCAL45DP_15</name>
                  <description>-21.68%</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TXENCAL45DP</name>
              <description>Enable resistance calibration on DP.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RX</name>
          <description>USB PHY Receiver Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENVADJ</name>
              <description>The ENVADJ field adjusts the trip point for the envelope detector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENVADJ_0</name>
                  <description>Trip-Level Voltage is 0.1000 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENVADJ_1</name>
                  <description>Trip-Level Voltage is 0.1125 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENVADJ_2</name>
                  <description>Trip-Level Voltage is 0.1250 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENVADJ_3</name>
                  <description>Trip-Level Voltage is 0.0875 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONADJ</name>
              <description>The DISCONADJ field adjusts the trip point for the disconnect detector.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISCONADJ_0</name>
                  <description>Trip-Level Voltage is 0.56875 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONADJ_1</name>
                  <description>Trip-Level Voltage is 0.55000 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONADJ_2</name>
                  <description>Trip-Level Voltage is 0.58125 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONADJ_3</name>
                  <description>Trip-Level Voltage is 0.60000 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDBYPASS</name>
              <description>This test mode is intended for lab use only, replace FS differential receiver with DP single ended receiver</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXDBYPASS_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXDBYPASS_1</name>
                  <description>Use the output of the USB_DP single-ended receiver in place of the full-speed differential receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_SET</name>
          <description>USB PHY Receiver Control Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENVADJ</name>
              <description>The ENVADJ field adjusts the trip point for the envelope detector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENVADJ_0</name>
                  <description>Trip-Level Voltage is 0.1000 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENVADJ_1</name>
                  <description>Trip-Level Voltage is 0.1125 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENVADJ_2</name>
                  <description>Trip-Level Voltage is 0.1250 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENVADJ_3</name>
                  <description>Trip-Level Voltage is 0.0875 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONADJ</name>
              <description>The DISCONADJ field adjusts the trip point for the disconnect detector.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISCONADJ_0</name>
                  <description>Trip-Level Voltage is 0.56875 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONADJ_1</name>
                  <description>Trip-Level Voltage is 0.55000 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONADJ_2</name>
                  <description>Trip-Level Voltage is 0.58125 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONADJ_3</name>
                  <description>Trip-Level Voltage is 0.60000 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDBYPASS</name>
              <description>This test mode is intended for lab use only, replace FS differential receiver with DP single ended receiver</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXDBYPASS_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXDBYPASS_1</name>
                  <description>Use the output of the USB_DP single-ended receiver in place of the full-speed differential receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RX_CLR</name>
          <description>USB PHY Receiver Control Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENVADJ</name>
              <description>The ENVADJ field adjusts the trip point for the envelope detector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENVADJ_0</name>
                  <description>Trip-Level Voltage is 0.1000 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENVADJ_1</name>
                  <description>Trip-Level Voltage is 0.1125 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENVADJ_2</name>
                  <description>Trip-Level Voltage is 0.1250 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENVADJ_3</name>
                  <description>Trip-Level Voltage is 0.0875 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCONADJ</name>
              <description>The DISCONADJ field adjusts the trip point for the disconnect detector.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISCONADJ_0</name>
                  <description>Trip-Level Voltage is 0.56875 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONADJ_1</name>
                  <description>Trip-Level Voltage is 0.55000 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONADJ_2</name>
                  <description>Trip-Level Voltage is 0.58125 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCONADJ_3</name>
                  <description>Trip-Level Voltage is 0.60000 V</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXDBYPASS</name>
              <description>This test mode is intended for lab use only, replace FS differential receiver with DP single ended receiver</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RXDBYPASS_0</name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RXDBYPASS_1</name>
                  <description>Use the output of the USB_DP single-ended receiver in place of the full-speed differential receiver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
