nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>USB1_VBUS_DETECT</name>
          <description>USB PHY VBUS Detect Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x700004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>Sets the threshold for the VBUSVALID comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_0</name>
                  <description>4.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_1</name>
                  <description>4.1 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_2</name>
                  <description>4.2 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_3</name>
                  <description>4.3 V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_4</name>
                  <description>4.4 V (Default)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_5</name>
                  <description>4.5 V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_6</name>
                  <description>4.6 V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_7</name>
                  <description>4.7 V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_OVERRIDE_EN</name>
              <description>VBUS detect signal override enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_OVERRIDE_EN_0</name>
                  <description>Use the results of the internal VBUS_VALID and Session Valid comparators for VBUS_VALID, AVALID, BVALID, and SESSEND (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_OVERRIDE_EN_1</name>
                  <description>Use the override values for VBUS_VALID, AVALID, BVALID, and SESSEND</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SESSEND_OVERRIDE</name>
              <description>Override value for SESSEND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BVALID_OVERRIDE</name>
              <description>Override value for B-Device Session Valid</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVALID_OVERRIDE</name>
              <description>Override value for A-Device Session Valid</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSVALID_OVERRIDE</name>
              <description>Override value for VBUS_VALID signal sent to USB controller</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSVALID_SEL</name>
              <description>Selects the source of the VBUS_VALID signal reported to the USB controller</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUSVALID_SEL_0</name>
                  <description>Use the VBUS_VALID comparator results for signal reported to the USB controller (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_SEL_1</name>
                  <description>Use the VBUS_VALID_3V detector results for signal reported to the USB controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_SOURCE_SEL</name>
              <description>Selects the source of the VBUS_VALID signal reported to the USB controller</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_SOURCE_SEL_0</name>
                  <description>Use the VBUS_VALID comparator results for signal reported to the USB controller (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_SOURCE_SEL_1</name>
                  <description>Use the Session Valid comparator results for signal reported to the USB controller</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_SOURCE_SEL_2</name>
                  <description>Use the Session Valid comparator results for signal reported to the USB controller</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_TO_SESSVALID</name>
              <description>Selects the comparator used for VBUS_VALID</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUSVALID_TO_SESSVALID_0</name>
                  <description>Use the VBUS_VALID comparator for VBUS_VALID results</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_TO_SESSVALID_1</name>
                  <description>Use the Session End comparator for VBUS_VALID results. The Session End threshold is &gt;0.8V and &lt;4.0V.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRUP_CMPS</name>
              <description>Enables the VBUS_VALID comparator</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWRUP_CMPS_0</name>
                  <description>Powers down the VBUS_VALID comparator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRUP_CMPS_1</name>
                  <description>Enables the VBUS_VALID comparator (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>Controls VBUS discharge resistor</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISCHARGE_VBUS_0</name>
                  <description>VBUS discharge resistor is disabled (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCHARGE_VBUS_1</name>
                  <description>VBUS discharge resistor is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_CHARGER_RESISTOR</name>
              <description>Enables resistors used for an older method of resistive battery charger detection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_CHARGER_RESISTOR_0</name>
                  <description>Disable resistive charger detection resistors on USB_DP and USB_DP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_CHARGER_RESISTOR_1</name>
                  <description>Enable resistive charger detection resistors on USB_DP and USB_DP</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_VBUS_DETECT_SET</name>
          <description>USB PHY VBUS Detect Control Register</description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x700004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>Sets the threshold for the VBUSVALID comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_0</name>
                  <description>4.0 V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_1</name>
                  <description>4.1 V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_2</name>
                  <description>4.2 V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_3</name>
                  <description>4.3 V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_4</name>
                  <description>4.4 V (Default)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_5</name>
                  <description>4.5 V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_6</name>
                  <description>4.6 V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_THRESH_7</name>
                  <description>4.7 V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_OVERRIDE_EN</name>
              <description>VBUS detect signal override enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_OVERRIDE_EN_0</name>
                  <description>Use the results of the internal VBUS_VALID and Session Valid comparators for VBUS_VALID, AVALID, BVALID, and SESSEND (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_OVERRIDE_EN_1</name>
                  <description>Use the override values for VBUS_VALID, AVALID, BVALID, and SESSEND</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SESSEND_OVERRIDE</name>
              <description>Override value for SESSEND</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BVALID_OVERRIDE</name>
              <description>Override value for B-Device Session Valid</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVALID_OVERRIDE</name>
              <description>Override value for A-Device Session Valid</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSVALID_OVERRIDE</name>
              <description>Override value for VBUS_VALID signal sent to USB controller</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSVALID_SEL</name>
              <description>Selects the source of the VBUS_VALID signal reported to the USB controller</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUSVALID_SEL_0</name>
                  <description>Use the VBUS_VALID comparator results for signal reported to the USB controller (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_SEL_1</name>
                  <description>Use the VBUS_VALID_3V detector results for signal reported to the USB controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_SOURCE_SEL</name>
              <description>Selects the source of the VBUS_VALID signal reported to the USB controller</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_SOURCE_SEL_0</name>
                  <description>Use the VBUS_VALID comparator results for signal reported to the USB controller (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_SOURCE_SEL_1</name>
                  <description>Use the Session Valid comparator results for signal reported to the USB controller</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_SOURCE_SEL_2</name>
                  <description>Use the Session Valid comparator results for signal reported to the USB controller</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_TO_SESSVALID</name>
              <description>Selects the comparator used for VBUS_VALID</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUSVALID_TO_SESSVALID_0</name>
                  <description>Use the VBUS_VALID comparator for VBUS_VALID results</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUSVALID_TO_SESSVALID_1</name>
                  <description>Use the Session End comparator for VBUS_VALID results. The Session End threshold is &gt;0.8V and &lt;4.0V.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PWRUP_CMPS</name>
              <description>Enables the VBUS_VALID comparator</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PWRUP_CMPS_0</name>
                  <description>Powers down the VBUS_VALID comparator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWRUP_CMPS_1</name>
                  <description>Enables the VBUS_VALID comparator (default)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>Controls VBUS discharge resistor</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISCHARGE_VBUS_0</name>
                  <description>VBUS discharge resistor is disabled (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISCHARGE_VBUS_1</name>
                  <description>VBUS discharge resistor is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN_CHARGER_RESISTOR</name>
              <description>Enables resistors used for an older method of resistive battery charger detection</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_CHARGER_RESISTOR_0</name>
                  <description>Disable resistive charger detection resistors on USB_DP and USB_DP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_CHARGER_RESISTOR_1</name>
                  <description>Enable resistive charger detection resistors on USB_DP and USB_DP</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
