nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>USB1_VBUS_DET_STAT</name>
          <description>USB PHY VBUS Detector Status Register</description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SESSEND</name>
              <description>Session End indicator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SESSEND_0</name>
                  <description>The VBUS voltage is above the Session Valid threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SESSEND_1</name>
                  <description>The VBUS voltage is below the Session Valid threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BVALID</name>
              <description>B-Device Session Valid status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BVALID_0</name>
                  <description>The VBUS voltage is below the Session Valid threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BVALID_1</name>
                  <description>The VBUS voltage is above the Session Valid threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AVALID</name>
              <description>A-Device Session Valid status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVALID_0</name>
                  <description>The VBUS voltage is below the Session Valid threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVALID_1</name>
                  <description>The VBUS voltage is above the Session Valid threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_VALID</name>
              <description>VBUS voltage status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_VALID_0</name>
                  <description>VBUS is below the comparator threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_VALID_1</name>
                  <description>VBUS is above the comparator threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_VALID_3V</name>
              <description>VBUS_VALID_3V detector status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VBUS_VALID_3V_0</name>
                  <description>VBUS voltage is below VBUS_VALID_3V threshold</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VBUS_VALID_3V_1</name>
                  <description>VBUS voltage is above VBUS_VALID_3V threshold</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DETECT</name>
          <description>USB PHY Charger Detect Control Register</description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80180000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PULLUP_DP</name>
              <description>This bit is used to pull up DP, for digital charge detect.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGR_IBIAS</name>
              <description>USB charge detector bias current reference</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BGR_IBIAS_0</name>
                  <description>Bias current is derived from the USB PHY internal current generator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGR_IBIAS_1</name>
                  <description>Bias current is derived from the reference generator of the bandgap.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DETECT_SET</name>
          <description>USB PHY Charger Detect Control Register</description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80180000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PULLUP_DP</name>
              <description>This bit is used to pull up DP, for digital charge detect.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGR_IBIAS</name>
              <description>USB charge detector bias current reference</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BGR_IBIAS_0</name>
                  <description>Bias current is derived from the USB PHY internal current generator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGR_IBIAS_1</name>
                  <description>Bias current is derived from the reference generator of the bandgap.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DETECT_CLR</name>
          <description>USB PHY Charger Detect Control Register</description>
          <addressOffset>0xE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80180000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PULLUP_DP</name>
              <description>This bit is used to pull up DP, for digital charge detect.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGR_IBIAS</name>
              <description>USB charge detector bias current reference</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BGR_IBIAS_0</name>
                  <description>Bias current is derived from the USB PHY internal current generator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGR_IBIAS_1</name>
                  <description>Bias current is derived from the reference generator of the bandgap.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DETECT_TOG</name>
          <description>USB PHY Charger Detect Control Register</description>
          <addressOffset>0xEC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x80180000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PULLUP_DP</name>
              <description>This bit is used to pull up DP, for digital charge detect.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGR_IBIAS</name>
              <description>USB charge detector bias current reference</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BGR_IBIAS_0</name>
                  <description>Bias current is derived from the USB PHY internal current generator.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BGR_IBIAS_1</name>
                  <description>Bias current is derived from the reference generator of the bandgap.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_CHRG_DET_STAT</name>
          <description>USB PHY Charger Detect Status Register</description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLUG_CONTACT</name>
              <description>Battery Charging Data Contact Detection phase output</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PLUG_CONTACT_0</name>
                  <description>No USB cable attachment has been detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLUG_CONTACT_1</name>
                  <description>A USB cable attachment between the device and host has been detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHRG_DETECTED</name>
              <description>Battery Charging Primary Detection phase output</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CHRG_DETECTED_0</name>
                  <description>Standard Downstream Port (SDP) has been detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHRG_DETECTED_1</name>
                  <description>Charging Port has been detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DM_STATE</name>
              <description>Single ended receiver output for the USB_DM pin, from charger detection circuits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DM_STATE_0</name>
                  <description>USB_DM pin voltage is &lt; 0.8V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DM_STATE_1</name>
                  <description>USB_DM pin voltage is &gt; 2.0V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DP_STATE</name>
              <description>Single ended receiver output for the USB_DP pin, from charger detection circuits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DP_STATE_0</name>
                  <description>USB_DP pin voltage is &lt; 0.8V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DP_STATE_1</name>
                  <description>USB_DP pin voltage is &gt; 2.0V</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SECDET_DCP</name>
              <description>Battery Charging Secondary Detection phase output</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SECDET_DCP_0</name>
                  <description>Charging Downstream Port (CDP) has been detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECDET_DCP_1</name>
                  <description>Downstream Charging Port (DCP) has been detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANACTRL</name>
          <description>USB PHY Analog Control Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA000402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEV_PULLDOWN</name>
              <description>Setting this field to 1'b1 will enable the 15kohm pulldown resistors on both USB_DP and USB_DM pins</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEV_PULLDOWN_0</name>
                  <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare disabled in device mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEV_PULLDOWN_1</name>
                  <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare enabled in device mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANACTRL_SET</name>
          <description>USB PHY Analog Control Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA000402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEV_PULLDOWN</name>
              <description>Setting this field to 1'b1 will enable the 15kohm pulldown resistors on both USB_DP and USB_DM pins</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEV_PULLDOWN_0</name>
                  <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare disabled in device mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEV_PULLDOWN_1</name>
                  <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare enabled in device mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANACTRL_CLR</name>
          <description>USB PHY Analog Control Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA000402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEV_PULLDOWN</name>
              <description>Setting this field to 1'b1 will enable the 15kohm pulldown resistors on both USB_DP and USB_DM pins</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEV_PULLDOWN_0</name>
                  <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare disabled in device mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEV_PULLDOWN_1</name>
                  <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare enabled in device mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ANACTRL_TOG</name>
          <description>USB PHY Analog Control Register</description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA000402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEV_PULLDOWN</name>
              <description>Setting this field to 1'b1 will enable the 15kohm pulldown resistors on both USB_DP and USB_DM pins</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEV_PULLDOWN_0</name>
                  <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare disabled in device mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEV_PULLDOWN_1</name>
                  <description>The 15kohm nominal pulldowns on the USB_DP and USB_DM pinsare enabled in device mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
