nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>MAC_Q2_TX_FLOW_CTRL</name>
          <description>MAC Q2 Tx Flow Control</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCB_BPA</name>
              <description>Flow Control Busy This bit initiates a PFC packet if the TFE bit is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Flow Control Busy or Backpressure Activate is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Flow Control Busy or Backpressure Activate is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFE</name>
              <description>Transmit Flow Control Enable When this bit is set in full-duplex mode, the MAC enables the flow control operation to Tx Pause packets.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Transmit Flow Control is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Transmit Flow Control is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLT</name>
              <description>Pause Low Threshold This field configures the threshold of the Pause timer at which the input flow control signal mti_flowctrl_i (or sbd_flowctrl_i) is checked for automatic retransmission of the Pause packet.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT4</name>
                  <description>Pause Time minus 4 Slot Times (PT -4 slot times)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT28</name>
                  <description>Pause Time minus 28 Slot Times (PT -28 slot times)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT36</name>
                  <description>Pause Time minus 36 Slot Times (PT -36 slot times)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT144</name>
                  <description>Pause Time minus 144 Slot Times (PT -144 slot times)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT256</name>
                  <description>Pause Time minus 256 Slot Times (PT -256 slot times)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT512</name>
                  <description>Pause Time minus 512 Slot Times (PT -512 slot times)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DZPQ</name>
              <description>Disable Zero-Quanta Pause When this bit is set, it disables the automatic generation of the zero-quanta Pause packets on de-assertion of the flow-control signal from the FIFO layer (MTL or external sideband flow control signal sbd_flowctrl_i or mti_flowctrl_i).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Zero-Quanta Pause packet generation is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Zero-Quanta Pause packet generation is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT</name>
              <description>Pause Time This field holds the value to be used in the Pause Time field in the Tx control packet.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_Q3_TX_FLOW_CTRL</name>
          <description>MAC Q3 Tx Flow Control</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCB_BPA</name>
              <description>Flow Control Busy This bit initiates a PFC packet if the TFE bit is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Flow Control Busy or Backpressure Activate is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Flow Control Busy or Backpressure Activate is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFE</name>
              <description>Transmit Flow Control Enable When this bit is set in full-duplex mode, the MAC enables the flow control operation to Tx Pause packets.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Transmit Flow Control is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Transmit Flow Control is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLT</name>
              <description>Pause Low Threshold This field configures the threshold of the Pause timer at which the input flow control signal mti_flowctrl_i (or sbd_flowctrl_i) is checked for automatic retransmission of the Pause packet.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT4</name>
                  <description>Pause Time minus 4 Slot Times (PT -4 slot times)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT28</name>
                  <description>Pause Time minus 28 Slot Times (PT -28 slot times)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT36</name>
                  <description>Pause Time minus 36 Slot Times (PT -36 slot times)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT144</name>
                  <description>Pause Time minus 144 Slot Times (PT -144 slot times)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT256</name>
                  <description>Pause Time minus 256 Slot Times (PT -256 slot times)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT512</name>
                  <description>Pause Time minus 512 Slot Times (PT -512 slot times)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DZPQ</name>
              <description>Disable Zero-Quanta Pause When this bit is set, it disables the automatic generation of the zero-quanta Pause packets on de-assertion of the flow-control signal from the FIFO layer (MTL or external sideband flow control signal sbd_flowctrl_i or mti_flowctrl_i).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Zero-Quanta Pause packet generation is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Zero-Quanta Pause packet generation is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT</name>
              <description>Pause Time This field holds the value to be used in the Pause Time field in the Tx control packet.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_Q4_TX_FLOW_CTRL</name>
          <description>MAC Q0 Tx Flow Control</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FCB_BPA</name>
              <description>Flow Control Busy This bit initiates a PFC packet if the TFE bit is set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Flow Control Busy or Backpressure Activate is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Flow Control Busy or Backpressure Activate is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TFE</name>
              <description>Transmit Flow Control Enable When this bit is set in full-duplex mode, the MAC enables the flow control operation to Tx Pause packets.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Transmit Flow Control is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Transmit Flow Control is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLT</name>
              <description>Pause Low Threshold This field configures the threshold of the Pause timer at which the input flow control signal mti_flowctrl_i (or sbd_flowctrl_i) is checked for automatic retransmission of the Pause packet.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PT4</name>
                  <description>Pause Time minus 4 Slot Times (PT -4 slot times)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT28</name>
                  <description>Pause Time minus 28 Slot Times (PT -28 slot times)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT36</name>
                  <description>Pause Time minus 36 Slot Times (PT -36 slot times)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT144</name>
                  <description>Pause Time minus 144 Slot Times (PT -144 slot times)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT256</name>
                  <description>Pause Time minus 256 Slot Times (PT -256 slot times)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PT512</name>
                  <description>Pause Time minus 512 Slot Times (PT -512 slot times)</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DZPQ</name>
              <description>Disable Zero-Quanta Pause When this bit is set, it disables the automatic generation of the zero-quanta Pause packets on de-assertion of the flow-control signal from the FIFO layer (MTL or external sideband flow control signal sbd_flowctrl_i or mti_flowctrl_i).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Zero-Quanta Pause packet generation is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Zero-Quanta Pause packet generation is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PT</name>
              <description>Pause Time This field holds the value to be used in the Pause Time field in the Tx control packet.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_RX_FLOW_CTRL</name>
          <description>MAC Rx Flow Control</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RFE</name>
              <description>Receive Flow Control Enable When this bit is set and the MAC is operating in full-duplex mode, the MAC decodes the received Pause packet and disables its transmitter for a specified (Pause) time.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Receive Flow Control is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Receive Flow Control is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UP</name>
              <description>Unicast Pause Packet Detect A pause packet is processed when it has the unique multicast address specified in the IEEE 802.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Unicast Pause Packet Detect disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Unicast Pause Packet Detect enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PFCE</name>
              <description>Priority Based Flow Control Enable When this bit is set, it enables generation and reception of priority-based flow control (PFC) packets.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Priority Based Flow Control is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Priority Based Flow Control is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_RXQ_CTRL4</name>
          <description>Receive Queue Control 4</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UFFQE</name>
              <description>Unicast Address Filter Fail Packets Queuing Enable.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Unicast Address Filter Fail Packets Queuing is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Unicast Address Filter Fail Packets Queuing is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UFFQ</name>
              <description>Unicast Address Filter Fail Packets Queue.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MFFQE</name>
              <description>Multicast Address Filter Fail Packets Queuing Enable.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Multicast Address Filter Fail Packets Queuing is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Multicast Address Filter Fail Packets Queuing is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MFFQ</name>
              <description>Multicast Address Filter Fail Packets Queue.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VFFQE</name>
              <description>VLAN Tag Filter Fail Packets Queuing Enable When this bit is set, the tagged packets which fail the Destination or Source address filter or fail the VLAN tag filter, are routed to the Rx Queue Number programmed in the VFFQ.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>VLAN tag Filter Fail Packets Queuing is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>VLAN tag Filter Fail Packets Queuing is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VFFQ</name>
              <description>VLAN Tag Filter Fail Packets Queue This field holds the Rx queue number to which the tagged packets failing the Destination or Source Address filter (and UFFQE/MFFQE not enabled) or failing the VLAN tag filter must be routed to.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
