nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>MAC_TXQ_PRTY_MAP0</name>
          <description>Transmit Queue Priority Mapping 0</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSTQ0</name>
              <description>Priorities Selected in Transmit Queue 0 This field holds the priorities assigned to Tx Queue 0 by the software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSTQ1</name>
              <description>Priorities Selected in Transmit Queue 1 This bit is similar to the PSTQ0 bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSTQ2</name>
              <description>Priorities Selected in Transmit Queue 2 This bit is similar to the PSTQ0 bit.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSTQ3</name>
              <description>Priorities Selected in Transmit Queue 3 This bit is similar to the PSTQ0 bit.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_TXQ_PRTY_MAP1</name>
          <description>Transmit Queue Priority Mapping 1</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSTQ4</name>
              <description>Priorities Selected in Transmit Queue 4 This field holds the priorities assigned to Tx Queue 4 by the software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_RXQ_CTRL0</name>
          <description>Receive Queue Control 0</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXQ0EN</name>
              <description>Receive Queue 0 Enable This field indicates whether Rx Queue 0 is enabled for AV or DCB.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Queue not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_AV</name>
                  <description>Queue enabled for AV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_DCB_GEN</name>
                  <description>Queue enabled for DCB/Generic</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXQ1EN</name>
              <description>Receive Queue 1 Enable This field is similar to the RXQ0EN field.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Queue not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_AV</name>
                  <description>Queue enabled for AV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_DCB_GEN</name>
                  <description>Queue enabled for DCB/Generic</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXQ2EN</name>
              <description>Receive Queue 2 Enable This field is similar to the RXQ0EN field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Queue not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_AV</name>
                  <description>Queue enabled for AV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_DCB_GEN</name>
                  <description>Queue enabled for DCB/Generic</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXQ3EN</name>
              <description>Receive Queue 3 Enable This field is similar to the RXQ0EN field.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Queue not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_AV</name>
                  <description>Queue enabled for AV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_DCB_GEN</name>
                  <description>Queue enabled for DCB/Generic</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RXQ4EN</name>
              <description>Receive Queue 4 Enable This field is similar to the RXQ0EN field.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Queue not enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_AV</name>
                  <description>Queue enabled for AV</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_DCB_GEN</name>
                  <description>Queue enabled for DCB/Generic</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_RXQ_CTRL1</name>
          <description>Receive Queue Control 1</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AVCPQ</name>
              <description>AV Untagged Control Packets Queue This field specifies the Receive queue on which the received AV tagged and untagged control packets are routed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUEUE0</name>
                  <description>Receive Queue 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE1</name>
                  <description>Receive Queue 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE2</name>
                  <description>Receive Queue 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE3</name>
                  <description>Receive Queue 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE4</name>
                  <description>Receive Queue 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE5</name>
                  <description>Receive Queue 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE6</name>
                  <description>Receive Queue 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE7</name>
                  <description>Receive Queue 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTPQ</name>
              <description>PTP Packets Queue This field specifies the Rx queue on which the PTP packets sent over the Ethernet payload (not over IPv4 or IPv6) are routed.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUEUE0</name>
                  <description>Receive Queue 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE1</name>
                  <description>Receive Queue 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE2</name>
                  <description>Receive Queue 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE3</name>
                  <description>Receive Queue 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE4</name>
                  <description>Receive Queue 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE5</name>
                  <description>Receive Queue 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE6</name>
                  <description>Receive Queue 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE7</name>
                  <description>Receive Queue 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCBCPQ</name>
              <description>DCB Control Packets Queue This field specifies the Rx queue on which the received DCB control packets are routed.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUEUE0</name>
                  <description>Receive Queue 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE1</name>
                  <description>Receive Queue 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE2</name>
                  <description>Receive Queue 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE3</name>
                  <description>Receive Queue 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE4</name>
                  <description>Receive Queue 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE5</name>
                  <description>Receive Queue 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE6</name>
                  <description>Receive Queue 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE7</name>
                  <description>Receive Queue 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UPQ</name>
              <description>Untagged Packet Queue This field indicates the Rx Queue to which Untagged Packets are to be routed.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUEUE0</name>
                  <description>Receive Queue 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE1</name>
                  <description>Receive Queue 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE2</name>
                  <description>Receive Queue 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE3</name>
                  <description>Receive Queue 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE4</name>
                  <description>Receive Queue 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE5</name>
                  <description>Receive Queue 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE6</name>
                  <description>Receive Queue 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE7</name>
                  <description>Receive Queue 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCBCQ</name>
              <description>Multicast and Broadcast Queue This field specifies the Rx Queue onto which Multicast or Broadcast Packets are routed.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QUEUE0</name>
                  <description>Receive Queue 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE1</name>
                  <description>Receive Queue 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE2</name>
                  <description>Receive Queue 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE3</name>
                  <description>Receive Queue 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE4</name>
                  <description>Receive Queue 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE5</name>
                  <description>Receive Queue 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE6</name>
                  <description>Receive Queue 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QUEUE7</name>
                  <description>Receive Queue 7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCBCQEN</name>
              <description>Multicast and Broadcast Queue Enable This bit specifies that Multicast or Broadcast packets routing to the Rx Queue is enabled and the Multicast or Broadcast packets must be routed to Rx Queue specified in MCBCQ field.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Multicast and Broadcast Queue is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Multicast and Broadcast Queue is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TACPQE</name>
              <description>Tagged AV Control Packets Queuing Enable.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Tagged AV Control Packets Queuing is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Tagged AV Control Packets Queuing is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPQC</name>
              <description>Tagged PTP over Ethernet Packets Queuing Control.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FPRQ</name>
              <description>Frame Preemption Residue Queue This field holds the Rx queue number to which the residual preemption frames must be forwarded.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_RXQ_CTRL2</name>
          <description>Receive Queue Control 2</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSRQ0</name>
              <description>Priorities Selected in the Receive Queue 0 This field decides the priorities assigned to Rx Queue 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRQ1</name>
              <description>Priorities Selected in the Receive Queue 1 This field decides the priorities assigned to Rx Queue 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRQ2</name>
              <description>Priorities Selected in the Receive Queue 2 This field decides the priorities assigned to Rx Queue 2.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PSRQ3</name>
              <description>Priorities Selected in the Receive Queue 3 This field decides the priorities assigned to Rx Queue 3.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MAC_RXQ_CTRL3</name>
          <description>Receive Queue Control 3</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSRQ4</name>
              <description>Priorities Selected in the Receive Queue 4 This field decides the priorities assigned to Rx Queue 4.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
