nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>DMA_DEBUG_STATUS0</name>
          <description>DMA Debug Status 0</description>
          <addressOffset>0x100C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AXWHSTS</name>
              <description>AXI Master Write Channel When high, this bit indicates that the write channel of the AXI master is active, and it is transferring data.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>AXI Master Write Channel or AHB Master Status not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>AXI Master Write Channel or AHB Master Status detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXRHSTS</name>
              <description>AXI Master Read Channel Status When high, this bit indicates that the read channel of the AXI master is active, and it is transferring the data.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>AXI Master Read Channel Status not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>AXI Master Read Channel Status detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPS0</name>
              <description>DMA Channel 0 Receive Process State This field indicates the Rx DMA FSM state for Channel 0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Receive Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FRTD</name>
                  <description>Running (Fetching Rx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WRP</name>
                  <description>Running (Waiting for Rx packet)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Rx Descriptor Unavailable)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CRD</name>
                  <description>Running (Closing the Rx Descriptor)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP</name>
                  <description>Timestamp write state</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_TRP</name>
                  <description>Running (Transferring the received packet data from the Rx buffer to the system memory)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPS0</name>
              <description>DMA Channel 0 Transmit Process State This field indicates the Tx DMA FSM state for Channel 0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Transmit Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FTTD</name>
                  <description>Running (Fetching Tx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WS</name>
                  <description>Running (Waiting for status)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_RDS</name>
                  <description>Running (Reading Data from system memory buffer and queuing it to the Tx buffer (Tx FIFO))</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP_WS</name>
                  <description>Timestamp write state</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Tx Descriptor Unavailable or Tx Buffer Underflow)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CTD</name>
                  <description>Running (Closing Tx Descriptor)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPS1</name>
              <description>DMA Channel 1 Receive Process State This field indicates the Rx DMA FSM state for Channel 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Receive Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FRTD</name>
                  <description>Running (Fetching Rx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WRP</name>
                  <description>Running (Waiting for Rx packet)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Rx Descriptor Unavailable)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CRD</name>
                  <description>Running (Closing the Rx Descriptor)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP</name>
                  <description>Timestamp write state</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_TRP</name>
                  <description>Running (Transferring the received packet data from the Rx buffer to the system memory)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPS1</name>
              <description>DMA Channel 1 Transmit Process State This field indicates the Tx DMA FSM state for Channel 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Transmit Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FTTD</name>
                  <description>Running (Fetching Tx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WS</name>
                  <description>Running (Waiting for status)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_RDS</name>
                  <description>Running (Reading Data from system memory buffer and queuing it to the Tx buffer (Tx FIFO))</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP_WS</name>
                  <description>Timestamp write state</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Tx Descriptor Unavailable or Tx Buffer Underflow)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CTD</name>
                  <description>Running (Closing Tx Descriptor)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPS2</name>
              <description>DMA Channel 2 Receive Process State This field indicates the Rx DMA FSM state for Channel 2.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Receive Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FRTD</name>
                  <description>Running (Fetching Rx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WRP</name>
                  <description>Running (Waiting for Rx packet)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Rx Descriptor Unavailable)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CRD</name>
                  <description>Running (Closing the Rx Descriptor)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP</name>
                  <description>Timestamp write state</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_TRP</name>
                  <description>Running (Transferring the received packet data from the Rx buffer to the system memory)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPS2</name>
              <description>DMA Channel 2 Transmit Process State This field indicates the Tx DMA FSM state for Channel 2.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Transmit Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FTTD</name>
                  <description>Running (Fetching Tx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WS</name>
                  <description>Running (Waiting for status)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_RDS</name>
                  <description>Running (Reading Data from system memory buffer and queuing it to the Tx buffer (Tx FIFO))</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP_WS</name>
                  <description>Timestamp write state</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Tx Descriptor Unavailable or Tx Buffer Underflow)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CTD</name>
                  <description>Running (Closing Tx Descriptor)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_DEBUG_STATUS1</name>
          <description>DMA Debug Status 1</description>
          <addressOffset>0x1010</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RPS3</name>
              <description>DMA Channel 3 Receive Process State This field indicates the Rx DMA FSM state for Channel 3.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Receive Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FRTD</name>
                  <description>Running (Fetching Rx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WRP</name>
                  <description>Running (Waiting for Rx packet)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Rx Descriptor Unavailable)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CRD</name>
                  <description>Running (Closing the Rx Descriptor)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP</name>
                  <description>Timestamp write state</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_TRP</name>
                  <description>Running (Transferring the received packet data from the Rx buffer to the system memory)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPS3</name>
              <description>DMA Channel 3 Transmit Process State This field indicates the Tx DMA FSM state for Channel 3.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Transmit Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FTTD</name>
                  <description>Running (Fetching Tx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WS</name>
                  <description>Running (Waiting for status)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_RDS</name>
                  <description>Running (Reading Data from system memory buffer and queuing it to the Tx buffer (Tx FIFO))</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP_WS</name>
                  <description>Timestamp write state</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Tx Descriptor Unavailable or Tx Buffer Underflow)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CTD</name>
                  <description>Running (Closing Tx Descriptor)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RPS4</name>
              <description>DMA Channel 4 Receive Process State This field indicates the Rx DMA FSM state for Channel 4.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Receive Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FRTD</name>
                  <description>Running (Fetching Rx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WRP</name>
                  <description>Running (Waiting for Rx packet)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Rx Descriptor Unavailable)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CRD</name>
                  <description>Running (Closing the Rx Descriptor)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP</name>
                  <description>Timestamp write state</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_TRP</name>
                  <description>Running (Transferring the received packet data from the Rx buffer to the system memory)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TPS4</name>
              <description>DMA Channel 4 Transmit Process State This field indicates the Tx DMA FSM state for Channel 4.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stopped (Reset or Stop Transmit Command issued)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_FTTD</name>
                  <description>Running (Fetching Tx Transfer Descriptor)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_WS</name>
                  <description>Running (Waiting for status)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_RDS</name>
                  <description>Running (Reading Data from system memory buffer and queuing it to the Tx buffer (Tx FIFO))</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TSTMP_WS</name>
                  <description>Timestamp write state</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPND</name>
                  <description>Suspended (Tx Descriptor Unavailable or Tx Buffer Underflow)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN_CTD</name>
                  <description>Running (Closing Tx Descriptor)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA_AXI_LPI_ENTRY_INTERVAL</name>
          <description>AXI LPI Entry Interval Control</description>
          <addressOffset>0x1040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPIEI</name>
              <description>LPI Entry Interval Contains the number of system clock cycles, multiplied by 64, to wait for an activity in the DWC_ether_qos to enter into the AXI low power state 0 indicates 64 clock cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
