nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>CRNR_MS</name>
          <description>CHA Revision Number Register, most-significant half</description>
          <addressOffset>0xFA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1000006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRCRN</name>
              <description>CRC Hardware Accelerator Revision Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SNW9RN</name>
              <description>SNOW-f9 Hardware Accelerator Revision Number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZERN</name>
              <description>ZUC Encryption Hardware Accelerator Revision Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZARN</name>
              <description>ZUC Authentication Hardware Accelerator Revision Number</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECORN</name>
              <description>DECO Revision Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JRRN</name>
              <description>Job Ring Revision Number</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CRNR_LS</name>
          <description>CHA Revision Number Register, least-significant half</description>
          <addressOffset>0xFA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x7003401A</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AESRN</name>
              <description>AES Accelerator Revision Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DESRN</name>
              <description>DES Accelerator Revision Number.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDRN</name>
              <description>Message Digest Hardware Accelerator module Revision Number.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RNGRN</name>
              <description>Random Number Generator Revision Number.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SNW8RN</name>
              <description>SNOW-f8 Hardware Accelerator Revision Number</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KASRN</name>
              <description>Kasumi f8/f9 Hardware Accelerator Revision Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKRN</name>
              <description>Public Key Hardware Accelerator Revision Number For PKHA-XT, PKRN=1. For PKHA-SD, see below.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKHA_SDV0</name>
                  <description>PKHA-SDv1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKHA_SDV1</name>
                  <description>PKHA-SDv2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKHA_SDV2</name>
                  <description>PKHA-SDv3</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKHA_SDV3</name>
                  <description>PKHA-SDv4</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTPR_MS</name>
          <description>Compile Time Parameters Register, most-significant half</description>
          <addressOffset>0xFA8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1934211</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VIRT_EN_INCL</name>
              <description>Job Ring Virtualization programmable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VIRT_EN_POR_VALUE</name>
              <description>Job Ring Virtualization POR state</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REG_PG_SIZE</name>
              <description>CAAM register page size. 0: CAAM uses 4Kbyte register pages. 1: CAAM uses 64Kbyte register pages.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RNG_I</name>
              <description>RNG Instantiations</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AI_INCL</name>
              <description>AIOP interface implemented</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DPAA2</name>
              <description>ICIDs with AMQs supported</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IP_CLK</name>
              <description>IP Bus Slave Clock</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MCFG_BURST</name>
              <description>Burst Configurability If MCFG_BURST is 0, the normal burst size is limited to 32 bytes and large bursts cannot be enabled</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MCFG_PS</name>
              <description>Pointer Size field implemented 0: The Master Configuration Register does not contain a Pointer Size field</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SG8</name>
              <description>Eight Scatter-Gather Tables implemented 0: CAAM implements one Scatter-Gather Table register</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PM_EVT_BUS</name>
              <description>Performance Monitor Event Bus implemented 0: CAAM does not implement a Performance Monitor Event Bus</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECO_WD</name>
              <description>DECO Watchdog Counter implemented 0: CAAM does not implement a DECO Watchdog Counter</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PC</name>
              <description>Performance Counter registers implemented 0: CAAM does not implement Performance Counter registers</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>C1C2</name>
              <description>Separate C1 and C2 registers 0: In this implementation of CAAM the Class 2 Key and Context registers are shared with the Class 1 Key and Context registers</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACC_CTL</name>
              <description>System/user partition-based CAAM IP Bus register access control 0: CAAM does not implement partition-based access control for its IP Bus registers, i</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>QI</name>
              <description>Queue Manager interface (QI) implemented</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AXI_PRI</name>
              <description>AXI Master Priority implemented</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AXI_LIODN</name>
              <description>LIODN logic included</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AXI_PIPE_DEPTH</name>
              <description>AXI Pipeline Depth</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
