nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SMPO</name>
          <description>Secure Memory Partition Owners Register</description>
          <addressOffset>0xFBC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PO0</name>
              <description>Partition Owner for partition 0: When read by a Job Ring owner, this field indicates if partition 0 is owned by that Job Ring, another Job Ring, Unowned, or Unimplemented</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVAILABLE</name>
                  <description>Available; Unowned. A Job Ring owner may claim partition 0 by writing to the appropriate SMAPJR register address alias. Note that the entire register will return all 0s if read by a entity that does not own the Job Ring associated with the SMPO address alias that was read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_PRESENT</name>
                  <description>Partition 0 does not exist in this version</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNAVAILABLE</name>
                  <description>Another entity owns partition 0. Partition 0 is unavailable to the reader. If the reader attempts to de-allocate partition 0 or write to the SMAPJR register or SMAGJR register for partition 0 or allocate a page to or de-allocate a page from partition 0 the command will be ignored. (Note that if a CSP partition is de-allocated, all entities (including the owner that de-allocated the partition) will see a 0b10 value for that partition until all its pages have been zeroized.)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OWNED</name>
                  <description>The entity that read the SMPO register owns partition 0. Ownership is claimed when the access permissions register (SMAPJR) of an available partition is first written.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PO1</name>
              <description>Partition Owner for partition 1. See PO0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO2</name>
              <description>Partition Owner for partition 2. See PO0.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO3</name>
              <description>Partition Owner for partition 3. See PO0.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO4</name>
              <description>Partition Owner for partition 4. See PO0.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO5</name>
              <description>Partition Owner for partition 5. See PO0.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO6</name>
              <description>Partition Owner for partition 6. See PO0.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO7</name>
              <description>Partition Owner for partition 7. See PO0.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO8</name>
              <description>Partition Owner for partition 8. See PO0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO9</name>
              <description>Partition Owner for partition 9. See PO0.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO10</name>
              <description>Partition Owner for partition 10. See PO0.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO11</name>
              <description>Partition Owner for partition 11. See PO0.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO12</name>
              <description>Partition Owner for partition 12. See PO0.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO13</name>
              <description>Partition Owner for partition 13. See PO0.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO14</name>
              <description>Partition Owner for partition 14. See PO0.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO15</name>
              <description>Partition Owner for partition 15. See PO0.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FAR</name>
          <description>Fault Address Register</description>
          <addressOffset>0xFC0</addressOffset>
          <size>64</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FAR</name>
              <description>Fault Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>36</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FADID</name>
          <description>Fault Address DID Register</description>
          <addressOffset>0xFC8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FDID</name>
              <description>DMA transaction DID. This was the DID associated with the DMA transaction that failed.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FNS</name>
              <description>DMA transaction ns</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FICID</name>
              <description>DMA transaction ICID. This was the ICID value associated with the DMA transaction that failed.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FADR</name>
          <description>Fault Address Detail Register</description>
          <addressOffset>0xFCC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FSZ</name>
              <description>AXI Transaction Transfer Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TYP</name>
              <description>AXI Transaction Type</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>READ</name>
                  <description>Read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WRITE</name>
                  <description>Write.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BLKID</name>
              <description>Block ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JQ</name>
                  <description>job queue controller Burst Buffer</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JRN</name>
                  <description>One of the Job Rings (see JSRC field)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECO0</name>
                  <description>DECO0</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JSRC</name>
              <description>Job Source. The source of the job whose AXI transfer ended with an error:</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JR0</name>
                  <description>Job Ring 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR1</name>
                  <description>Job Ring 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR2</name>
                  <description>Job Ring 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR3</name>
                  <description>Job Ring 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTIC</name>
                  <description>RTIC</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DTYP</name>
              <description>Data Type. The type of data being processed when the AXI transfer error occurred.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MSG_DATA</name>
                  <description>message data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTL_DATA</name>
                  <description>control data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSZ_EXT</name>
              <description>AXI Transaction Transfer Size - extended</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FKMOD</name>
              <description>Key Modifier Read</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT</name>
                  <description>CAAM DMA was not attempting to read the key modifier from Secure Memory at the time that the DMA error occurred.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>CAAM DMA was attempting to read the key modifier from Secure Memory at the time that the DMA error occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FKEY</name>
              <description>Key Access Read</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT</name>
                  <description>CAAM DMA was not attempting to perform a key read from Secure Memory at the time of the DMA error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>CAAM DMA was attempting to perform a key read from Secure Memory at the time of the DMA error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FTDSC</name>
              <description>Trusted Descriptor access to Secure Memory</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT</name>
                  <description>CAAM DMA was not executing a Trusted Descriptor at the time of the DMA error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>CAAM DMA was executing a Trusted Descriptor at the time of the DMA error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FBNDG</name>
              <description>Access permission binding access to Secure Memory.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT</name>
                  <description>CAAM DMA was not reading access permissions from a Secure Memory partition at the time of the DMA error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>CAAM DMA was reading access permissions from a Secure Memory partition at the time of the DMA error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FNS</name>
              <description>Non-secure (AXI bus ns bit) access to Secure Memory.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>YES</name>
                  <description>CAAM DMA was asserting ns=0 at the time of the DMA error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT</name>
                  <description>CAAM DMA was asserting ns=1 at the time of the DMA error.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FERR</name>
              <description>Fault Error Code. This is the AXI Error Response Code.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OKAY</name>
                  <description>OKAY - Normal Access</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLVERR</name>
                  <description>SLVERR - Slave Error</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECERR</name>
                  <description>DECERR - Decode Error</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSTA</name>
          <description>CAAM Status Register</description>
          <addressOffset>0xFD4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BSY</name>
              <description>CAAM Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDLE</name>
              <description>CAAM Idle</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRNG_IDLE</name>
              <description>TRNG Idle</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MOO</name>
              <description>Mode of Operation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NON_SECURE</name>
                  <description>Non-Secure</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURE</name>
                  <description>Secure</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUSTED</name>
                  <description>Trusted</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FAIL</name>
                  <description>Fail</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLEND</name>
              <description>Platform Endianness</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LITTLE</name>
                  <description>Platform default is Little Endian</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIG</name>
                  <description>Platform default is Big Endian</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SMVID_MS</name>
          <description>Secure Memory Version ID Register, most-significant half</description>
          <addressOffset>0xFD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFF00F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NPAG</name>
              <description>This is the highest numbered page of Secure Memory</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NPRT</name>
              <description>This is the highest numbered Secure Memory partition, so there can be 1 to 16 partitions.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAX_NPAG</name>
              <description>Maximum allowable value for NPAG</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
