nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SMVID_LS</name>
          <description>Secure Memory Version ID Register, least-significant half</description>
          <addressOffset>0xFDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x20301</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SMNV</name>
              <description>Secure Memory Minor Version ID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMJV</name>
              <description>Secure Memory Major Version ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSIZ</name>
              <description>Page Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RVID</name>
          <description>RTIC Version ID Register</description>
          <addressOffset>0xFE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xF0A0004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RMNV</name>
              <description>RTIC Minor Version</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RMJV</name>
              <description>RTIC Major Version</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHA_256</name>
              <description>SHA-256.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHA256_ABSENT</name>
                  <description>RTIC cannot use the SHA-256 hashing algorithm.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA256_EXISTS</name>
                  <description>RTIC can use the SHA-256 hashing algorithm.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHA_512</name>
              <description>SHA-512.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHA512_ABSENT</name>
                  <description>RTIC cannot use the SHA-512 hashing algorithm.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA512_EXISTS</name>
                  <description>RTIC can use the SHA-512 hashing algorithm.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MA</name>
              <description>Memory Block A Available</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MB</name>
              <description>Memory Block B Available</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MC</name>
              <description>Memory Block C Available</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MD</name>
              <description>Memory Block D Available</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCBVID</name>
          <description>CHA Cluster Block Version ID Register</description>
          <addressOffset>0xFE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x9000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AMNV</name>
              <description>Accelerator Minor Revision Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AMJV</name>
              <description>Accelerator Major Revision Number</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAAM_ERA</name>
              <description>CAAM Era. This version of CAAM is based on Era 9 RTL. A value of 0 implies CAAM Era 5 or earlier.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHAVID_MS</name>
          <description>CHA Version ID Register, most-significant half</description>
          <addressOffset>0xFE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x45000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRCVID</name>
              <description>CRC Hardware Accelerator Version ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SNW9VID</name>
              <description>SNOW-f9 Hardware Accelerator Version ID</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZEVID</name>
              <description>ZUC Encryption Hardware Accelerator Version ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZAVID</name>
              <description>ZUC Authentication Hardware Accelerator Version ID</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECOVID</name>
              <description>DECO Version ID</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JRVID</name>
              <description>Job Ring Version ID</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHAVID_LS</name>
          <description>CHA Version ID Register, least-significant half</description>
          <addressOffset>0xFEC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x20041033</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AESVID</name>
              <description>AES Accelerator Version ID.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESA_LP</name>
                  <description>Low-power AESA, implementing ECB, CBC, CBC-CS2, CFB128, OFB, CTR, CCM, CMAC, XCBC-MAC, and GCM modes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESA_HP</name>
                  <description>High-performance AESA, implementing ECB, CBC, CBC-CS2, CFB128, OFB, CTR, CCM, CMAC, XCBC-MAC, CBCXCBC, CTRXCBC, XTS, and GCM modes</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DESVID</name>
              <description>DES Accelerator Version ID.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDVID</name>
              <description>Message Digest Hardware Accelerator Version ID.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MDHA_LP0</name>
                  <description>Low-power MDHA, with SHA-1, SHA-256, SHA 224, MD5 and HMAC</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDHA_LP1</name>
                  <description>Low-power MDHA, with SHA-1, SHA-256, SHA 224, SHA-512, SHA-512/224, SHA-512/256, SHA-384, MD5 and HMAC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDHA_MP</name>
                  <description>Medium-performance MDHA, with SHA-1, SHA-256, SHA 224, SHA-512, SHA-512/224, SHA-512/256, SHA-384, MD5, HMAC &amp; SMAC</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDHA_HP</name>
                  <description>High-performance MDHA, with SHA-1, SHA-256, SHA 224, SHA-512, SHA-512/224, SHA-512/256, SHA-384, MD5, HMAC &amp; SMAC</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNGVID</name>
              <description>Random Number Generator Version ID.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RNGB</name>
                  <description>RNGB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RNG4</name>
                  <description>RNG4</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SNW8VID</name>
              <description>SNOW-f8 Hardware Accelerator Version ID.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KASVID</name>
              <description>Kasumi f8/f9 Hardware Accelerator Version ID.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKVID</name>
              <description>Public Key Hardware Accelerator Version ID</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKHA_XT</name>
                  <description>PKHA-XT (32-bit); minimum modulus five bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKHA_SD32</name>
                  <description>PKHA-SD (32-bit)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKHA_SD64</name>
                  <description>PKHA-SD (64-bit)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKHA_SD128</name>
                  <description>PKHA-SD (128-bit)</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANUM_MS</name>
          <description>CHA Number Register, most-significant half</description>
          <addressOffset>0xFF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x41000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRCNUM</name>
              <description>The number of copies of the CRC module that are implemented in this version of CAAM</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SNW9NUM</name>
              <description>The number of copies of the SNOW-f9 module that are implemented in this version of CAAM</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZENUM</name>
              <description>The number of copies of ZUCE that are implemented in this version of CAAM</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ZANUM</name>
              <description>The number of copies of ZUCA that are implemented in this version of CAAM</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECONUM</name>
              <description>The number of copies of the DECO that are implemented in this version of CAAM</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>JRNUM</name>
              <description>The number of copies of the Job Ring that are implemented in this version of CAAM</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANUM_LS</name>
          <description>CHA Number Register, least-significant half</description>
          <addressOffset>0xFF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10011011</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AESNUM</name>
              <description>The number of copies of the AES module that are implemented in this version of CAAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DESNUM</name>
              <description>The number of copies of the DES module that are implemented in this version of CAAM.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ARC4NUM</name>
              <description>The number of copies of the ARC4 module that are implemented in this version of CAAM.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDNUM</name>
              <description>The number of copies of the MDHA (Hashing module) that are implemented in this version of CAAM.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RNGNUM</name>
              <description>The number of copies of the Random Number Generator that are implemented in this version of CAAM.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SNW8NUM</name>
              <description>The number of copies of the SNOW-f8 module that are implemented in this version of CAAM</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KASNUM</name>
              <description>The number of copies of the Kasumi module that are implemented in this version of CAAM</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PKNUM</name>
              <description>The number of copies of the Public Key module that are implemented in this version of CAAM</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAAMVID_MS</name>
          <description>CAAM Version ID Register, most-significant half</description>
          <addressOffset>0xFF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xA160402</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MIN_REV</name>
              <description>Minor revision number for CAAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJ_REV</name>
              <description>Major revision number for CAAM.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IP_ID</name>
              <description>ID for CAAM.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CAAMVID_LS</name>
          <description>CAAM Version ID Register, least-significant half</description>
          <addressOffset>0xFFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CONFIG_OPT</name>
              <description>Configuration options for CAAM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECO_REV</name>
              <description>ECO revision for CAAM.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTG_OPT</name>
              <description>Integration options for CAAM.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMPILE_OPT</name>
              <description>Compile options for CAAM.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRBAR_JR0</name>
          <description>Input Ring Base Address Register for Job Ring 0</description>
          <addressOffset>0x10000</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRBA</name>
              <description>Input Ring Base Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>36</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRSR_JR0</name>
          <description>Input Ring Size Register for Job Ring 0</description>
          <addressOffset>0x1000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRS</name>
              <description>Input Ring Size. (measured in number of entries)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRSAR_JR0</name>
          <description>Input Ring Slots Available Register for Job Ring 0</description>
          <addressOffset>0x10014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRSA</name>
              <description>Input Ring Slots Available. (measured in number of available job slots)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
