nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>P15SMAG1_JR0</name>
          <description>Secure Memory Access Group Registers</description>
          <addressOffset>0x10AFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Gx_ID00</name>
              <description>Bit set to 1 indicates SecureWorld DID 00 is a member of Access Group x.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID01</name>
              <description>Bit set to 1 indicates SecureWorld DID 01 is a member of Access Group x.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID02</name>
              <description>Bit set to 1 indicates SecureWorld DID 02 is a member of Access Group x (1 or 2).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID03</name>
              <description>Bit set to 1 indicates SecureWorld DID 03 is a member of Access Group x (1 or 2).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID04</name>
              <description>Bit set to 1 indicates SecureWorld DID 04 is a member of Access Group x (1 or 2).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID05</name>
              <description>Bit set to 1 indicates SecureWorld DID 05 is a member of Access Group x (1 or 2).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID06</name>
              <description>Bit set to 1 indicates SecureWorld DID 06 is a member of Access Group x (1 or 2).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID07</name>
              <description>Bit set to 1 indicates SecureWorld DID 07 is a member of Access Group x (1 or 2).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID08</name>
              <description>Bit set to 1 indicates SecureWorld DID 08 is a member of Access Group x (1 or 2).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID09</name>
              <description>Bit set to 1 indicates SecureWorld DID 09 is a member of Access Group x (1 or 2).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID10</name>
              <description>Bit set to 1 indicates SecureWorld DID 10 is a member of Access Group x (1 or 2).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID11</name>
              <description>Bit set to 1 indicates SecureWorld DID 11 is a member of Access Group x (1 or 2).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID12</name>
              <description>Bit set to 1 indicates SecureWorld DID 12 is a member of Access Group x (1 or 2).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID13</name>
              <description>Bit set to 1 indicates SecureWorld DID 13 is a member of Access Group x (1 or 2).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID14</name>
              <description>Bit set to 1 indicates SecureWorld DID 14 is a member of Access Group x (1 or 2).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID15</name>
              <description>Bit set to 1 indicates SecureWorld DID 15 is a member of Access Group x (1 or 2).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID16</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 00 is a member of Access Group x (1 or 2).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID17</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 01 is a member of Access Group x (1 or 2).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID18</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 02 is a member of Access Group x (1 or 2).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID19</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 03 is a member of Access Group x (1 or 2).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID20</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 04 is a member of Access Group x (1 or 2).</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID21</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 05 is a member of Access Group x (1 or 2).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID22</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 06 is a member of Access Group x (1 or 2).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID23</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 07 is a member of Access Group x (1 or 2).</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID24</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 08 is a member of Access Group x (1 or 2).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID25</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 09 is a member of Access Group x (1 or 2).</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID26</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 10 is a member of Access Group x (1 or 2).</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID27</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 11 is a member of Access Group x (1 or 2).</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID28</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 12 is a member of Access Group x (1 or 2).</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID29</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 13 is a member of Access Group x (1 or 2).</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID30</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 14 is a member of Access Group x (1 or 2).</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID31</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 15 is a member of Access Group x (1 or 2).</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR_JR0</name>
          <description>Secure Memory Command Register</description>
          <addressOffset>0x10BE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command: 1h: Allocate Page - This command allocates the page specified in the PAGE field to the partition specified in the PRTN field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PRTN</name>
              <description>Partition: When an Allocate Page or De-allocate Partition command is issued, the action is performed on the partition indicated in the PRTN field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PAGE</name>
              <description>This is the number of the page to be referenced in field CMD</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCSR_JR0</name>
          <description>Secure Memory Command Status Register</description>
          <addressOffset>0x10BEC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRTN</name>
              <description>Following a Page Inquiry Command, if the PO field is 10 or 11, this field indicates the partition to which the page specified in the PAGE field is allocated</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PO</name>
              <description>Page Owner: Following a Page Inquiry Command, this field indicates if the Page is owned by the entity that issued the inquiry, owned by another entity, or unowned</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVAILABLE</name>
                  <description>Available; Unowned: The entity that issued the inquiry may allocate this page to a partition. No zeroization is needed since it has already been cleared, therefore no interrupt should be expected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_PRESENT_OR_INITIALIZED</name>
                  <description>Page does not exist in this version or is not initialized yet.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNAVAILABLE</name>
                  <description>Another entity owns the page. This page is unavailable to the issuer of the inquiry.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OWNED</name>
                  <description>Owned by the entity making the inquiry. The owner may de-allocate this page if its partition is not marked PSP. If the partition to which the page is allocated is designated as CSP, the page will be zeroized upon de-allocation.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AERR</name>
              <description>Allocation Error</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CERR</name>
              <description>Command Error</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No Error.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_INCOMPLETE_ERROR</name>
                  <description>Command has not yet completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECURITY_FAILURE</name>
                  <description>A security failure occurred.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CMD_OVERFLOW_ERROR</name>
                  <description>Command Overflow. Another command was issued by the same Job Ring owner before the owner's previous command completed. The additional command was ignored.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAGE</name>
              <description>Page</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REIR0JR0</name>
          <description>Recoverable Error Interrupt Record 0 for Job Ring 0</description>
          <addressOffset>0x10E00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TYPE</name>
              <description>This field indicates the type of the recoverable error</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MISS</name>
              <description>If MISS=1, a second recoverable error associated with JR occurred before REIR0JR was written following a previous JR recoverable error</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REIR2JR0</name>
          <description>Recoverable Error Interrupt Record 2 for Job Ring 0</description>
          <addressOffset>0x10E08</addressOffset>
          <size>64</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR</name>
              <description>Address associated with the recoverable JR error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>36</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REIR4JR0</name>
          <description>Recoverable Error Interrupt Record 4 for Job Ring 0</description>
          <addressOffset>0x10E10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ICID</name>
              <description>This field holds the ICID associated with the recoverable error.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DID</name>
              <description>This field holds the DID associated with the recoverable error.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AXCACHE</name>
              <description>This field holds the AXI cache control transaction attribute used for the memory access.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AXPROT</name>
              <description>This field holds the AXI protection transaction attribute used for the memory access.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RWB</name>
              <description>This field specifies whether the memory access was a read or write.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR</name>
              <description>This field holds the AXI error response associated with the recoverable error.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MIX</name>
              <description>This field holds the memory interface index associated with the recoverable error.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REIR5JR0</name>
          <description>Recoverable Error Interrupt Record 5 for Job Ring 0</description>
          <addressOffset>0x10E14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BID</name>
              <description>This field holds the block identifier (see Internal Block ID) of the source of the AXI transaction associated with the recoverable error</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BNDG</name>
              <description>This field indicates whether the bus transaction associated with the recoverable error was initiating an CAAM Secure Memory blob operation</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TDSC</name>
              <description>This field indicates whether the bus transaction associated with the recoverable error was an attempt to assert trusted descriptor privilege when accessing an CAAM Secure Memory partition</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KMOD</name>
              <description>This field indicates whether the bus transaction associated with the recoverable error was an attempt to read the key modifier associated with an CAAM Secure Memory partition</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>KEY</name>
              <description>This field indicates whether the bus transaction associated with the recoverable error was an attempted key access to CAAM Secure Memory</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SMA</name>
              <description>This field indicates whether the bus transaction associated with the recoverable error was an attempted access to CAAM Secure Memory</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
