nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>IRBAR_JR1</name>
          <description>Input Ring Base Address Register for Job Ring 1</description>
          <addressOffset>0x20000</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRBA</name>
              <description>Input Ring Base Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>36</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRSR_JR1</name>
          <description>Input Ring Size Register for Job Ring 1</description>
          <addressOffset>0x2000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRS</name>
              <description>Input Ring Size. (measured in number of entries)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRSAR_JR1</name>
          <description>Input Ring Slots Available Register for Job Ring 1</description>
          <addressOffset>0x20014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRSA</name>
              <description>Input Ring Slots Available. (measured in number of available job slots)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRJAR_JR1</name>
          <description>Input Ring Jobs Added Register for Job Ring1</description>
          <addressOffset>0x2001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IRJA</name>
              <description>Input Ring Jobs Added. (measured in number of entries)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ORBAR_JR1</name>
          <description>Output Ring Base Address Register for Job Ring 1</description>
          <addressOffset>0x20020</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ORBA</name>
              <description>Output Ring Base Address.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>36</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ORSR_JR1</name>
          <description>Output Ring Size Register for Job Ring 1</description>
          <addressOffset>0x2002C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ORS</name>
              <description>Output Ring Size. (measured in number of entries)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ORJRR_JR1</name>
          <description>Output Ring Jobs Removed Register for Job Ring 1</description>
          <addressOffset>0x20034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ORJR</name>
              <description>Output Ring Jobs Removed. (measured in number of entries)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ORSFR_JR1</name>
          <description>Output Ring Slots Full Register for Job Ring 1</description>
          <addressOffset>0x2003C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ORSF</name>
              <description>Output Ring Slots Full. (measured in number of entries)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JRSTAR_JR1</name>
          <description>Job Ring Output Status Register for Job Ring 1</description>
          <addressOffset>0x20044</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSED</name>
              <description>Source-specific error details</description>
              <bitOffset>0</bitOffset>
              <bitWidth>28</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSRC</name>
              <description>Status source. These bits define which source is reporting the status. All other values - reserved</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_STATUS</name>
                  <description>No Status Source (No Error or Status Reported)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCB_STATUS</name>
                  <description>CCB Status Source (CCB Error Reported)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMP_USR_STATUS</name>
                  <description>Jump Halt User Status Source (User-Provided Status Reported)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECO_STATUS</name>
                  <description>DECO Status Source (DECO Error Reported)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JR_STATUS</name>
                  <description>Job Ring Status Source (Job Ring Error Reported)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMP_COND_STATUS</name>
                  <description>Jump Halt Condition Codes (Condition Code Status Reported)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>JRINTR_JR1</name>
          <description>Job Ring Interrupt Status Register for Job Ring 1</description>
          <addressOffset>0x2004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JRI</name>
              <description>Job Ring Interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>JRE</name>
              <description>Job Ring Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halt the Job Ring</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ENTER_FAIL</name>
              <description>Enter SNVS Fail State</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>EXIT_FAIL</name>
              <description>Exit SNVS Fail State</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>ERR_TYPE</name>
              <description>Error type</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OR_WR_ERR</name>
                  <description>Error writing status to Output Ring</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAD_IR_ADDR_ERR</name>
                  <description>Bad input ring base address (not on a 4-byte boundary).</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BAD_OR_ADDR_ERR</name>
                  <description>Bad output ring base address (not on a 4-byte boundary).</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_IR_REG_WR_ERR</name>
                  <description>Invalid write to Input Ring Base Address Register or Input Ring Size Register. Can be written when there are no jobs in the input ring or when the Job Ring is halted. These are fatal and will likely result in not being able to get all jobs out into the output ring for processing by software. Resetting the job ring will almost certainly be necessary.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_OR_REG_WR_ERR</name>
                  <description>Invalid write to Output Ring Base Address Register or Output Ring Size Register. Can be written when there are no jobs in the output ring and no jobs from this queue are already processing in CAAM (in the holding tanks or DECOs), or when the Job Ring is halted.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_JR_RESET_ERR</name>
                  <description>Job Ring reset released before Job Ring is halted.</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ORJRR_GT_ORSFR_ERR</name>
                  <description>Removed too many jobs (ORJRR larger than ORSFR).</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRJAR_GT_IRSAR_ERR</name>
                  <description>Added too many jobs (IRJAR larger than IRSAR).</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ORSF_GT_ORS_ERR</name>
                  <description>Writing ORSF &gt; ORS In these error cases the write is ignored, the interrupt is asserted (unless masked) and the error bit and error_type fields are set in the Job Ring Interrupt Status Register.</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRSA_GT_IRS_ERR</name>
                  <description>Writing IRSA &gt; IRS</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ORWI_GT_ORS_ERR</name>
                  <description>Writing ORWI &gt; ORS in bytes</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRRI_GT_IRS_ERR</name>
                  <description>Writing IRRI &gt; IRS in bytes</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_IRSA_WR_ERR</name>
                  <description>Writing IRSA when ring is active</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_IRRI_WR_ERR</name>
                  <description>Writing IRRI when ring is active</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_ORSF_WR_ERR</name>
                  <description>Writing ORSF when ring is active</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_ORWI_WR_ERR</name>
                  <description>Writing ORWI when ring is active</description>
                  <value>0x11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERR_ORWI</name>
              <description>Output ring write index with error</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JRCFGR_JR1_MS</name>
          <description>Job Ring Configuration Register for Job Ring 1, most-significant half</description>
          <addressOffset>0x20050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MBSI</name>
              <description>To assist with mixed Endianness platforms, this bit configures a byte swap of message data read by CAAM DMA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MHWSI</name>
              <description>To assist with mixed Endianness platforms, this bit configures a halfword swap of message data read by CAAM DMA</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MWSI</name>
              <description>To assist with mixed Endianness platforms, this bit configures a fullword swap of message data read by CAAM DMA</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBSI</name>
              <description>To assist with mixed Endianness platforms, this bit configures a byte swap of control data read by CAAM DMA</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHWSI</name>
              <description>To assist with mixed Endianness platforms, this bit configures a halfword swap of control data read by CAAM DMA</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CWSI</name>
              <description>To assist with mixed Endianness platforms, this bit configures a fullword swap of control data read by CAAM DMA</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MBSO</name>
              <description>To assist with mixed Endianness platforms, this bit configures a byte swap of message data written by CAAM DMA</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MHWSO</name>
              <description>To assist with mixed Endianness platforms, this bit configures a halfword swap of message data written by CAAM DMA</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MWSO</name>
              <description>To assist with mixed Endianness platforms, this bit configures a fullword swap of message data written by CAAM DMA</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBSO</name>
              <description>To assist with mixed Endianness platforms, this bit configures a byte swap of control data written by CAAM DMA</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHWSO</name>
              <description>To assist with mixed Endianness platforms, this bit configures a halfword swap of control data written by CAAM DMA</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CWSO</name>
              <description>To assist with mixed Endianness platforms, this bit configures a fullword swap of control data written by CAAM DMA</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMBS</name>
              <description>Descriptor Message Data Byte Swap (this applies only to internal message data transfers to/from DECO Descriptor Buffers)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PEO</name>
              <description>Platform Endian Override - The bit is XORed with the PLEND bit in the CaCSTA Register and the other &quot;swap&quot; bits in the Job Ring Configuration Register to determine the AXI Master's view of memory endianness when executing Job Descriptors from this Job Ring</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWSO</name>
              <description>Double Word Swap Override</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAIL_MODE</name>
              <description>Fail mode control</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INCL_SEQ_OUT</name>
              <description>Include Sequence Out Length</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
