nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>P14SMAPR_JR3</name>
          <description>Secure Memory Access Permissions register</description>
          <addressOffset>0x40AE4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>G1_READ</name>
              <description>Access Group 1 Read</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>G1_READ_PROHIB</name>
                  <description>Instruction fetches and reads are prohibited (except that Trusted Descriptor reads (if G1_TDO=1) and key-reads are always allowed, and exporting Secure Memory Blobs is allowed if G1_SMBLOB=1 or if done by a Trusted Descriptor and G1_TDO=1).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G1_READ_ALLOWED</name>
                  <description>Instruction fetches and reads are allowed (but exporting a Secure Memory Blob is prohibited if G1_SMBLOB=0 and the descriptor is not a Trusted Descriptor or if G1_TDO=0).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>G1_WRITE</name>
              <description>Access Group 1 Write</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>G1_WRITE_PROHIB</name>
                  <description>Writes are prohibited (except that Trusted Descriptor writes are allowed, and importing Secure Memory Blobs is allowed if G1_SMBLOB=1 or if done by a Trusted Descriptor and G1_TDO=1).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G1_WRITE_ALLOWED</name>
                  <description>Writes are allowed (but importing a Secure Memory Blob is prohibited if G1_SMBLOB=0 and the descriptor is not a Trusted Descriptor or if G1_TDO=0).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>G1_TDO</name>
              <description>Access Group 1 Trusted Descriptor Override</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>G1_TD_PRIVILEGE_AS_JD</name>
                  <description>Trusted Descriptors have the same access privileges as Job Descriptors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G1_TD_OVERIDE_ALLOWED</name>
                  <description>Trusted Descriptors are allowed to override the other access permissions, i.e. they can export blobs from or import blobs to the partition and read from and write to the partition regardless of the G1_SMBLOB, G1_WRITE and G1_READ settings.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>G1_SMBLOB</name>
              <description>Access Group 1 Secure Memory Blobs</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>G1_SM_BLOB_EXPORT_IMPORT_PROHIB</name>
                  <description>Exporting or importing Secure Memory Blobs is prohibited, unless done via a Trusted Descriptor and G1_TDO=1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G1_SM_B_EXPORT_IMPORT_ALLOWED</name>
                  <description>Exporting or importing Secure Memory Blobs is allowed, regardless of the G1_READ and G1_WRITE settings.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>G2_READ</name>
              <description>Access Group 2 Read</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>G2_READ_PROHIB</name>
                  <description>Instruction fetches and reads are prohibited (except that Trusted Descriptor reads (if G2_TDO=1) and key-reads are always allowed, and exporting Secure Memory Blobs is allowed if G2_SMBLOB=1 or if done by a Trusted Descriptor and G2_TDO=1).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G2_READ_ALLOWED</name>
                  <description>Instruction fetches and reads are allowed (but exporting a Secure Memory Blob is prohibited if G2_SMBLOB=0 and the descriptor is not a Trusted Descriptor or if G2_TDO=0).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>G2_WRITE</name>
              <description>Access Group 2 Write</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>G2_WRITE_PROHIB</name>
                  <description>Writes are prohibited (except that Trusted Descriptor writes are allowed, and importing Secure Memory Blobs is allowed if G2_SMBLOB=1 or if done by a Trusted Descriptor and G2_TDO=1).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G2_WRITE_ALLOWED</name>
                  <description>Writes are allowed (but importing a Secure Memory Blob is prohibited if G2_SMBLOB=0 and the descriptor is not a Trusted Descriptor or if G2_TDO=0).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>G2_TDO</name>
              <description>Access Group 2 Trusted Descriptor Override</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>G2_TD_PRIVILEGE_AS_JD</name>
                  <description>Trusted Descriptors have the same access privileges as Job Descriptors</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G2_TD_OVERIDE_ALLOWED</name>
                  <description>Trusted Descriptors are allowed to override the other access permissions, i.e. they can export blobs from or import blobs to the partition and read from and write to the partition regardless of the G2_SMBLOB, G2_WRITE and G2_READ settings.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>G2_SMBLOB</name>
              <description>Access Group 2 Secure Memory Blobs</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>G2_SM_BLOB_EXPORT_IMPORT_PROHIB</name>
                  <description>Exporting or importing Secure Memory Blobs is prohibited, unless done via a Trusted Descriptor and G2_TDO=1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>G2_SM_BLOB_EXPORT_IMPORT_ALLOWED</name>
                  <description>Exporting or importing Secure Memory Blobs is allowed, regardless of the G2_READ and G2_WRITE settings.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMAG_LCK</name>
              <description>SMAG LOCK bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMAG_UNLOCKED</name>
                  <description>The SMAG2JR register and SMAG1JR register are unlocked. The partition owner can change any writable bits of these registers.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMAG_LOCKED</name>
                  <description>The SMAG2JR register and SMAG1JR register are locked. The SMAG2JR and SMAG1JR registers cannot be changed until the partition is de-allocated or a POR occurs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMAP_LCK</name>
              <description>SMAP LOCK bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMAP_UNLOCKED</name>
                  <description>The SMAP register is unlocked. The partition owner can change any writable bits of the SMAP register.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMAP_LOCKED</name>
                  <description>The SMAP register is locked. The SMAP_LCK, CSP and PSP bits and G1 and G2 permission bits of the SMAP register cannot be changed until the partition is de-allocated or a POR occurs. The PARTITION_KMOD value can still be changed. The SMAG_LCK bit can be changed to a 1, but cannot be changed to a 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSP</name>
              <description>Public Security Parameters</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_DEALLOCATABLE</name>
                  <description>The partition and any of the pages allocated to the partition can be de-allocated.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEALLOCATABLE</name>
                  <description>The partition cannot be de-allocated and the pages allocated to the partition cannot be de-allocated.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSP</name>
              <description>Critical Security Parameters</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ZEROIZED</name>
                  <description>The pages allocated to the partition will not be zeroized when they are de-allocated or the partition is released or a security alarm occurs.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ZEROIZED</name>
                  <description>The pages allocated to the partition will be zeroized when they are individually de-allocated or the partition is released or a security alarm occurs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARTITION_KMOD</name>
              <description>The value in this field is used to modify the Blob Key Encryption Key when exporting cryptographic Blobs from, or importing cryptographic Blobs to, this partition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P14SMAG2_JR3</name>
          <description>Secure Memory Access Group Registers</description>
          <addressOffset>0x40AE8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Gx_ID00</name>
              <description>Bit set to 1 indicates SecureWorld DID 00 is a member of Access Group x.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID01</name>
              <description>Bit set to 1 indicates SecureWorld DID 01 is a member of Access Group x.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID02</name>
              <description>Bit set to 1 indicates SecureWorld DID 02 is a member of Access Group x (1 or 2).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID03</name>
              <description>Bit set to 1 indicates SecureWorld DID 03 is a member of Access Group x (1 or 2).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID04</name>
              <description>Bit set to 1 indicates SecureWorld DID 04 is a member of Access Group x (1 or 2).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID05</name>
              <description>Bit set to 1 indicates SecureWorld DID 05 is a member of Access Group x (1 or 2).</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID06</name>
              <description>Bit set to 1 indicates SecureWorld DID 06 is a member of Access Group x (1 or 2).</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID07</name>
              <description>Bit set to 1 indicates SecureWorld DID 07 is a member of Access Group x (1 or 2).</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID08</name>
              <description>Bit set to 1 indicates SecureWorld DID 08 is a member of Access Group x (1 or 2).</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID09</name>
              <description>Bit set to 1 indicates SecureWorld DID 09 is a member of Access Group x (1 or 2).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID10</name>
              <description>Bit set to 1 indicates SecureWorld DID 10 is a member of Access Group x (1 or 2).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID11</name>
              <description>Bit set to 1 indicates SecureWorld DID 11 is a member of Access Group x (1 or 2).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID12</name>
              <description>Bit set to 1 indicates SecureWorld DID 12 is a member of Access Group x (1 or 2).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID13</name>
              <description>Bit set to 1 indicates SecureWorld DID 13 is a member of Access Group x (1 or 2).</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID14</name>
              <description>Bit set to 1 indicates SecureWorld DID 14 is a member of Access Group x (1 or 2).</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID15</name>
              <description>Bit set to 1 indicates SecureWorld DID 15 is a member of Access Group x (1 or 2).</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID16</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 00 is a member of Access Group x (1 or 2).</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID17</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 01 is a member of Access Group x (1 or 2).</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID18</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 02 is a member of Access Group x (1 or 2).</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID19</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 03 is a member of Access Group x (1 or 2).</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID20</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 04 is a member of Access Group x (1 or 2).</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID21</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 05 is a member of Access Group x (1 or 2).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID22</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 06 is a member of Access Group x (1 or 2).</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID23</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 07 is a member of Access Group x (1 or 2).</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID24</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 08 is a member of Access Group x (1 or 2).</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID25</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 09 is a member of Access Group x (1 or 2).</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID26</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 10 is a member of Access Group x (1 or 2).</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID27</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 11 is a member of Access Group x (1 or 2).</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID28</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 12 is a member of Access Group x (1 or 2).</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID29</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 13 is a member of Access Group x (1 or 2).</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID30</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 14 is a member of Access Group x (1 or 2).</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>Gx_ID31</name>
              <description>Bit set to 1 indicates NonSecureWorld DID 15 is a member of Access Group x (1 or 2).</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
