nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>C0C1MR</name>
          <description>CCB 0 Class 1 Mode Register Format for Non-Public Key Algorithms</description>
          <alternateGroup>C1MR_RNG</alternateGroup>
          <addressOffset>0x80004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENC</name>
              <description>Encrypt/Decrypt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DECRYPT</name>
                  <description>Decrypt.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENCRYPT</name>
                  <description>Encrypt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICV_TEST</name>
              <description>ICV Checking / Test AESA fault detection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS</name>
              <description>Algorithm State</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Update</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIALIZE</name>
                  <description>Initialize</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINALIZE</name>
                  <description>Finalize</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INIT_FINAL</name>
                  <description>Initialize/Finalize</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AAI</name>
              <description>Additional Algorithm information</description>
              <bitOffset>4</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALG</name>
              <description>Algorithm. This field specifies which algorithm is being selected.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES</name>
                  <description>AES</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DES</name>
                  <description>DES</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DES_3</name>
                  <description>3DES</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RNG</name>
                  <description>RNG</description>
                  <value>0x50</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1MR_PK</name>
          <description>CCB 0 Class 1 Mode Register Format for Public Key Algorithms</description>
          <alternateGroup>C1MR_RNG</alternateGroup>
          <addressOffset>0x80004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKHA_MODE_LS</name>
              <description>PKHA_MODE least significant 12 bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PKHA_MODE_MS</name>
              <description>PKHA_MODE most-significant 4 bits</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1MR_RNG</name>
          <description>CCB 0 Class 1 Mode Register Format for RNG4</description>
          <alternateGroup>C1MR_RNG</alternateGroup>
          <addressOffset>0x80004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TST</name>
              <description>Test Mode Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PR</name>
              <description>Prediction Resistance</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AS</name>
              <description>Algorithm State</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SH</name>
              <description>State Handle</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SH0</name>
                  <description>State Handle 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SH1</name>
                  <description>State Handle 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NZB</name>
              <description>NonZero bytes</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ZERO_BYTES_OK</name>
                  <description>Generate random data with all-zero bytes permitted.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_ZERO_BYTES</name>
                  <description>Generate random data without any all-zero bytes.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBP</name>
              <description>Odd Byte Parity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_ODD_BYTE_PARITY</name>
                  <description>No odd byte parity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODD_BYTE_PARITY</name>
                  <description>Generate random data with odd byte parity.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PS</name>
              <description>Personalization String Included</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_PS_STRING</name>
                  <description>No personalization string is included.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PS_STRING_INCL</name>
                  <description>A personalization string is included.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AI</name>
              <description>Additional Input Included</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ADDL_INPUT</name>
                  <description>No additional entropy input has been provided.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDL_INPUT</name>
                  <description>Additional entropy input has been provided.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SK</name>
              <description>Secure Key</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RNG_DEST_SPECD_BY_FIFO_STORE</name>
                  <description>The destination for the RNG data is specified by the FIFO STORE command.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RNG_DATA_TO_KEKR</name>
                  <description>The RNG data will go to the JDKEKR, TDKEKR and DSKR.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALG</name>
              <description>Algorithm. This field specifies which algorithm is being selected.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RNG</name>
                  <description>RNG</description>
                  <value>0x50</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1KSR</name>
          <description>CCB 0 Class 1 Key Size Register</description>
          <addressOffset>0x8000C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1KS</name>
              <description>Class 1 Key Size. This is the size of a Class 1 Key measured in bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1DSR</name>
          <description>CCB 0 Class 1 Data Size Register</description>
          <addressOffset>0x80010</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1DS</name>
              <description>Class 1 Data Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C1CY</name>
              <description>Class 1 Data Size Carry</description>
              <bitOffset>32</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_C1DS_CARRY</name>
                  <description>No carry out of the C1 Data Size Reg.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C1DS_CARRY</name>
                  <description>There was a carry out of the C1 Data Size Reg.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMBITS</name>
              <description>Class 1 Data Size Number of bits</description>
              <bitOffset>61</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1ICVSR</name>
          <description>CCB 0 Class 1 ICV Size Register</description>
          <addressOffset>0x8001C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1ICVS</name>
              <description>Class 1 ICV Size, in Bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
