nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>C0CSTA_MS</name>
          <description>CCB 0 Status and Error Register, most-significant half</description>
          <addressOffset>0x80048</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ERRID1</name>
              <description>Error ID 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_ERROR</name>
                  <description>Mode Error</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_SIZE_ERROR</name>
                  <description>Data Size Error, including PKHA N Memory Size Error</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEY_SIZE_ERROR</name>
                  <description>Key Size Error, including PKHA E Memory Size Error</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKHA_A_SIZE_ERROR</name>
                  <description>PKHA A Memory Size Error</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKHA_B_SIZE_ERROR</name>
                  <description>PKHA B Memory Size Error</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUT_OF_SEQ_ERROR</name>
                  <description>Data Arrived out of Sequence Error</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVIDE_BY_0_ERROR</name>
                  <description>PKHA Divide by Zero Error</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOD_EVEN_ERROR</name>
                  <description>PKHA Modulus Even Error</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DES_KEY_PARITY_ERROR</name>
                  <description>DES Key Parity Error</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ICV_CHECK_FAILED_ERROR</name>
                  <description>ICV Check Failed</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNAL_HW_FAIL</name>
                  <description>Internal Hardware Failure</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM_AAD_SISE_ERROR</name>
                  <description>CCM AAD Size Error (either 1. AAD flag in B0 =1 and no AAD type provided, 2. AAD flag in B0 = 0 and AAD provided, or 3. AAD flag in B0 =1 and not enough AAD provided - expecting more based on AAD size.)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C1_CHA_NOT_RESET_ERROR</name>
                  <description>Class 1 CHA is not reset</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_CHA_COMBO_ERROR</name>
                  <description>Invalid CHA combination was selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_CHA_SELECTED_ERROR</name>
                  <description>Invalid CHA Selected</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL1</name>
              <description>Class 1 algorithms</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES</name>
                  <description>AES</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DES</name>
                  <description>DES</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RNG</name>
                  <description>RNG</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PK</name>
                  <description>Public Key</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRID2</name>
              <description>Error ID 2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_ERROR</name>
                  <description>Mode Error</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_SIZE_ERROR</name>
                  <description>Data Size Error</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>KEY_SIZE_ERROR</name>
                  <description>Key Size Error</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_OUT_OF_SEQ_ERROR</name>
                  <description>Data Arrived out of Sequence Error</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ICV_CHECK_ERROR</name>
                  <description>ICV Check Failed</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERNAL_HW_ERROR</name>
                  <description>Internal Hardware Failure</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_CHA_COMBO_ERROR</name>
                  <description>Invalid CHA combination was selected.</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVALID_CHA_SELECT_ERROR</name>
                  <description>Invalid CHA Selected</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CL2</name>
              <description>Class 2 Algorithms</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MD</name>
                  <description>MD5, SHA-1, SHA-224, SHA-256, SHA-384, SHA-512 and SHA-512/224, SHA-512/256</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC</name>
                  <description>CRC</description>
                  <value>0x9</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>C0CSTA_LS</name>
          <description>CCB 0 Status and Error Register, least-significant half</description>
          <addressOffset>0x8004C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AB</name>
              <description>AESA Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESA_IDLE</name>
                  <description>AESA Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESA_BUSY</name>
                  <description>AESA Busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DB</name>
              <description>DESA Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DESA_IDLE</name>
                  <description>DESA Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DESA_BUSY</name>
                  <description>DESA Busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PB</name>
              <description>PKHA Busy</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PKHA_IDLE</name>
                  <description>PKHA Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PKHA_BUSY</name>
                  <description>PKHA Busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MB</name>
              <description>MDHA Busy</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MDHA_IDLE</name>
                  <description>MDHA Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDHA_BUSY</name>
                  <description>MDHA Busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CB</name>
              <description>CRC Block Busy</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CRCA_IDLE</name>
                  <description>CRCA Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRCA_BUSY</name>
                  <description>CRCA Busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNB</name>
              <description>RNG Block Busy</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RNG_IDLE</name>
                  <description>RNG Idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RNG_BUSY</name>
                  <description>RNG Busy</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDI</name>
              <description>Class 1 Done Interrupt. The Class 1 Done Interrupt has been asserted.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C1_NOT_DONE</name>
                  <description>Not Done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C1_DONE_INT</name>
                  <description>Done Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDI</name>
              <description>Class 2 Done Interrupt. The Class 2 Done Interrupt has been asserted.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>C2_NOT_DONE</name>
                  <description>Not Done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C2_DONE_INT</name>
                  <description>Done Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PEI</name>
              <description>Class 1 Error Interrupt. The Class 1 Error Interrupt has been asserted.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_C1_ERROR</name>
                  <description>No Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C1_ERROR_INT</name>
                  <description>Error Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEI</name>
              <description>Class 2 Error Interrupt. The Class 2 Error Interrupt has been asserted.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_C2_ERROR</name>
                  <description>No Error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C2_ERROR_INT</name>
                  <description>Error Interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRM</name>
              <description>Public Key is Prime</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_PRIME</name>
                  <description>The given number is NOT prime.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROBABLY_PRIME</name>
                  <description>The given number is probably prime.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GCD</name>
              <description>GCD is One</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GCD_IS_NOT_1</name>
                  <description>The greatest common divisor of two numbers is NOT one.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCD_IS_1</name>
                  <description>The greatest common divisor of two numbers is one.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PIZ</name>
              <description>Public Key Operation is Zero</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PK_RESULT_NONZERO</name>
                  <description>The result of a Public Key operation is not zero.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PK_RESULT_ZERO</name>
                  <description>The result of a Public Key operation is zero.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1AADSZR</name>
          <description>CCB 0 Class 1 AAD Size Register</description>
          <addressOffset>0x8005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AASZ</name>
              <description>AAD size in Bytes, mod 16.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1IVSZR</name>
          <description>CCB 0 Class 1 IV Size Register</description>
          <addressOffset>0x80064</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IVSZ</name>
              <description>IV size in bytes, mod 16.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0PKASZR</name>
          <description>PKHA A Size Register</description>
          <addressOffset>0x80084</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKASZ</name>
              <description>PKHA A Memory key size in bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0PKBSZR</name>
          <description>PKHA B Size Register</description>
          <addressOffset>0x8008C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKBSZ</name>
              <description>PKHA B Memory key size in bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0PKNSZR</name>
          <description>PKHA N Size Register</description>
          <addressOffset>0x80094</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKNSZ</name>
              <description>PKHA N Memory key size in bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0PKESZR</name>
          <description>PKHA E Size Register</description>
          <addressOffset>0x8009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PKESZ</name>
              <description>PKHA E Memory key size in bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR0</name>
          <description>CCB 0 Class 1 Context Register Word 0</description>
          <addressOffset>0x80100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR1</name>
          <description>CCB 0 Class 1 Context Register Word 1</description>
          <addressOffset>0x80104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
