nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>C0C1CTXR2</name>
          <description>CCB 0 Class 1 Context Register Word 2</description>
          <addressOffset>0x80108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR3</name>
          <description>CCB 0 Class 1 Context Register Word 3</description>
          <addressOffset>0x8010C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR4</name>
          <description>CCB 0 Class 1 Context Register Word 4</description>
          <addressOffset>0x80110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR5</name>
          <description>CCB 0 Class 1 Context Register Word 5</description>
          <addressOffset>0x80114</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR6</name>
          <description>CCB 0 Class 1 Context Register Word 6</description>
          <addressOffset>0x80118</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR7</name>
          <description>CCB 0 Class 1 Context Register Word 7</description>
          <addressOffset>0x8011C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR8</name>
          <description>CCB 0 Class 1 Context Register Word 8</description>
          <addressOffset>0x80120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR9</name>
          <description>CCB 0 Class 1 Context Register Word 9</description>
          <addressOffset>0x80124</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR10</name>
          <description>CCB 0 Class 1 Context Register Word 10</description>
          <addressOffset>0x80128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR11</name>
          <description>CCB 0 Class 1 Context Register Word 11</description>
          <addressOffset>0x8012C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR12</name>
          <description>CCB 0 Class 1 Context Register Word 12</description>
          <addressOffset>0x80130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR13</name>
          <description>CCB 0 Class 1 Context Register Word 13</description>
          <addressOffset>0x80134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR14</name>
          <description>CCB 0 Class 1 Context Register Word 14</description>
          <addressOffset>0x80138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1CTXR15</name>
          <description>CCB 0 Class 1 Context Register Word 15</description>
          <addressOffset>0x8013C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1CTX</name>
              <description>Class 1 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1KR0</name>
          <description>CCB 0 Class 1 Key Registers Word 0</description>
          <addressOffset>0x80200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1KEY</name>
              <description>Class 1 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1KR1</name>
          <description>CCB 0 Class 1 Key Registers Word 1</description>
          <addressOffset>0x80204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1KEY</name>
              <description>Class 1 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1KR2</name>
          <description>CCB 0 Class 1 Key Registers Word 2</description>
          <addressOffset>0x80208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1KEY</name>
              <description>Class 1 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1KR3</name>
          <description>CCB 0 Class 1 Key Registers Word 3</description>
          <addressOffset>0x8020C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1KEY</name>
              <description>Class 1 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1KR4</name>
          <description>CCB 0 Class 1 Key Registers Word 4</description>
          <addressOffset>0x80210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1KEY</name>
              <description>Class 1 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1KR5</name>
          <description>CCB 0 Class 1 Key Registers Word 5</description>
          <addressOffset>0x80214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1KEY</name>
              <description>Class 1 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1KR6</name>
          <description>CCB 0 Class 1 Key Registers Word 6</description>
          <addressOffset>0x80218</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1KEY</name>
              <description>Class 1 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C1KR7</name>
          <description>CCB 0 Class 1 Key Registers Word 7</description>
          <addressOffset>0x8021C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C1KEY</name>
              <description>Class 1 Key.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2MR</name>
          <description>CCB 0 Class 2 Mode Register</description>
          <addressOffset>0x80404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AP</name>
              <description>Authenticate / Protect</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUTHENTICATE</name>
                  <description>Authenticate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROTECT</name>
                  <description>Protect</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ICV</name>
              <description>ICV Checking</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_COMPARISON</name>
                  <description>Don't compare the calculated ICV against a received ICV.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARISON</name>
                  <description>Compare the calculated ICV against a received ICV.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AS</name>
              <description>Algorithm State</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UPDATE</name>
                  <description>Update.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIALIZE</name>
                  <description>Initialize.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FINALIZE</name>
                  <description>Finalize.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIALIZE_FINALIZE</name>
                  <description>Initialize/Finalize.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AAI</name>
              <description>Additional Algorithm information</description>
              <bitOffset>4</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALG</name>
              <description>Algorithm. This field specifies which algorithm has been requested for an OPERATION command.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MD5</name>
                  <description>MD5</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA_1</name>
                  <description>SHA-1</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA_224</name>
                  <description>SHA-224</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA_256</name>
                  <description>SHA-256</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA_384</name>
                  <description>SHA-384</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA_512</name>
                  <description>SHA-512</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA_512_224</name>
                  <description>SHA-512/224</description>
                  <value>0x46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHA_512_256</name>
                  <description>SHA-512/256</description>
                  <value>0x47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CRC</name>
                  <description>CRC</description>
                  <value>0x90</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2KSR</name>
          <description>CCB 0 Class 2 Key Size Register</description>
          <addressOffset>0x8040C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2KS</name>
              <description>Class 2 key size in bytes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2DSR</name>
          <description>CCB 0 Class 2 Data Size Register</description>
          <addressOffset>0x80410</addressOffset>
          <size>64</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2DS</name>
              <description>Class 2 Data Size in Bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>C2CY</name>
              <description>Class 2 Data Size Carry</description>
              <bitOffset>32</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_C2DS_CARRY</name>
                  <description>A write to the Class 2 Data Size Register did not cause a carry.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>C2DS_CARRY</name>
                  <description>A write to the Class 2 Data Size Register caused a carry.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUMBITS</name>
              <description>Class 2 Data Size Number of bits</description>
              <bitOffset>61</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2ICVSZR</name>
          <description>CCB 0 Class 2 ICV Size Register</description>
          <addressOffset>0x8041C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ICVSZ</name>
              <description>Class 2 ICV size (mod 8) in bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2CTXR0</name>
          <description>CCB 0 Class 2 Context Register Word 0</description>
          <addressOffset>0x80500</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2CTXR</name>
              <description>Class 2 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>C0C2CTXR1</name>
          <description>CCB 0 Class 2 Context Register Word 1</description>
          <addressOffset>0x80504</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>C2CTXR</name>
              <description>Class 2 Context.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
