nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>D0OPSTA_MS</name>
          <description>DECO0 Operation Status Register, most-significant half</description>
          <addressOffset>0x80810</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATUS</name>
              <description>If ERRTYP indicates no error, this field contains PKHA/Math Status, as defined below</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>COMMAND_INDEX</name>
              <description>Command index: A pointer to a 32-bit word within the descriptor</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NLJ</name>
              <description>Non-Local Jump</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ORIGINAL_DESC</name>
                  <description>The original job descriptor running in this DECO has not caused another job descriptor to be executed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_LOCAL_DECR</name>
                  <description>The original job descriptor running in this DECO has caused another job descriptor to be executed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATUS_TYPE</name>
              <description>Status Type</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_AN_ERROR</name>
                  <description>no error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_ERROR</name>
                  <description>DMA error</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCB_ERROR</name>
                  <description>CCB error</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JHALT_STATUS</name>
                  <description>Jump Halt User Status</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DECO_ERROR</name>
                  <description>DECO error</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JHALT_COND</name>
                  <description>Jump Halt Condition Code</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>D0OPSTA_LS</name>
          <description>DECO0 Operation Status Register, least-significant half</description>
          <addressOffset>0x80814</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUT_CT</name>
              <description>Output Count. Number of bytes written to sequential out pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0PDIDSR</name>
          <description>DECO0 Primary DID Status Register</description>
          <addressOffset>0x80820</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIM_DID</name>
              <description>DECO Primary DID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRIM_ICID</name>
              <description>DECO Primary ICID</description>
              <bitOffset>19</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0ODIDSR</name>
          <description>DECO0 Output DID Status Register</description>
          <addressOffset>0x80824</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUT_DID</name>
              <description>DECO Output DID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_ICID</name>
              <description>DECO Output ICID</description>
              <bitOffset>19</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0MTH0_MS</name>
          <description>DECO0 Math Register 0_MS</description>
          <addressOffset>0x80840</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATH_MS</name>
              <description>MATH register, most-significant 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0MTH0_LS</name>
          <description>DECO0 Math Register 0_LS</description>
          <addressOffset>0x80844</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATH_LS</name>
              <description>MATH register, least-significant 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0MTH1_MS</name>
          <description>DECO0 Math Register 1_MS</description>
          <addressOffset>0x80848</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATH_MS</name>
              <description>MATH register, most-significant 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0MTH1_LS</name>
          <description>DECO0 Math Register 1_LS</description>
          <addressOffset>0x8084C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATH_LS</name>
              <description>MATH register, least-significant 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0MTH2_MS</name>
          <description>DECO0 Math Register 2_MS</description>
          <addressOffset>0x80850</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATH_MS</name>
              <description>MATH register, most-significant 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0MTH2_LS</name>
          <description>DECO0 Math Register 2_LS</description>
          <addressOffset>0x80854</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATH_LS</name>
              <description>MATH register, least-significant 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0MTH3_MS</name>
          <description>DECO0 Math Register 3_MS</description>
          <addressOffset>0x80858</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATH_MS</name>
              <description>MATH register, most-significant 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0MTH3_LS</name>
          <description>DECO0 Math Register 3_LS</description>
          <addressOffset>0x8085C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MATH_LS</name>
              <description>MATH register, least-significant 32 bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0GTR0_0</name>
          <description>DECO0 Gather Table Register 0 Word 0</description>
          <addressOffset>0x80880</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS_POINTER</name>
              <description>most-significant bits of memory address pointed to by table entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0GTR0_1</name>
          <description>DECO0 Gather Table Register 0 Word 1</description>
          <addressOffset>0x80884</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS_POINTER</name>
              <description>This field holds the least-significant 32 bits of the memory address to which this table entry points</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0GTR0_2</name>
          <description>DECO0 Gather Table Register 0 Word 2</description>
          <addressOffset>0x80888</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Length</name>
              <description>This field specifies how many bytes of data (for Gather Tables) or available space (for Scatter Tables) are located at the address pointed to by the Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F</name>
              <description>Final Bit. If set, this is the last entry of this Scatter/Gather Table.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LAST</name>
                  <description>This is not the last entry of the SGT.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST</name>
                  <description>This is the last entry of the SGT.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>E</name>
              <description>Extension bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEM_BUFFER</name>
                  <description>Address Pointer points to a memory buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SGTE</name>
                  <description>Address Pointer points to a Scatter/Gather Table Entry.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>D0GTR0_3</name>
          <description>DECO0 Gather Table Register 0 Word 3</description>
          <addressOffset>0x8088C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Offset</name>
              <description>Offset (measured in bytes) into memory where significant data is to be found</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0STR0_0</name>
          <description>DECO0 Scatter Table Register 0 Word 0</description>
          <addressOffset>0x80900</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS_POINTER</name>
              <description>most-significant bits of memory address pointed to by table entry</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0STR0_1</name>
          <description>DECO0 Scatter Table Register 0 Word 1</description>
          <addressOffset>0x80904</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDRESS_POINTER</name>
              <description>This field holds the least-significant 32 bits of the memory address to which this table entry points</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0STR0_2</name>
          <description>DECO0 Scatter Table Register 0 Word 2</description>
          <addressOffset>0x80908</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Length</name>
              <description>This field specifies how many bytes of data (for Gather Tables) or available space (for Scatter Tables) are located at the address pointed to by the Address Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>30</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>F</name>
              <description>Final Bit. If set, this is the last entry of this Scatter/Gather Table.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_LAST</name>
                  <description>This is not the last entry of the SGT.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST</name>
                  <description>This is the last entry of the SGT.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>E</name>
              <description>Extension bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEM_BUFFER</name>
                  <description>Address Pointer points to a memory buffer.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SGTE</name>
                  <description>Address Pointer points to a Scatter/Gather Table Entry.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>D0STR0_3</name>
          <description>DECO0 Scatter Table Register 0 Word 3</description>
          <addressOffset>0x8090C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Offset</name>
              <description>Offset (measured in bytes) into memory where significant data is to be found</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB0</name>
          <description>DECO0 Descriptor Buffer Word 0</description>
          <addressOffset>0x80A00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB1</name>
          <description>DECO0 Descriptor Buffer Word 1</description>
          <addressOffset>0x80A04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB2</name>
          <description>DECO0 Descriptor Buffer Word 2</description>
          <addressOffset>0x80A08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB3</name>
          <description>DECO0 Descriptor Buffer Word 3</description>
          <addressOffset>0x80A0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB4</name>
          <description>DECO0 Descriptor Buffer Word 4</description>
          <addressOffset>0x80A10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DESB5</name>
          <description>DECO0 Descriptor Buffer Word 5</description>
          <addressOffset>0x80A14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DESBW</name>
              <description>Descriptor Buffer Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
