nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>D0DDR</name>
          <description>DECO0 Debug DECO Register</description>
          <addressOffset>0x80E04</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CT</name>
              <description>Checking Trusted</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_CHECKING</name>
                  <description>This DECO is NOTcurrently generating the signature of a Trusted Descriptor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHECKING</name>
                  <description>This DECO is currently generating the signature of a Trusted Descriptor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BRB</name>
              <description>Burster Read Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_BUSY</name>
                  <description>The READ machine in the Burster is not busy.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>The READ machine in the Burster is busy.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BWB</name>
              <description>Burster Write Busy</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_BUSY</name>
                  <description>The WRITE machine in the Burster is not busy.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>The WRITE machine in the Burster is busy.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NC</name>
              <description>No Command</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CMD_EXEC</name>
                  <description>This DECO is currently executing a command.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_CMD_EXEC</name>
                  <description>This DECO is not currently executing a command.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSA</name>
              <description>Command Stage Aux</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_STAGE</name>
              <description>Command Stage</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_INDEX</name>
              <description>Command Index</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NLJ</name>
              <description>Took Non-local JUMP</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ORIGINAL_DESC</name>
                  <description>The original job descriptor running in this DECO has not caused another job descriptor to be executed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NON_LOCAL_DECR</name>
                  <description>The original job descriptor running in this DECO has caused another job descriptor to be executed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PTCL_RUN</name>
              <description>Protocol running. PTCL_RUN=1 indicates that a protocol is running in this DECO.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOT_RUNNING</name>
                  <description>No protocol is running in this DECO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING</name>
                  <description>A protocol is running in this DECO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDB_STALL</name>
              <description>PDB Stall State</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PDB_WB_ST</name>
              <description>PDB Writeback State. Lower two bits of the state machine that tracks the state of PDB writebacks.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DECO_STATE</name>
              <description>DECO State. The current state of DECO's main state machine.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NSEQLSEL</name>
              <description>Non-SEQ DID Select. This indicates which type of DID is being used for Non-SEQ commands:</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_DID</name>
                  <description>SEQ DID</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEQ_DID</name>
                  <description>Non-SEQ DID</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUSTED_DID</name>
                  <description>Trusted DID</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEQLSEL</name>
              <description>SEQ DID Select. This indicates which type of DID is being used for SEQ commands:</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SEQ_DID</name>
                  <description>SEQ DID</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONSEQ_DID</name>
                  <description>Non-SEQ DID</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRUSTED_DID</name>
                  <description>Trusted DID</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRCT</name>
              <description>DMA Transaction Count</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SD</name>
              <description>Shared Descriptor</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SD_RCVD</name>
                  <description>This DECO has not received a shared descriptor from another DECO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SD_RCVD</name>
                  <description>This DECO has received a shared descriptor from another DECO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_DESC_RUNNING</name>
                  <description>No descriptor is currently running in this DECO.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DESC_RUNNING</name>
                  <description>There is currently a descriptor running in this DECO.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DJP</name>
          <description>DECO0 Debug Job Pointer</description>
          <addressOffset>0x80E08</addressOffset>
          <size>64</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>JDPTR</name>
              <description>Job Descriptor Pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>36</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0SDP</name>
          <description>DECO0 Debug Shared Pointer</description>
          <addressOffset>0x80E10</addressOffset>
          <size>64</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFFFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDPTR</name>
              <description>Shared Descriptor Pointer.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>36</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DDR_MS</name>
          <description>DECO0 Debug DID, most-significant half</description>
          <addressOffset>0x80E18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRIM_DID</name>
              <description>Primary DID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PRIM_TZ</name>
              <description>Primary TZ</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONSECUREWORLD</name>
                  <description>TrustZone NonSecureWorld</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECUREWORLD</name>
                  <description>TrustZone SecureWorld</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRIM_ICID</name>
              <description>Primary ICID</description>
              <bitOffset>5</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_DID</name>
              <description>Output DID</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_ICID</name>
              <description>Output ICID</description>
              <bitOffset>21</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0DDR_LS</name>
          <description>DECO0 Debug DID, least-significant half</description>
          <addressOffset>0x80E1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OUT_DID</name>
              <description>DECO Output Domain Identifier</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OUT_ICID</name>
              <description>Output ICID</description>
              <bitOffset>19</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOL0</name>
          <description>Sequence Output Length Register</description>
          <addressOffset>0x80E20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SOL</name>
              <description>Output Sequence Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VSOL0</name>
          <description>Variable Sequence Output Length Register</description>
          <addressOffset>0x80E24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSOL</name>
              <description>This value is used in variable-length output data sequences</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SIL0</name>
          <description>Sequence Input Length Register</description>
          <addressOffset>0x80E28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIL</name>
              <description>This value is used in input data sequences</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VSIL0</name>
          <description>Variable Sequence Input Length Register</description>
          <addressOffset>0x80E2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSIL</name>
              <description>This value is used in variable-length input data sequences</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>D0POVRD</name>
          <description>Protocol Override Register</description>
          <addressOffset>0x80E30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPOVRD</name>
              <description>DPOVRD can be used as a general purpose math register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UVSOL0</name>
          <description>Variable Sequence Output Length Register; Upper 32 bits</description>
          <addressOffset>0x80E34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UVSOL</name>
              <description>This value is used in variable-length output data sequences</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UVSIL0</name>
          <description>Variable Sequence Input Length Register; Upper 32 bits</description>
          <addressOffset>0x80E38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UVSIL</name>
              <description>This value is used in variable-length input data sequences</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
