nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>CSICR18</name>
          <description>CSI Control Register 18</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2D000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DEINTERLACE_EN</name>
              <description>This bit is used to select the output method When input is standard CCIR656 video.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DEINTERLACE_EN_0</name>
                  <description>Deinterlace disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEINTERLACE_EN_1</name>
                  <description>Deinterlace enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PARALLEL24_EN</name>
              <description>When input is parallel rgb888/yuv444 24bit, this bit can be enabled.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASEADDR_SWITCH_EN</name>
              <description>When this bit is enabled, CSI DMA will switch the base address according to BASEADDR_SWITCH_SEL rather than atomically by DMA completed</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BASEADDR_SWITCH_SEL</name>
              <description>CSI 2 base addresses switching method. When using this bit, BASEADDR_SWITCH_EN is 1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BASEADDR_SWITCH_SEL_0</name>
                  <description>Switching base address at the edge of the vsync</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BASEADDR_SWITCH_SEL_1</name>
                  <description>Switching base address at the edge of the first data of each frame</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIELD0_DONE_IE</name>
              <description>In interlace mode, fileld 0 means interrupt enabled.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIELD0_DONE_IE_0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIELD0_DONE_IE_1</name>
                  <description>Interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA_FIELD1_DONE_IE</name>
              <description>When in interlace mode, field 1 done interrupt enable.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA_FIELD1_DONE_IE_0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA_FIELD1_DONE_IE_1</name>
                  <description>Interrupt enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LAST_DMA_REQ_SEL</name>
              <description>Choosing the last DMA request condition.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LAST_DMA_REQ_SEL_0</name>
                  <description>fifo_full_level</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST_DMA_REQ_SEL_1</name>
                  <description>hburst_length</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BASEADDR_CHANGE_ERROR_IE</name>
              <description>Base address change error interrupt enable signal.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RGB888A_FORMAT_SEL</name>
              <description>Output is 32-bit format.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RGB888A_FORMAT_SEL_0</name>
                  <description>{8'h0, data[23:0]}</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RGB888A_FORMAT_SEL_1</name>
                  <description>{data[23:0], 8'h0}</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AHB_HPROT</name>
              <description>Hprot value in AHB bus protocol.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASK_OPTION</name>
              <description>These bits used to choose the method to mask the CSI input.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK_OPTION_0</name>
                  <description>Writing to memory from first completely frame, when using this option, the CSI_ENABLE should be 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_OPTION_1</name>
                  <description>Writing to memory when CSI_ENABLE is 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_OPTION_2</name>
                  <description>Writing to memory from second completely frame, when using this option, the CSI_ENABLE should be 1.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASK_OPTION_3</name>
                  <description>Writing to memory when data comes in, not matter the CSI_ENABLE is 1 or 0.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSI_ENABLE</name>
              <description>CSI global enable signal</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSICR19</name>
          <description>CSI Control Register 19</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DMA_RFIFO_HIGHEST_FIFO_LEVEL</name>
              <description>This byte stores the highest FIFO level achieved by CSI FIFO timely and will be clear by writing 8'ff to it</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSICR20</name>
          <description>CSI Control Register 20</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THRESHOLD</name>
              <description>THRESHOLD used for binary function. When data value &gt; THRESHOLD, output will be 1 Else will be 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BINARY_EN</name>
              <description>no description available</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BINARY_EN_0</name>
                  <description>Output is Y8 format(8 bits each pixel)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BINARY_EN_1</name>
                  <description>Output is Y1 format(1 bit each pixel)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QR_DATA_FORMAT</name>
              <description>no description available</description>
              <bitOffset>9</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QR_DATA_FORMAT_0</name>
                  <description>YU YV one cycle per 1 pixel input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QR_DATA_FORMAT_1</name>
                  <description>UY VY one cycle per1 pixel input</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QR_DATA_FORMAT_2</name>
                  <description>Y U Y V two cycles per 1 pixel input</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QR_DATA_FORMAT_3</name>
                  <description>U Y V Y two cycles per 1 pixel input</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QR_DATA_FORMAT_4</name>
                  <description>YUV one cycle per 1 pixel input</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QR_DATA_FORMAT_5</name>
                  <description>Y U V three cycles per 1 pixel input</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BIG_END</name>
              <description>no description available</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIG_END_0</name>
                  <description>The latest data will put to the lowest position when store to memory.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIG_END_1</name>
                  <description>The latest data will put to the highest position when store to memory.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>_10BIT_NEW_EN</name>
              <description>no description available</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>10BIT_NEW_EN_0</name>
                  <description>When input 8bits data, it will use the data[9:2]</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10BIT_NEW_EN_1</name>
                  <description>When input 10bits data, it will use the data[7:0]</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HISTOGRAM_EN</name>
              <description>Histogram enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HISTOGRAM_EN_0</name>
                  <description>Histogram disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HISTOGRAM_EN_1</name>
                  <description>Histogram enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>QRCODE_EN</name>
              <description>QRcode enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>QRCODE_EN_0</name>
                  <description>Normal mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>QRCODE_EN_1</name>
                  <description>grcode mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>256</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>21,22,23,24,25,26,27,28,29,30,31,32,33,34,35,36,37,38,39,40,41,42,43,44,45,46,47,48,49,50,51,52,53,54,55,56,57,58,59,60,61,62,63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82,83,84,85,86,87,88,89,90,91,92,93,94,95,96,97,98,99,100,101,102,103,104,105,106,107,108,109,110,111,112,113,114,115,116,117,118,119,120,121,122,123,124,125,126,127,128,129,130,131,132,133,134,135,136,137,138,139,140,141,142,143,144,145,146,147,148,149,150,151,152,153,154,155,156,157,158,159,160,161,162,163,164,165,166,167,168,169,170,171,172,173,174,175,176,177,178,179,180,181,182,183,184,185,186,187,188,189,190,191,192,193,194,195,196,197,198,199,200,201,202,203,204,205,206,207,208,209,210,211,212,213,214,215,216,217,218,219,220,221,222,223,224,225,226,227,228,229,230,231,232,233,234,235,236,237,238,239,240,241,242,243,244,245,246,247,248,249,250,251,252,253,254,255,256,257,258,259,260,261,262,263,264,265,266,267,268,269,270,271,272,273,274,275,276</dimIndex>
          <name>CSICR%s</name>
          <description>CSI Control Register n</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIXEL_COUNTERS</name>
              <description>Number of pixels equals: 0 (CSICR21) 1 (CSICR22) . . 255 (CSICR276)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
