nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>CTRL_TOG</name>
          <description>LCDIF General Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RUN</name>
              <description>When this bit is set by software, the LCDIF will begin transferring data between the SoC and the display</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_FORMAT_24_BIT</name>
              <description>Used only when WORD_LENGTH = 3, i</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALL_24_BITS_VALID</name>
                  <description>Data input to the block is in 24 bpp format, such that all RGB 888 data is contained in 24 bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DROP_UPPER_2_BITS_PER_BYTE</name>
                  <description>Data input to the block is actually RGB 18 bpp, but there is 1 color per byte, hence the upper 2 bits in each byte do not contain any useful data, and should be dropped.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_FORMAT_18_BIT</name>
              <description>Used only when WORD_LENGTH = 2, i.e. 18-bit.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOWER_18_BITS_VALID</name>
                  <description>Data input to the block is in 18 bpp format, such that lower 18 bits contain RGB 666 and upper 14 bits do not contain any useful data.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPPER_18_BITS_VALID</name>
                  <description>Data input to the block is in 18 bpp format, such that upper 18 bits contain RGB 666 and lower 14 bits do not contain any useful data.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATA_FORMAT_16_BIT</name>
              <description>When this bit is 1 and WORD_LENGTH = 0, it implies that the 16-bit data is in ARGB555 format</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MASTER</name>
              <description>Set this bit to make the LCDIF act as a bus master</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_PXP_HANDSHAKE</name>
              <description>If this bit is set and LCDIF_MASTER bit is set, the LCDIF will act as bus master and the handshake mechanism between LCDIF and PXP will be turned on</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WORD_LENGTH</name>
              <description>Input data format.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16_BIT</name>
                  <description>Input data is 16 bits per pixel.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_BIT</name>
                  <description>Input data is 8 bits wide.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18_BIT</name>
                  <description>Input data is 18 bits per pixel.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24_BIT</name>
                  <description>Input data is 24 bits per pixel.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCD_DATABUS_WIDTH</name>
              <description>LCD Data bus transfer width.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16_BIT</name>
                  <description>16-bit data bus mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_BIT</name>
                  <description>8-bit data bus mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>18_BIT</name>
                  <description>18-bit data bus mode.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24_BIT</name>
                  <description>24-bit data bus mode.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSC_DATA_SWIZZLE</name>
              <description>This field specifies how to swap the bytes after the data has been converted into an internal representation of 24 bits per pixel and before it is transmitted over the LCD interface bus</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SWAP</name>
                  <description>No byte swapping.(Little endian)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIG_ENDIAN_SWAP</name>
                  <description>Big Endian swap (swap bytes 0,3 and 1,2).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWD_SWAP</name>
                  <description>Swap half-words.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWD_BYTE_SWAP</name>
                  <description>Swap bytes within each half-word.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INPUT_DATA_SWIZZLE</name>
              <description>This field specifies how to swap the bytes fetched by the bus master interface</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SWAP</name>
                  <description>No byte swapping.(Little endian)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIG_ENDIAN_SWAP</name>
                  <description>Big Endian swap (swap bytes 0,3 and 1,2).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWD_SWAP</name>
                  <description>Swap half-words.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HWD_BYTE_SWAP</name>
                  <description>Swap bytes within each half-word.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOTCLK_MODE</name>
              <description>Set this bit to 1 to make the hardware go into the DOTCLK mode, i</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VSYNC_MODE</name>
              <description>Setting this bit to 1 will make the LCDIF hardware go into VSYNC mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_COUNT</name>
              <description>When this bit is 0, it means that LCDIF will stop the block operation and turn off the RUN bit after the amount of data indicated by the LCDIF_TRANSFER_COUNT register has been transferred out</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SHIFT_NUM_BITS</name>
              <description>The data to be transmitted is shifted left or right by this number of bits.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA_SHIFT_DIR</name>
              <description>Use this bit to determine the direction of shift of transmit data.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TXDATA_SHIFT_LEFT</name>
                  <description>Data to be transmitted is shifted LEFT by SHIFT_NUM_BITS bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TXDATA_SHIFT_RIGHT</name>
                  <description>Data to be transmitted is shifted RIGHT by SHIFT_NUM_BITS bits.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WAIT_FOR_VSYNC_EDGE</name>
              <description>Setting this bit to 1 will make the hardware wait for the triggering VSYNC edge before starting write transfers to the LCD</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>This bit must be set to zero to enable normal operation of the LCDIF</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL1</name>
          <description>LCDIF General Control1 Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSYNC_EDGE_IRQ</name>
              <description>This bit is set to indicate that an interrupt is requested by the LCDIF block</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_REQUEST</name>
                  <description>No Interrupt Request Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <description>Interrupt Request Pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CUR_FRAME_DONE_IRQ</name>
              <description>This bit is set to indicate that an interrupt is requested by the LCDIF block</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_REQUEST</name>
                  <description>No Interrupt Request Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <description>Interrupt Request Pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UNDERFLOW_IRQ</name>
              <description>This bit is set to indicate that an interrupt is requested by the LCDIF block</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_REQUEST</name>
                  <description>No Interrupt Request Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <description>Interrupt Request Pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERFLOW_IRQ</name>
              <description>This bit is set to indicate that an interrupt is requested by the LCDIF block</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_REQUEST</name>
                  <description>No Interrupt Request Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <description>Interrupt Request Pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VSYNC_EDGE_IRQ_EN</name>
              <description>This bit is set to enable an interrupt every time the hardware encounters the leading VSYNC edge in the VSYNC and DOTCLK modes, or the beginning of every field in DVI mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CUR_FRAME_DONE_IRQ_EN</name>
              <description>This bit is set to 1 enable an interrupt every time the hardware enters in the vertical blanking state</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDERFLOW_IRQ_EN</name>
              <description>This bit is set to enable an underflow interrupt in the TXFIFO in the write mode.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OVERFLOW_IRQ_EN</name>
              <description>This bit is set to enable an overflow interrupt in the TXFIFO in the write mode.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYTE_PACKING_FORMAT</name>
              <description>This bitfield is used to show which data bytes in a 32-bit word are valid</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ_ON_ALTERNATE_FIELDS</name>
              <description>If this bit is set, the LCDIF block will assert the cur_frame_done interrupt only on alternate fields, otherwise it will issue the interrupt on both odd and even field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_CLEAR</name>
              <description>Set this bit to clear all the data in the latency FIFO (LFIFO), TXFIFO and the RXFIFO.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>START_INTERLACE_FROM_SECOND_FIELD</name>
              <description>The default is to grab the odd lines first and then the even lines</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INTERLACE_FIELDS</name>
              <description>Set this bit if it is required that the LCDIF block fetches odd lines in one field and even lines in the other field</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RECOVER_ON_UNDERFLOW</name>
              <description>Set this bit to enable the LCDIF block to recover in the next field/frame if there was an underflow in the current field/frame</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BM_ERROR_IRQ</name>
              <description>This bit is set to indicate that an interrupt is requested by the LCDIF block</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_REQUEST</name>
                  <description>No Interrupt Request Pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <description>Interrupt Request Pending.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BM_ERROR_IRQ_EN</name>
              <description>This bit is set to enable bus master error interrupt in the LCDIF master mode.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS_OUT_SELECT</name>
              <description>This bit is CS0/CS1 valid select signals</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IMAGE_DATA_SELECT</name>
              <description>Command Mode MIPI image data select bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
