nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>INT_STATUS_D0</name>
          <description>Interrupt Status Register for domain 0</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSYNC</name>
              <description>Interrupt flag to indicate that the vertical synchronization phase(The beginning of a frame).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>UNDERRUN</name>
              <description>Interrupt flag to indicate the output buffer underrun condition.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VS_BLANK</name>
              <description>Interrupt flag to indicate vertical blanking period.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FRAME_COMP</name>
              <description>Indicates the current frame being processed has finished.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>WR_ERR</name>
              <description>Indicates a write error on the axi interface.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DMA_ERR</name>
              <description>Interrupt flag to indicate that which PLANE has Read Error on the AXI interface.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DMA_DONE</name>
              <description>Interrupt flag to indicate that which PLANE has fetched the last pixel from memory.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FIFO_EMPTY</name>
              <description>Interrupt flag to indicate that which FIFO in the pixel blending underflowed.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENABLE_D0</name>
          <description>Interrupt Enable Register for domain 0</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSYNC_EN</name>
              <description>Enable Interrupt flag to indicate that the vertical synchronization phase(The beginning of a frame).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDERRUN_EN</name>
              <description>Enable Interrupt flag to indicate the output buffer underrun condition.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BLANK_EN</name>
              <description>Enable Interrupt flag to indicate vertical blanking period.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_COMP_EN</name>
              <description>Write error IRQ enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_ERR_EN</name>
              <description>Write error IRQ enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_ERR_EN</name>
              <description>Enable Interrupt flag to indicate that which PLANE has Read Error on the AXI interface.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_DONE_EN</name>
              <description>Enable Interrupt flag to indicate that which PLANE has fetched the last pixel from memory.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_EMPTY_EN</name>
              <description>Enable Interrupt flag to indicate that which FIFO in the pixel blending underflowed.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_STATUS_D1</name>
          <description>Interrupt Status Register for domain 1</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSYNC</name>
              <description>Interrupt flag to indicate that the vertical synchronization phase(The beginning of a frame).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>UNDERRUN</name>
              <description>Interrupt flag to indicate the output buffer underrun condition.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VS_BLANK</name>
              <description>Interrupt flag to indicate vertical blanking period.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FRAME_COMP</name>
              <description>Indicates the current frame being processed has finished.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>WR_ERR</name>
              <description>Indicates a write error on the axi interface.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DMA_ERR</name>
              <description>Interrupt flag to indicate that which PLANE has Read Error on the AXI interface.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DMA_DONE</name>
              <description>Interrupt flag to indicate that which PLANE has fetched the last pixel from memory.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>FIFO_EMPTY</name>
              <description>Interrupt flag to indicate that which FIFO in the pixel blending underflowed.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INT_ENABLE_D1</name>
          <description>Interrupt Enable Register for domain 1</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VSYNC_EN</name>
              <description>Enable Interrupt flag to indicate that the vertical synchronization phase(The beginning of a frame).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNDERRUN_EN</name>
              <description>Enable Interrupt flag to indicate the output buffer underrun condition.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VS_BLANK_EN</name>
              <description>Enable Interrupt flag to indicate vertical blanking period.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRAME_COMP_EN</name>
              <description>Write error IRQ enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WR_ERR_EN</name>
              <description>Write error IRQ enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_ERR_EN</name>
              <description>Enable Interrupt flag to indicate that which PLANE has Read Error on the AXI interface.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA_DONE_EN</name>
              <description>Enable Interrupt flag to indicate that which PLANE has fetched the last pixel from memory.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_EMPTY_EN</name>
              <description>Enable Interrupt flag to indicate that which FIFO in the pixel blending underflowed.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDI_PARA</name>
          <description>Parallel Data Interface Parameter Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INV_PDI_HS</name>
              <description>Polarity of PDI input HSYNC.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV_PDI_HS_0</name>
                  <description>HSYNC is active HIGH</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_PDI_HS_1</name>
                  <description>HSYNC is active LOW</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV_PDI_VS</name>
              <description>Polarity of PDI input VSYNC.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV_PDI_VS_0</name>
                  <description>VSYNC is active HIGH</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_PDI_VS_1</name>
                  <description>VSYNC is active LOW</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV_PDI_DE</name>
              <description>Polarity of PDI input Data Enable.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV_PDI_DE_0</name>
                  <description>Data enable is active HIGH</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_PDI_DE_1</name>
                  <description>Data enable is active LOW</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INV_PDI_PXCK</name>
              <description>Polarity of PDI input Pixel Clock.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INV_PDI_PXCK_0</name>
                  <description>Samples data on the falling edge</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV_PDI_PXCK_1</name>
                  <description>Samples data on the rising edge</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODE</name>
              <description>The PDI mode for input data format</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODE_0</name>
                  <description>32 bpp (ARGB8888)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_1</name>
                  <description>24 bpp (RGB888)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_2</name>
                  <description>24 bpp (RGB666)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_3</name>
                  <description>16 bpp (RGB565)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_4</name>
                  <description>16 bpp (RGB444)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_5</name>
                  <description>16 bpp (RGB555)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODE_6</name>
                  <description>16 bpp (YCbCr422)</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PXL_CNT</name>
              <description>Pixels count of LCD Hsync output for the Pass_Through MODE.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDI_SEL</name>
              <description>PDI selected on LCDIF plane number.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_SEL_0</name>
                  <description>PDI selected on LCDIF plane 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_SEL_1</name>
                  <description>PDI selected on LCDIF plane 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PDI_EN</name>
              <description>Enable PDI input data to LCDIF display.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PDI_EN_0</name>
                  <description>Disable PDI input data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PDI_EN_1</name>
                  <description>Enable PDI input data</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_CTRL</name>
          <description>Write Control Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7C0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable / Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REPEAT</name>
              <description>Repeat feature</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BPP</name>
              <description>Bits per pixel</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P_FREQ</name>
              <description>Payload frequency</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFO_SIZE</name>
              <description>Size of FIFO in design</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WR_CTRL_SET</name>
          <description>Write Control Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7C0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable / Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>REPEAT</name>
              <description>Repeat feature</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>BPP</name>
              <description>Bits per pixel</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>P_FREQ</name>
              <description>Payload frequency</description>
              <bitOffset>10</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>FIFO_SIZE</name>
              <description>Size of FIFO in design</description>
              <bitOffset>18</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
