nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>CTRLDESCL7_5</name>
          <description>Control Descriptor Layer 5 Register</description>
          <addressOffset>0x3D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AB_MODE</name>
              <description>Alpha Blending Mode.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AB_MODE_0</name>
                  <description>No alpha Blending (The SAFETY_EN bit need set to 1)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AB_MODE_1</name>
                  <description>Blend with global ALPHA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AB_MODE_2</name>
                  <description>Blend with embedded ALPHA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AB_MODE_3</name>
                  <description>Blend with PoterDuff enable</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PD_FACTOR_MODE</name>
              <description>PoterDuff factor mode.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PD_FACTOR_MODE_0</name>
                  <description>Using 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_FACTOR_MODE_1</name>
                  <description>Using 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_FACTOR_MODE_2</name>
                  <description>Using straight alpha.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_FACTOR_MODE_3</name>
                  <description>Using inverse alpha.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PD_GLOBAL_ALPHA_MODE</name>
              <description>PoterDuff global alpha mode.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PD_GLOBAL_ALPHA_MODE_0</name>
                  <description>Using global alpha.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_GLOBAL_ALPHA_MODE_1</name>
                  <description>Using local alpha.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_GLOBAL_ALPHA_MODE_2</name>
                  <description>Using scaled alpha.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_GLOBAL_ALPHA_MODE_3</name>
                  <description>Using scaled alpha.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PD_ALPHA_MODE</name>
              <description>PoterDuff alpha mode.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PD_ALPHA_MODE_0</name>
                  <description>Straight mode for PorterDuff alpha.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_ALPHA_MODE_1</name>
                  <description>Inversed mode for PorterDuff alpha.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PD_COLOR_MODE</name>
              <description>PoterDuff alpha mode.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PD_COLOR_MODE_0</name>
                  <description>Straight mode for PorterDuff color.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PD_COLOR_MODE_1</name>
                  <description>Inversed mode for PorterDuff color.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>YUV_FORMAT</name>
              <description>The YUV422 input format selection.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>YUV_FORMAT_0</name>
                  <description>The YVYU422 8bit sequence is U1,Y1,V1,Y2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV_FORMAT_1</name>
                  <description>The YVYU422 8bit sequence is V1,Y1,U1,Y2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV_FORMAT_2</name>
                  <description>The YVYU422 8bit sequence is Y1,U1,Y2,V1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YUV_FORMAT_3</name>
                  <description>The YVYU422 8bit sequence is Y1,V1,Y2,U1</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GLOBAL_ALPHA</name>
              <description>Global Alpha.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BPP</name>
              <description>Layer encoding format (bit per pixel)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BPP_0</name>
                  <description>1 bpp</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP_1</name>
                  <description>2 bpp</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP_2</name>
                  <description>4 bpp</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP_3</name>
                  <description>8 bpp</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP_4</name>
                  <description>16 bpp (RGB565)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP_5</name>
                  <description>16 bpp (ARGB1555)</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP_6</name>
                  <description>16 bpp (ARGB4444)</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP_7</name>
                  <description>YCbCr422 (Only layer 0/1 can support this format)</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP_8</name>
                  <description>24 bpp (RGB888)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP_9</name>
                  <description>32 bpp (ARGB8888)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BPP_10</name>
                  <description>32 bpp (ABGR8888)</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAFETY_EN</name>
              <description>Safety Mode Enable Bit.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SAFETY_EN_0</name>
                  <description>Safety Mode is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SAFETY_EN_1</name>
                  <description>Safety Mode is enabled for this layer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHADOW_LOAD_EN</name>
              <description>Shadow Load Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN</name>
              <description>Enable the layer for DMA.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_0</name>
                  <description>OFF</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_1</name>
                  <description>ON</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLDESCL7_6</name>
          <description>Control Descriptor Layer 6 Register</description>
          <addressOffset>0x3D4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FGn_BCOLOR</name>
              <description>Background color to use when this layer is not active.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLUT_LOAD</name>
          <description>LCDIF CLUT load Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CLUT_UPDATE_EN</name>
              <description>CLUT Update Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEL_CLUT_NUM</name>
              <description>Selected CLUT Number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
