nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>PXP</name>
      <description>PXP v2.0 Register Reference Index</description>
      <groupName>PXP</groupName>
      <prependToName>PXP_</prependToName>
      <baseAddress>0x40814000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x444</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>PXP</name>
        <value>57</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRL</name>
          <description>Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enables PXP operation with specified parameters</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ_ENABLE</name>
              <description>Interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXT_IRQ_ENABLE</name>
              <description>Next command interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_LCD_HANDSHAKE</name>
              <description>Enable handshake with LCD controller</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD0</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROTATE</name>
              <description>Indicates the clockwise rotation to be applied at the output buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROT_0</name>
                  <description>ROT_0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROT_90</name>
                  <description>ROT_90</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROT_180</name>
                  <description>ROT_180</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROT_270</name>
                  <description>ROT_270</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFLIP</name>
              <description>Indicates that the output buffer should be flipped horizontally (effect applied before rotation).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VFLIP</name>
              <description>Indicates that the output buffer should be flipped vertically (effect applied before rotation).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD1</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROT_POS</name>
              <description>This bit controls where rotation will occur in the PXP datapath</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLOCK_SIZE</name>
              <description>Select the block size to process.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8X8</name>
                  <description>Process 8x8 pixel blocks.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16X16</name>
                  <description>Process 16x16 pixel blocks.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD3</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EN_REPEAT</name>
              <description>Enable the PXP to run continuously</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD4</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Set this bit to zero to enable normal PXP operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_SET</name>
          <description>Control Register 0</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enables PXP operation with specified parameters</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ_ENABLE</name>
              <description>Interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXT_IRQ_ENABLE</name>
              <description>Next command interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_LCD_HANDSHAKE</name>
              <description>Enable handshake with LCD controller</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD0</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROTATE</name>
              <description>Indicates the clockwise rotation to be applied at the output buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROT_0</name>
                  <description>ROT_0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROT_90</name>
                  <description>ROT_90</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROT_180</name>
                  <description>ROT_180</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROT_270</name>
                  <description>ROT_270</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFLIP</name>
              <description>Indicates that the output buffer should be flipped horizontally (effect applied before rotation).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VFLIP</name>
              <description>Indicates that the output buffer should be flipped vertically (effect applied before rotation).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD1</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROT_POS</name>
              <description>This bit controls where rotation will occur in the PXP datapath</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLOCK_SIZE</name>
              <description>Select the block size to process.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8X8</name>
                  <description>Process 8x8 pixel blocks.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16X16</name>
                  <description>Process 16x16 pixel blocks.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD3</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EN_REPEAT</name>
              <description>Enable the PXP to run continuously</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD4</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Set this bit to zero to enable normal PXP operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_CLR</name>
          <description>Control Register 0</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xC0000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enables PXP operation with specified parameters</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRQ_ENABLE</name>
              <description>Interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEXT_IRQ_ENABLE</name>
              <description>Next command interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLE_LCD_HANDSHAKE</name>
              <description>Enable handshake with LCD controller</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD0</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROTATE</name>
              <description>Indicates the clockwise rotation to be applied at the output buffer</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROT_0</name>
                  <description>ROT_0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROT_90</name>
                  <description>ROT_90</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROT_180</name>
                  <description>ROT_180</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROT_270</name>
                  <description>ROT_270</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFLIP</name>
              <description>Indicates that the output buffer should be flipped horizontally (effect applied before rotation).</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VFLIP</name>
              <description>Indicates that the output buffer should be flipped vertically (effect applied before rotation).</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD1</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROT_POS</name>
              <description>This bit controls where rotation will occur in the PXP datapath</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLOCK_SIZE</name>
              <description>Select the block size to process.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8X8</name>
                  <description>Process 8x8 pixel blocks.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16X16</name>
                  <description>Process 16x16 pixel blocks.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RSVD3</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EN_REPEAT</name>
              <description>Enable the PXP to run continuously</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RSVD4</name>
              <description>Reserved, always set to zero.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLKGATE</name>
              <description>This bit must be set to zero for normal operation</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SFTRST</name>
              <description>Set this bit to zero to enable normal PXP operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
