nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>PLM_CTRL_TOG</name>
          <description>PLM Control register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>VSYNC_OVERRIDE</name>
              <description>VSYNC override</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>HSYNC_OVERRIDE</name>
              <description>HSYNC override</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>VALID_OVERRIDE</name>
              <description>valid override</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>POLARITY</name>
              <description>Polarity of HYSNC/VSYNC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>YUV420_CTRL</name>
          <description>YUV420_CTRL</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FST_LN_DATA_TYPE</name>
              <description>YUV420_first_line_data_type 0: odd (reset value) 1: even</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>YUV420_CTRL_SET</name>
          <description>YUV420_CTRL</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FST_LN_DATA_TYPE</name>
              <description>YUV420_first_line_data_type 0: odd (reset value) 1: even</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>YUV420_CTRL_CLR</name>
          <description>YUV420_CTRL</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FST_LN_DATA_TYPE</name>
              <description>YUV420_first_line_data_type 0: odd (reset value) 1: even</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>YUV420_CTRL_TOG</name>
          <description>YUV420_CTRL</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FST_LN_DATA_TYPE</name>
              <description>YUV420_first_line_data_type 0: odd (reset value) 1: even</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STREAM_FENCING_STAT</name>
          <description>STREAM_FENCING_STAT register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VC0_FENCED</name>
              <description>VC0_FENCED status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VC1_FENCED</name>
              <description>VC1_FENCED status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VC2_FENCED</name>
              <description>VC2_FENCED status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VC3_FENCED</name>
              <description>VC3_FENCED status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STREAM_FENCING_STAT_SET</name>
          <description>STREAM_FENCING_STAT register</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VC0_FENCED</name>
              <description>VC0_FENCED status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>VC1_FENCED</name>
              <description>VC1_FENCED status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>VC2_FENCED</name>
              <description>VC2_FENCED status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>VC3_FENCED</name>
              <description>VC3_FENCED status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STREAM_FENCING_STAT_CLR</name>
          <description>STREAM_FENCING_STAT register</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VC0_FENCED</name>
              <description>VC0_FENCED status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VC1_FENCED</name>
              <description>VC1_FENCED status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VC2_FENCED</name>
              <description>VC2_FENCED status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>VC3_FENCED</name>
              <description>VC3_FENCED status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STREAM_FENCING_STAT_TOG</name>
          <description>STREAM_FENCING_STAT register</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VC0_FENCED</name>
              <description>VC0_FENCED status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>VC1_FENCED</name>
              <description>VC1_FENCED status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>VC2_FENCED</name>
              <description>VC2_FENCED status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>VC3_FENCED</name>
              <description>VC3_FENCED status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG_DT_DISABLE</name>
          <description>PRG Base Address Register</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_DT_DISABLE</name>
              <description>Data Type Disable YUV Image Data Types [0] YUV420_8BIT [1] YUV420_10BIT [2] LEGACY_YUV420_8BIT [3] reserved [4] YUV420_8BIT_CS [5] YUV420_10BIT_CS [6] YUV422_8BIT [7] YUV422_10BIT RGB Image Data Types [8] RGB444 [9] RGB555 [10] RGB565 [11] RGB666 [12] RGB888 [13] reserved [14] reserved [15] reserved Raw Image Data Types [16] RAW6 [17] RAW7 [18] RAW8 [19] RAW10 [20] RAW12 [21] RAW14 [22] reserved [23] reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG_DT_DISABLE_SET</name>
          <description>PRG Base Address Register</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_DT_DISABLE</name>
              <description>Data Type Disable YUV Image Data Types [0] YUV420_8BIT [1] YUV420_10BIT [2] LEGACY_YUV420_8BIT [3] reserved [4] YUV420_8BIT_CS [5] YUV420_10BIT_CS [6] YUV422_8BIT [7] YUV422_10BIT RGB Image Data Types [8] RGB444 [9] RGB555 [10] RGB565 [11] RGB666 [12] RGB888 [13] reserved [14] reserved [15] reserved Raw Image Data Types [16] RAW6 [17] RAW7 [18] RAW8 [19] RAW10 [20] RAW12 [21] RAW14 [22] reserved [23] reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG_DT_DISABLE_CLR</name>
          <description>PRG Base Address Register</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_DT_DISABLE</name>
              <description>Data Type Disable YUV Image Data Types [0] YUV420_8BIT [1] YUV420_10BIT [2] LEGACY_YUV420_8BIT [3] reserved [4] YUV420_8BIT_CS [5] YUV420_10BIT_CS [6] YUV422_8BIT [7] YUV422_10BIT RGB Image Data Types [8] RGB444 [9] RGB555 [10] RGB565 [11] RGB666 [12] RGB888 [13] reserved [14] reserved [15] reserved Raw Image Data Types [16] RAW6 [17] RAW7 [18] RAW8 [19] RAW10 [20] RAW12 [21] RAW14 [22] reserved [23] reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG_DT_DISABLE_TOG</name>
          <description>PRG Base Address Register</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CFG_DT_DISABLE</name>
              <description>Data Type Disable YUV Image Data Types [0] YUV420_8BIT [1] YUV420_10BIT [2] LEGACY_YUV420_8BIT [3] reserved [4] YUV420_8BIT_CS [5] YUV420_10BIT_CS [6] YUV422_8BIT [7] YUV422_10BIT RGB Image Data Types [8] RGB444 [9] RGB555 [10] RGB565 [11] RGB666 [12] RGB888 [13] reserved [14] reserved [15] reserved Raw Image Data Types [16] RAW6 [17] RAW7 [18] RAW8 [19] RAW10 [20] RAW12 [21] RAW14 [22] reserved [23] reserved</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VC_INTERLACED</name>
          <description>VC_INTERLACED</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VC0_INTERLACED</name>
              <description>VC0_INTERLACED</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VC1_INTERLACED</name>
              <description>VC1_INTERLACED</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VC2_INTERLACED</name>
              <description>VC2_INTERLACED</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VC3_INTERLACED</name>
              <description>VC3_INTERLACED</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIPI_DSI_CTRL</name>
          <description>MIPI DSI Control Register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPI_SD</name>
              <description>Shut Down - Control to shutdown display (type 4 only) 1'b1= Send shutdown command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DPI_CM</name>
              <description>Color Mode control. 1'b0== Normal Mode 1'b1== Low-color Mode ; from register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MIPI_DSI_CTRL_SET</name>
          <description>MIPI DSI Control Register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPI_SD</name>
              <description>Shut Down - Control to shutdown display (type 4 only) 1'b1= Send shutdown command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
            <field>
              <name>DPI_CM</name>
              <description>Color Mode control. 1'b0== Normal Mode 1'b1== Low-color Mode ; from register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToSet</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MIPI_DSI_CTRL_CLR</name>
          <description>MIPI DSI Control Register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPI_SD</name>
              <description>Shut Down - Control to shutdown display (type 4 only) 1'b1= Send shutdown command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>DPI_CM</name>
              <description>Color Mode control. 1'b0== Normal Mode 1'b1== Low-color Mode ; from register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MIPI_DSI_CTRL_TOG</name>
          <description>MIPI DSI Control Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DPI_SD</name>
              <description>Shut Down - Control to shutdown display (type 4 only) 1'b1= Send shutdown command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
            <field>
              <name>DPI_CM</name>
              <description>Color Mode control. 1'b0== Normal Mode 1'b1== Low-color Mode ; from register</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToToggle</modifiedWriteValues>
            </field>
          </fields>
        </register>
