nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>CM_SP_CTRL</name>
          <description>CM Set Point Control</description>
          <addressOffset>0x300</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP_RUN_EN</name>
              <description>Request a set point transition when this bit is set</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_SP_RUN</name>
              <description>The set point CPU want the system to transit to when CPU_SP_RUN_EN is set</description>
              <bitOffset>1</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_SP_SLEEP_EN</name>
              <description>Enable set point transition on next CPU platform sleep sequence</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_SP_SLEEP</name>
              <description>The set point CPU want the system to transit to on next CPU platform sleep sequence</description>
              <bitOffset>6</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_SP_WAKEUP_EN</name>
              <description>Enable set point transition on next CPU platform wakeup sequence</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_SP_WAKEUP</name>
              <description>The set point CPU want the system to transit to on next CPU platform wakeup sequence</description>
              <bitOffset>11</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CPU_SP_WAKEUP_SEL</name>
              <description>Select the set point transiton on the next CPU platform wakeup sequence</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPU_SP_WAKEUP_SEL_0</name>
                  <description>Request SP transition to CPU_SP_WAKEUP</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPU_SP_WAKEUP_SEL_1</name>
                  <description>Request SP transition to the set point when the sleep event happens, which is captured in CPU_SP_PREVIOUS</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP_STAT</name>
          <description>CM Set Point Status</description>
          <addressOffset>0x304</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP_CURRENT</name>
              <description>The current set point of the system</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_SP_PREVIOUS</name>
              <description>The previous set point of the system</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_SP_TARGET</name>
              <description>The requested set point from the CPU platform</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_SP_CHANGE_REQ</name>
              <description>The set point change request from the CPU platform</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_SP_SLEEP_BUSY</name>
              <description>Indicate busy on set point transition of sleep sequence</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_SP_WAKEUP_BUSY</name>
              <description>Indicate busy on set point transition of wakeup sequence</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPU_SP_SOFT_BUSY</name>
              <description>Indicate busy on set point transition of software trigger</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_RUN_MODE_MAPPING</name>
          <description>CM Run Mode Set Point Allowed</description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_RUN_MODE_MAPPING</name>
              <description>Defines which set point is allowed when CPU enters RUN mode. Each bit standards for 1 set point, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_WAIT_MODE_MAPPING</name>
          <description>CM Wait Mode Set Point Allowed</description>
          <addressOffset>0x314</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_WAIT_MODE_MAPPING</name>
              <description>Defines which set point is allowed when CPU enters WAIT mode. Each bit standards for 1 set point, locked by LOCK_CFG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_STOP_MODE_MAPPING</name>
          <description>CM Stop Mode Set Point Allowed</description>
          <addressOffset>0x318</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_STOP_MODE_MAPPING</name>
              <description>Defines which set point is allowed when CPU enters STOP mode. Each bit standards for 1 set point, locked by LOCK_CFG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SUSPEND_MODE_MAPPING</name>
          <description>CM Suspend Mode Set Point Allowed</description>
          <addressOffset>0x31C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SUSPEND_MODE_MAPPING</name>
              <description>Defines which set point is allowed when CPU enters SUSPEND mode. Each bit standards for 1 set point, locked by LOCK_CFG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP0_MAPPING</name>
          <description>CM Set Point 0 Mapping</description>
          <addressOffset>0x320</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP0_MAPPING</name>
              <description>Defines when SP0 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP1_MAPPING</name>
          <description>CM Set Point 1 Mapping</description>
          <addressOffset>0x324</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP1_MAPPING</name>
              <description>Defines when SP1 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP2_MAPPING</name>
          <description>CM Set Point 2 Mapping</description>
          <addressOffset>0x328</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP2_MAPPING</name>
              <description>Defines when SP2 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP3_MAPPING</name>
          <description>CM Set Point 3 Mapping</description>
          <addressOffset>0x32C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP3_MAPPING</name>
              <description>Defines when SP3 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP4_MAPPING</name>
          <description>CM Set Point 4 Mapping</description>
          <addressOffset>0x330</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP4_MAPPING</name>
              <description>Defines when SP4 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP5_MAPPING</name>
          <description>CM Set Point 5 Mapping</description>
          <addressOffset>0x334</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP5_MAPPING</name>
              <description>Defines when SP5 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP6_MAPPING</name>
          <description>CM Set Point 6 Mapping</description>
          <addressOffset>0x338</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP6_MAPPING</name>
              <description>Defines when SP6 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP7_MAPPING</name>
          <description>CM Set Point 7 Mapping</description>
          <addressOffset>0x33C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP7_MAPPING</name>
              <description>Defines when SP7 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP8_MAPPING</name>
          <description>CM Set Point 8 Mapping</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP8_MAPPING</name>
              <description>Defines when SP8 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP9_MAPPING</name>
          <description>CM Set Point 9 Mapping</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP9_MAPPING</name>
              <description>Defines when SP9 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP10_MAPPING</name>
          <description>CM Set Point 10 Mapping</description>
          <addressOffset>0x348</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP10_MAPPING</name>
              <description>Defines when SP10 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP11_MAPPING</name>
          <description>CM Set Point 11 Mapping</description>
          <addressOffset>0x34C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP11_MAPPING</name>
              <description>Defines when SP11 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP12_MAPPING</name>
          <description>CM Set Point 12 Mapping</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP12_MAPPING</name>
              <description>Defines when SP12 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP13_MAPPING</name>
          <description>CM Set Point 13 Mapping</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP13_MAPPING</name>
              <description>Defines when SP13 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP14_MAPPING</name>
          <description>CM Set Point 14 Mapping</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP14_MAPPING</name>
              <description>Defines when SP14 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_SP15_MAPPING</name>
          <description>CM Set Point 15 Mapping</description>
          <addressOffset>0x35C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPU_SP15_MAPPING</name>
              <description>Defines when SP15 is set as the CPU_SP_TARGET, which SP is allowed, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_STBY_CTRL</name>
          <description>CM standby control</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_WAIT</name>
              <description>Request the chip into standby mode when CPU entering WAIT mode, locked by LOCK_CFG field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_STOP</name>
              <description>Request the chip into standby mode when CPU entering STOP mode, locked by LOCK_CFG field.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_SUSPEND</name>
              <description>Request the chip into standby mode when CPU entering SUSPEND mode, locked by LOCK_CFG field.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_SLEEP_BUSY</name>
              <description>Indicate the CPU is busy entering standby mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBY_WAKEUP_BUSY</name>
              <description>Indicate the CPU is busy exiting standby mode.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CM_DEBUG</name>
          <description>CM debug</description>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PRETEND_SLEEP</name>
              <description>Write 1 to force CMC into sleep, used to debug GPC status, locked by LOCK_CFG field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
