nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPC_CPU_MODE_CTRL_0">
      <name>GPC_CPU_MODE_CTRL_1</name>
      <description>no description available</description>
      <groupName>GPC_CPU_MODE_CTRL</groupName>
      <baseAddress>0x40C00800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>GPC_SET_POINT_CTRL</name>
      <description>no description available</description>
      <groupName>GPC_SET_POINT_CTRL</groupName>
      <baseAddress>0x40C02000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x800</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SP_AUTHEN_CTRL</name>
          <description>SP Authentication Control</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USER</name>
              <description>Allow user mode access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONSECURE</name>
              <description>Allow non-secure mode access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_SETTING</name>
              <description>Lock NONSECURE and USER</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHITE_LIST</name>
              <description>Domain ID white list</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_LIST</name>
              <description>White list lock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_CFG</name>
              <description>Configuration lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_INT_CTRL</name>
          <description>SP Interrupt Control</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NO_ALLOWED_SP_INT_EN</name>
              <description>no_allowed_set_point interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NO_ALLOWED_SP_INT</name>
              <description>no_allowed_set_point interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_MISC</name>
          <description>SP Misc</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>SP_CPU_REQ</name>
          <description>CPU SP Request</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SP_REQ_CPU0</name>
              <description>set point requested by CPU0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_REQ_CPU1</name>
              <description>set point requested by CPU1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_REQ_CPU2</name>
              <description>set point requested by CPU2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_REQ_CPU3</name>
              <description>set point requested by CPU3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_ACCEPTED_CPU0</name>
              <description>CPU0 set point accepted by SP controller</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_ACCEPTED_CPU1</name>
              <description>CPU1 set point accepted by SP controller</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_ACCEPTED_CPU2</name>
              <description>CPU2 set point accepted by SP controller</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_ACCEPTED_CPU3</name>
              <description>CPU3 set point accepted by SP controller</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_SYS_STAT</name>
          <description>SP System Status</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SYS_SP_ALLOWED</name>
              <description>allowed set points by all current CPU set point requests</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_SP_TARGET</name>
              <description>the set point chosen as target set point</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_SP_CURRENT</name>
              <description>Current set point, only valid when not SP trans busy</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYS_SP_PREVIOUS</name>
              <description>Previous set point, only valid when not SP trans busy</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_TRANS_STAT</name>
          <description>SP Transition Status</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SEVERING_CPU</name>
              <description>Indicate the CPU which the SP controller is severing for its SP transfer request, each bit stands for a CPU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PENDING_CPU</name>
              <description>Indicate which CPUs are requesting SP transition and is not completly served, each bit stands for a CPU.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRANS_BUSY</name>
              <description>SP controller is busy on SP transition</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TRANS_FSM_STATE</name>
              <description>SP transition FSM status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_ROSC_CTRL</name>
          <description>SP ROSC Control</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SP_ALLOW_ROSC_OFF</name>
              <description>Allow shutting off the ROSC which is main clock source of GPC when system is in selected set point. Each bit represents a set point index.Locked by LOCK_CFG field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_REQ_PIN_STAT</name>
          <description>SP Request Pin Status</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSAR_SAVE_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_ssar_save_request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPCG_OFF_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_lpcg_off_request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GROUP_DN_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_group_down_request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROOT_DN_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_root_down_request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_OFF_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_oscpll_off_request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_ON_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_iso_on_request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RST_EARLY_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_reset_early_request</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PWR_OFF_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_power_off_request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BIAS_OFF_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_bias_off_request</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BG_PLDO_OFF_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_bg_pldo_off_request</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LDO_PRE_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_ldo_pre_request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_DN_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_dcdc_down_request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DCDC_UP_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_dcdc_up_request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LDO_POST_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_ldo_post_request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BG_PLDO_ON_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_bg_pldo_on_request</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BIAS_ON_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_bias_on_request</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PWR_ON_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_power_on_request</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RST_LATE_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_reset_late_request</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ISO_OFF_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_iso_off_request</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PLL_ON_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_oscpll_on_request</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROOT_UP_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_root_up_request</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GROUP_UP_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_group_up_request</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPCG_ON_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_lpcg_on_request</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SSAR_RSTR_REQUEST_STAT</name>
              <description>Status of pin set_point_trans_ssar_restore_request</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
