nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SP_ROOT_DOWN_CTRL</name>
          <description>SP root down control</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_ROOT_DOWN_STAT</name>
          <description>SP root down status</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_PLL_OFF_CTRL</name>
          <description>SP PLL off control</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_PLL_OFF_STAT</name>
          <description>SP PLL off status</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_ISO_ON_CTRL</name>
          <description>SP ISO on control</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_ISO_ON_STAT</name>
          <description>SP ISO on status</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_RESET_EARLY_CTRL</name>
          <description>SP reset early control</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_RESET_EARLY_STAT</name>
          <description>SP reset early status</description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_POWER_OFF_CTRL</name>
          <description>SP power off control</description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_POWER_OFF_STAT</name>
          <description>SP power off status</description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_BIAS_OFF_CTRL</name>
          <description>SP bias off control</description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_BIAS_OFF_STAT</name>
          <description>SP bias off status</description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_BG_PLDO_OFF_CTRL</name>
          <description>SP bandgap and PLL_LDO off control</description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_BG_PLDO_OFF_STAT</name>
          <description>SP bandgap and PLL_LDO off status</description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
