nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SP_RESET_LATE_CTRL</name>
          <description>SP reset late control</description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_RESET_LATE_STAT</name>
          <description>SP reset late status</description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_ISO_OFF_CTRL</name>
          <description>SP ISO off control</description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_ISO_OFF_STAT</name>
          <description>SP ISO off status</description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_PLL_ON_CTRL</name>
          <description>SP PLL on control</description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_PLL_ON_STAT</name>
          <description>SP PLL on status</description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_ROOT_UP_CTRL</name>
          <description>SP root up control</description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_ROOT_UP_STAT</name>
          <description>SP root up status</description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_GROUP_UP_CTRL</name>
          <description>SP group up control</description>
          <addressOffset>0x290</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_GROUP_UP_STAT</name>
          <description>SP group up status</description>
          <addressOffset>0x294</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_LPCG_ON_CTRL</name>
          <description>SP LPCG on control</description>
          <addressOffset>0x2A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_LPCG_ON_STAT</name>
          <description>SP LPCG on status</description>
          <addressOffset>0x2A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_SSAR_RESTORE_CTRL</name>
          <description>SP SSAR restore control</description>
          <addressOffset>0x2B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SP_SSAR_RESTORE_STAT</name>
          <description>SP SSAR restore status</description>
          <addressOffset>0x2B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
