nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>STBY_PLDO_IN_CTRL</name>
          <description>STBY pldo_in control</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_PLDO_IN_STAT</name>
          <description>STBY pldo_in status</description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_BANDGAP_IN_CTRL</name>
          <description>STBY bandgap_in control</description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_BANDGAP_IN_STAT</name>
          <description>STBY bandgap_in status</description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_LDO_IN_CTRL</name>
          <description>STBY ldo_in control</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_LDO_IN_STAT</name>
          <description>STBY ldo_in status</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_DCDC_IN_CTRL</name>
          <description>STBY dcdc_in control</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_DCDC_IN_STAT</name>
          <description>STBY dcdc_in status</description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_PMIC_IN_CTRL</name>
          <description>STBY PMIC in control</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_PMIC_IN_STAT</name>
          <description>STBY PMIC in status</description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_PMIC_OUT_CTRL</name>
          <description>STBY PMIC out control</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_PMIC_OUT_STAT</name>
          <description>STBY PMIC out status</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_DCDC_OUT_CTRL</name>
          <description>STBY DCDC out control</description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STEP_CNT</name>
              <description>Step count, useage is depending on CNT_MODE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use step counter, step completes once receiving step_done</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after receiving step_done, delay cycle number is STEP_CNT</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore step_done response, the counter starts to count once step begins, when counter reaches STEP_CNT value, the step completes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once step begins, the step completes when either step_done received or counting to STEP_CNT value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable this step</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STBY_DCDC_OUT_STAT</name>
          <description>STBY DCDC out status</description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSP_CNT</name>
              <description>Response count, record the delay from step start to step_done received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
