nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SRSR</name>
          <description>SRC Reset Status Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>IPP_RESET_B_M7</name>
              <description>Indicates whether reset was the result of ipp_reset_b pin (Power-up sequence)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPP_RESET_B_M7_0</name>
                  <description>Reset is not a result of ipp_reset_b pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPP_RESET_B_M7_1</name>
                  <description>Reset is a result of ipp_reset_b pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_REQUEST_M7</name>
              <description>Indicates whether reset was the result of m7 reset request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_REQUEST_M7_0</name>
                  <description>Reset is not a result of m7 reset request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_REQUEST_M7_1</name>
                  <description>Reset is a result of m7 reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_LOCKUP_M7</name>
              <description>Indicates a reset has been caused by M7 CPU lockup or software setting of SYSRESETREQ bit in Application Interrupt and Reset Control Register of the ARM core</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_LOCKUP_M7_0</name>
                  <description>Reset is not a result of the mentioned case.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_LOCKUP_M7_1</name>
                  <description>Reset is a result of the mentioned case.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSU_RESET_B_M7</name>
              <description>Indicates whether the reset was the result of the csu_reset_b input.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSU_RESET_B_M7_0</name>
                  <description>Reset is not a result of the csu_reset_b event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSU_RESET_B_M7_1</name>
                  <description>Reset is a result of the csu_reset_b event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPP_USER_RESET_B_M7</name>
              <description>Indicates whether the reset was the result of the ipp_user_reset_b qualified reset.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPP_USER_RESET_B_M7_0</name>
                  <description>Reset is not a result of the ipp_user_reset_b qualified as COLD reset event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPP_USER_RESET_B_M7_1</name>
                  <description>Reset is a result of the ipp_user_reset_b qualified as COLD reset event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG_RST_B_M7</name>
              <description>IC Watchdog Time-out reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG_RST_B_M7_0</name>
                  <description>Reset is not a result of the watchdog time-out event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG_RST_B_M7_1</name>
                  <description>Reset is a result of the watchdog time-out event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JTAG_RST_B_M7</name>
              <description>HIGH - Z JTAG reset. Indicates whether the reset was the result of HIGH-Z reset from JTAG.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JTAG_RST_B_M7_0</name>
                  <description>Reset is not a result of HIGH-Z reset from JTAG.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAG_RST_B_M7_1</name>
                  <description>Reset is a result of HIGH-Z reset from JTAG.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JTAG_SW_RST_M7</name>
              <description>JTAG software reset. Indicates whether the reset was the result of software reset from JTAG.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JTAG_SW_RST_M7_0</name>
                  <description>Reset is not a result of software reset from JTAG.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAG_SW_RST_M7_1</name>
                  <description>Reset is a result of software reset from JTAG.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG3_RST_B_M7</name>
              <description>IC Watchdog3 Time-out reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG3_RST_B_M7_0</name>
                  <description>Reset is not a result of the watchdog3 time-out event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG3_RST_B_M7_1</name>
                  <description>Reset is a result of the watchdog3 time-out event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG4_RST_B_M7</name>
              <description>IC Watchdog4 Time-out reset</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG4_RST_B_M7_0</name>
                  <description>Reset is not a result of the watchdog4 time-out event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG4_RST_B_M7_1</name>
                  <description>Reset is a result of the watchdog4 time-out event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TEMPSENSE_RST_B_M7</name>
              <description>Temper Sensor software reset</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEMPSENSE_RST_B_M7_0</name>
                  <description>Reset is not a result of software reset from Temperature Sensor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSE_RST_B_M7_1</name>
                  <description>Reset is a result of software reset from Temperature Sensor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4_REQUEST_M7</name>
              <description>Indicates whether reset was the result of m4 reset request.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M4_REQUEST_M7_0</name>
                  <description>Reset is not a result of m4 reset request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_REQUEST_M7_1</name>
                  <description>Reset is a result of m4 reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4_LOCKUP_M7</name>
              <description>Indicates a reset has been caused by M4 CPU lockup or software setting of SYSRESETREQ bit in Application Interrupt and Reset Control Register of the ARM core</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M4_LOCKUP_M7_0</name>
                  <description>Reset is not a result of the mentioned case.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_LOCKUP_M7_1</name>
                  <description>Reset is a result of the mentioned case.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERVOLT_RST_M7</name>
              <description>Indicates a reset has been caused by power suppy voltage over the highest permitted level.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERVOLT_RST_M7_0</name>
                  <description>Reset is not a result of the mentioned case.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERVOLT_RST_M7_1</name>
                  <description>Reset is a result of the mentioned case.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDOG_RST_M7</name>
              <description>Indicates a reset has been caused by CDOG reset.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDOG_RST_M7_0</name>
                  <description>Reset is not a result of the mentioned case.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDOG_RST_M7_1</name>
                  <description>Reset is a result of the mentioned case.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPP_RESET_B_M4</name>
              <description>Indicates whether reset was the result of ipp_reset_b pin (Power-up sequence)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPP_RESET_B_M4_0</name>
                  <description>Reset is not a result of ipp_reset_b pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPP_RESET_B_M4_1</name>
                  <description>Reset is a result of ipp_reset_b pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4_REQUEST_M4</name>
              <description>Indicates whether reset was the result of m4 reset request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M4_REQUEST_M4_0</name>
                  <description>Reset is not a result of m4 reset request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_REQUEST_M4_1</name>
                  <description>Reset is a result of m4 reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M4_LOCKUP_M4</name>
              <description>Indicates a reset has been caused by M4 CPU lockup or software setting of SYSRESETREQ bit in Application Interrupt and Reset Control Register of the ARM core</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M4_LOCKUP_M4_0</name>
                  <description>Reset is not a result of the mentioned case.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M4_LOCKUP_M4_1</name>
                  <description>Reset is a result of the mentioned case.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSU_RESET_B_M4</name>
              <description>Indicates whether the reset was the result of the csu_reset_b input.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSU_RESET_B_M4_0</name>
                  <description>Reset is not a result of the csu_reset_b event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSU_RESET_B_M4_1</name>
                  <description>Reset is a result of the csu_reset_b event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IPP_USER_RESET_B_M4</name>
              <description>Indicates whether the reset was the result of the ipp_user_reset_b qualified reset.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IPP_USER_RESET_B_M4_0</name>
                  <description>Reset is not a result of the ipp_user_reset_b qualified as COLD reset event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IPP_USER_RESET_B_M4_1</name>
                  <description>Reset is a result of the ipp_user_reset_b qualified as COLD reset event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG_RST_B_M4</name>
              <description>IC Watchdog Time-out reset</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG_RST_B_M4_0</name>
                  <description>Reset is not a result of the watchdog time-out event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG_RST_B_M4_1</name>
                  <description>Reset is a result of the watchdog time-out event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JTAG_RST_B_M4</name>
              <description>HIGH - Z JTAG reset. Indicates whether the reset was the result of HIGH-Z reset from JTAG.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JTAG_RST_B_M4_0</name>
                  <description>Reset is not a result of HIGH-Z reset from JTAG.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAG_RST_B_M4_1</name>
                  <description>Reset is a result of HIGH-Z reset from JTAG.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JTAG_SW_RST_M4</name>
              <description>JTAG software reset. Indicates whether the reset was the result of software reset from JTAG.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>JTAG_SW_RST_M4_0</name>
                  <description>Reset is not a result of software reset from JTAG.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JTAG_SW_RST_M4_1</name>
                  <description>Reset is a result of software reset from JTAG.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG3_RST_B_M4</name>
              <description>IC Watchdog3 Time-out reset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG3_RST_B_M4_0</name>
                  <description>Reset is not a result of the watchdog3 time-out event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG3_RST_B_M4_1</name>
                  <description>Reset is a result of the watchdog3 time-out event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDOG4_RST_B_M4</name>
              <description>IC Watchdog4 Time-out reset</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDOG4_RST_B_M4_0</name>
                  <description>Reset is not a result of the watchdog4 time-out event.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDOG4_RST_B_M4_1</name>
                  <description>Reset is a result of the watchdog4 time-out event.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
