nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
              <name>TEMPSENSE_RST_B_M4</name>
              <description>Temper Sensor software reset</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TEMPSENSE_RST_B_M4_0</name>
                  <description>Reset is not a result of software reset from Temperature Sensor.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEMPSENSE_RST_B_M4_1</name>
                  <description>Reset is a result of software reset from Temperature Sensor.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_REQUEST_M4</name>
              <description>Indicates whether reset was the result of m7 reset request.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_REQUEST_M4_0</name>
                  <description>Reset is not a result of m7 reset request.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_REQUEST_M4_1</name>
                  <description>Reset is a result of m7 reset request.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>M7_LOCKUP_M4</name>
              <description>Indicates a reset has been caused by M7 CPU lockup or software setting of SYSRESETREQ bit in Application Interrupt and Reset Control Register of the ARM core</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>M7_LOCKUP_M4_0</name>
                  <description>Reset is not a result of the mentioned case.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>M7_LOCKUP_M4_1</name>
                  <description>Reset is a result of the mentioned case.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OVERVOLT_RST_M4</name>
              <description>Indicates a reset has been caused by power suppy voltage over the highest permitted level.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OVERVOLT_RST_M4_0</name>
                  <description>Reset is not a result of the mentioned case.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OVERVOLT_RST_M4_1</name>
                  <description>Reset is a result of the mentioned case.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CDOG_RST_M4</name>
              <description>Indicates a reset has been caused by CDOG reset.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CDOG_RST_M4_0</name>
                  <description>Reset is not a result of the mentioned case.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CDOG_RST_M4_1</name>
                  <description>Reset is a result of the mentioned case.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>20</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20</dimIndex>
          <name>GPR%s</name>
          <description>SRC General Purpose Register</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPR</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTHEN_MEGA</name>
          <description>Slice Authentication Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DOMAIN_MODE</name>
              <description>Control whether reset slice is in domain mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DOMAIN_MODE_0</name>
                  <description>slice hardware reset will Not be triggered by cpu power mode transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DOMAIN_MODE_1</name>
                  <description>slice hardware reset will be triggered by cpu power mode transition. Do not set this bit and SETPOINT_MODE at the same time.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPOINT_MODE</name>
              <description>Control whether reset slice is in setpoint mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SETPOINT_MODE_0</name>
                  <description>slice hardware reset will Not be triggered by set point transition</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SETPOINT_MODE_1</name>
                  <description>slice hardware reset will be triggered by set point transition. Do not set this bit and DOMAIN_MODE at the same time.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOCK_MODE</name>
              <description>domain/setpoint mode lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ASSIGN_LIST</name>
              <description>when this bitfield set to 1, reset of slice would be subject to corresponding core status transition</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_ASSIGN</name>
              <description>Assign list lock</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHITE_LIST</name>
              <description>Domain ID white list</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_LIST</name>
              <description>White list lock</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USER</name>
              <description>Allow user mode access</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONSECURE</name>
              <description>Allow non-secure mode access</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_SETTING</name>
              <description>Lock NONSECURE and USER</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL_MEGA</name>
          <description>Slice Control Register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_RESET</name>
              <description>This is a self clearing bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SW_RESET_0</name>
                  <description>do not assert slice software reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SW_RESET_1</name>
                  <description>assert slice software reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
