nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_06</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_06 SW MUX Control Register</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpi2c6_SDA</name>
                  <description>Select mux mode: ALT0 mux port: LPI2C6_SDA of instance: LPI2C6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai4_RX_DATA</name>
                  <description>Select mux mode: ALT2 mux port: SAI4_RX_DATA of instance: SAI4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart12_TX</name>
                  <description>Select mux mode: ALT3 mux port: LPUART12_TXD of instance: LPUART12</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi6_PCS3</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI6_PCS3 of instance: LPSPI6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO6</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO06 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_can3_TX</name>
                  <description>Select mux mode: ALT6 mux port: FLEXCAN3_TX of instance: FLEXCAN3</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_pit2_TRIGGER3</name>
                  <description>Select mux mode: ALT7 mux port: PIT2_TRIGGER3 of instance: PIT2</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi5_PCS1</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI5_PCS1 of instance: LPSPI5</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO6</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO06 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_06</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_07</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_07 SW MUX Control Register</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpi2c6_SCL</name>
                  <description>Select mux mode: ALT0 mux port: LPI2C6_SCL of instance: LPI2C6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai4_RX_BCLK</name>
                  <description>Select mux mode: ALT2 mux port: SAI4_RX_BCLK of instance: SAI4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_lpuart12_RX</name>
                  <description>Select mux mode: ALT3 mux port: LPUART12_RXD of instance: LPUART12</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi6_PCS2</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI6_PCS2 of instance: LPSPI6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO7</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO07 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_can3_RX</name>
                  <description>Select mux mode: ALT6 mux port: FLEXCAN3_RX of instance: FLEXCAN3</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_pit2_TRIGGER2</name>
                  <description>Select mux mode: ALT7 mux port: PIT2_TRIGGER2 of instance: PIT2</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi5_PCS2</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI5_PCS2 of instance: LPSPI5</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO7</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO07 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_07</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_08</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_08 SW MUX Control Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpuart11_TX</name>
                  <description>Select mux mode: ALT0 mux port: LPUART11_TXD of instance: LPUART11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_can3_TX</name>
                  <description>Select mux mode: ALT1 mux port: FLEXCAN3_TX of instance: FLEXCAN3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_sai4_RX_SYNC</name>
                  <description>Select mux mode: ALT2 mux port: SAI4_RX_SYNC of instance: SAI4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_mic_CLK</name>
                  <description>Select mux mode: ALT3 mux port: MIC_CLK of instance: MIC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi6_PCS1</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI6_PCS1 of instance: LPSPI6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO8</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO08 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpi2c5_SDA</name>
                  <description>Select mux mode: ALT6 mux port: LPI2C5_SDA of instance: LPI2C5</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_pit2_TRIGGER1</name>
                  <description>Select mux mode: ALT7 mux port: PIT2_TRIGGER1 of instance: PIT2</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi5_PCS3</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI5_PCS3 of instance: LPSPI5</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO8</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO08 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_08</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_09</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_09 SW MUX Control Register</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_lpuart11_RX</name>
                  <description>Select mux mode: ALT0 mux port: LPUART11_RXD of instance: LPUART11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_can3_RX</name>
                  <description>Select mux mode: ALT1 mux port: FLEXCAN3_RX of instance: FLEXCAN3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_pit2_TRIGGER0</name>
                  <description>Select mux mode: ALT2 mux port: PIT2_TRIGGER0 of instance: PIT2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_mic_BITSTREAM0</name>
                  <description>Select mux mode: ALT3 mux port: MIC_BITSTREAM0 of instance: MIC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi6_PCS0</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI6_PCS0 of instance: LPSPI6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO9</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO09 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpi2c5_SCL</name>
                  <description>Select mux mode: ALT6 mux port: LPI2C5_SCL of instance: LPI2C5</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_sai4_TX_DATA</name>
                  <description>Select mux mode: ALT7 mux port: SAI4_TX_DATA of instance: SAI4</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO9</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO09 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_09</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_10</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_10 SW MUX Control Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_jtag_mux_TRSTB</name>
                  <description>Select mux mode: ALT0 mux port: JTAG_MUX_TRSTB of instance: JTAG_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpuart11_CTS_B</name>
                  <description>Select mux mode: ALT1 mux port: LPUART11_CTS_B of instance: LPUART11</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpi2c6_SDA</name>
                  <description>Select mux mode: ALT2 mux port: LPI2C6_SDA of instance: LPI2C6</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_mic_BITSTREAM1</name>
                  <description>Select mux mode: ALT3 mux port: MIC_BITSTREAM1 of instance: MIC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi6_SCK</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI6_SCK of instance: LPSPI6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO10</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO10 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpi2c5_SCLS</name>
                  <description>Select mux mode: ALT6 mux port: LPI2C5_SCLS of instance: LPI2C5</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_sai4_TX_SYNC</name>
                  <description>Select mux mode: ALT7 mux port: SAI4_TX_SYNC of instance: SAI4</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpuart12_TX</name>
                  <description>Select mux mode: ALT8 mux port: LPUART12_TXD of instance: LPUART12</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO10</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO10 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_10</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
