nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_11</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_11 SW MUX Control Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_jtag_mux_TDO</name>
                  <description>Select mux mode: ALT0 mux port: JTAG_MUX_TDO of instance: JTAG_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_lpuart11_RTS_B</name>
                  <description>Select mux mode: ALT1 mux port: LPUART11_RTS_B of instance: LPUART11</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_lpi2c6_SCL</name>
                  <description>Select mux mode: ALT2 mux port: LPI2C6_SCL of instance: LPI2C6</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_mic_BITSTREAM2</name>
                  <description>Select mux mode: ALT3 mux port: MIC_BITSTREAM2 of instance: MIC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi6_SDO</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI6_SOUT of instance: LPSPI6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO11</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO11 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpi2c5_SDAS</name>
                  <description>Select mux mode: ALT6 mux port: LPI2C5_SDAS of instance: LPI2C5</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_ARM_TRACE_SWO</name>
                  <description>Select mux mode: ALT7 mux port: ARM_TRACE_SWO of instance: ARM</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpuart12_RX</name>
                  <description>Select mux mode: ALT8 mux port: LPUART12_RXD of instance: LPUART12</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO11</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO11 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_11</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_12</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_12 SW MUX Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_jtag_mux_TDI</name>
                  <description>Select mux mode: ALT0 mux port: JTAG_MUX_TDI of instance: JTAG_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_pit2_TRIGGER0</name>
                  <description>Select mux mode: ALT1 mux port: PIT2_TRIGGER0 of instance: PIT2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT3_mic_BITSTREAM3</name>
                  <description>Select mux mode: ALT3 mux port: MIC_BITSTREAM3 of instance: MIC</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT4_lpspi6_SDI</name>
                  <description>Select mux mode: ALT4 mux port: LPSPI6_SIN of instance: LPSPI6</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO12</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO12 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT6_lpi2c5_HREQ</name>
                  <description>Select mux mode: ALT6 mux port: LPI2C5_HREQ of instance: LPI2C5</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_sai4_TX_BCLK</name>
                  <description>Select mux mode: ALT7 mux port: SAI4_TX_BCLK of instance: SAI4</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi5_SCK</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI5_SCK of instance: LPSPI5</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO12</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO12 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_12</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_13</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_13 SW MUX Control Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_jtag_mux_MOD</name>
                  <description>Select mux mode: ALT0 mux port: JTAG_MUX_MOD of instance: JTAG_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_mic_BITSTREAM1</name>
                  <description>Select mux mode: ALT1 mux port: MIC_BITSTREAM1 of instance: MIC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_pit2_TRIGGER1</name>
                  <description>Select mux mode: ALT2 mux port: PIT2_TRIGGER1 of instance: PIT2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO13</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO13 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_sai4_RX_DATA</name>
                  <description>Select mux mode: ALT7 mux port: SAI4_RX_DATA of instance: SAI4</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi5_PCS0</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI5_PCS0 of instance: LPSPI5</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO13</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO13 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_13</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_14</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_14 SW MUX Control Register</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_jtag_mux_TCK</name>
                  <description>Select mux mode: ALT0 mux port: JTAG_MUX_TCK of instance: JTAG_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_mic_BITSTREAM2</name>
                  <description>Select mux mode: ALT1 mux port: MIC_BITSTREAM2 of instance: MIC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_pit2_TRIGGER2</name>
                  <description>Select mux mode: ALT2 mux port: PIT2_TRIGGER2 of instance: PIT2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO14</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO14 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_sai4_RX_BCLK</name>
                  <description>Select mux mode: ALT7 mux port: SAI4_RX_BCLK of instance: SAI4</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi5_SDO</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI5_SOUT of instance: LPSPI5</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO14</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO14 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_14</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SW_MUX_CTL_PAD_GPIO_LPSR_15</name>
          <description>SW_MUX_CTL_PAD_GPIO_LPSR_15 SW MUX Control Register</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MUX_MODE</name>
              <description>MUX Mode Select Field.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALT0_jtag_mux_TMS</name>
                  <description>Select mux mode: ALT0 mux port: JTAG_MUX_TMS of instance: JTAG_MUX</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT1_mic_BITSTREAM3</name>
                  <description>Select mux mode: ALT1 mux port: MIC_BITSTREAM3 of instance: MIC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT2_pit2_TRIGGER3</name>
                  <description>Select mux mode: ALT2 mux port: PIT2_TRIGGER3 of instance: PIT2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT5_gpio_mux6_IO15</name>
                  <description>Select mux mode: ALT5 mux port: GPIO_MUX6_IO15 of instance: GPIO_MUX6</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT7_sai4_RX_SYNC</name>
                  <description>Select mux mode: ALT7 mux port: SAI4_RX_SYNC of instance: SAI4</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT8_lpspi5_SDI</name>
                  <description>Select mux mode: ALT8 mux port: LPSPI5_SIN of instance: LPSPI5</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALT10_gpio12_IO15</name>
                  <description>Select mux mode: ALT10 mux port: GPIO12_IO15 of instance: GPIO12</description>
                  <value>0xA</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SION</name>
              <description>Software Input On Field.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Input Path is determined by functionality</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Force input path of pad GPIO_LPSR_15</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
