nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>SW_PAD_CTL_PAD_GPIO_LPSR_15</name>
          <description>SW_PAD_CTL_PAD_GPIO_LPSR_15 SW PAD Control Register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xE</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SRE</name>
              <description>Slew Rate Field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SRE_0_Slow_Slew_Rate</name>
                  <description>Slow Slew Rate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SRE_1_Fast_Slew_Rate</name>
                  <description>Fast Slew Rate</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSE</name>
              <description>Drive Strength Field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSE_0_normal_driver</name>
                  <description>normal driver</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSE_1_high_driver</name>
                  <description>high driver</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUE</name>
              <description>Pull / Keep Select Field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUE_0_Keeper</name>
                  <description>Keeper</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUE_1_Pull</name>
                  <description>Pull</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUS</name>
              <description>Pull Up / Down Config. Field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PUS_0_Weak_pull_down</name>
                  <description>Weak pull down</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PUS_1_Weak_pull_up</name>
                  <description>Weak pull up</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ODE_LPSR</name>
              <description>Open Drain LPSR Field</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ODE_LPSR_0_Disabled</name>
                  <description>Disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODE_LPSR_1_Enabled</name>
                  <description>Enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CAN3_IPP_IND_CANRX_SELECT_INPUT</name>
          <description>CAN3_IPP_IND_CANRX_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_01_ALT0</name>
                  <description>Selecting Pad: GPIO_LPSR_01 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_07_ALT6</name>
                  <description>Selecting Pad: GPIO_LPSR_07 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_09_ALT1</name>
                  <description>Selecting Pad: GPIO_LPSR_09 for Mode: ALT1</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C5_IPP_IND_LPI2C_SCL_SELECT_INPUT</name>
          <description>LPI2C5_IPP_IND_LPI2C_SCL_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_05_ALT0</name>
                  <description>Selecting Pad: GPIO_LPSR_05 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_09_ALT6</name>
                  <description>Selecting Pad: GPIO_LPSR_09 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C5_IPP_IND_LPI2C_SDA_SELECT_INPUT</name>
          <description>LPI2C5_IPP_IND_LPI2C_SDA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_04_ALT0</name>
                  <description>Selecting Pad: GPIO_LPSR_04 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_08_ALT6</name>
                  <description>Selecting Pad: GPIO_LPSR_08 for Mode: ALT6</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C6_IPP_IND_LPI2C_SCL_SELECT_INPUT</name>
          <description>LPI2C6_IPP_IND_LPI2C_SCL_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_07_ALT0</name>
                  <description>Selecting Pad: GPIO_LPSR_07 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_11_ALT2</name>
                  <description>Selecting Pad: GPIO_LPSR_11 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPI2C6_IPP_IND_LPI2C_SDA_SELECT_INPUT</name>
          <description>LPI2C6_IPP_IND_LPI2C_SDA_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_06_ALT0</name>
                  <description>Selecting Pad: GPIO_LPSR_06 for Mode: ALT0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_10_ALT2</name>
                  <description>Selecting Pad: GPIO_LPSR_10 for Mode: ALT2</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI5_IPP_IND_LPSPI_PCS_SELECT_INPUT_0</name>
          <description>LPSPI5_IPP_IND_LPSPI_PCS_SELECT_INPUT_0 DAISY Register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_03_ALT1</name>
                  <description>Selecting Pad: GPIO_LPSR_03 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_13_ALT8</name>
                  <description>Selecting Pad: GPIO_LPSR_13 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI5_IPP_IND_LPSPI_SCK_SELECT_INPUT</name>
          <description>LPSPI5_IPP_IND_LPSPI_SCK_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_02_ALT1</name>
                  <description>Selecting Pad: GPIO_LPSR_02 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_12_ALT8</name>
                  <description>Selecting Pad: GPIO_LPSR_12 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI5_IPP_IND_LPSPI_SDI_SELECT_INPUT</name>
          <description>LPSPI5_IPP_IND_LPSPI_SDI_SELECT_INPUT DAISY Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_05_ALT1</name>
                  <description>Selecting Pad: GPIO_LPSR_05 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_15_ALT8</name>
                  <description>Selecting Pad: GPIO_LPSR_15 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPSPI5_IPP_IND_LPSPI_SDO_SELECT_INPUT</name>
          <description>LPSPI5_IPP_IND_LPSPI_SDO_SELECT_INPUT DAISY Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_04_ALT1</name>
                  <description>Selecting Pad: GPIO_LPSR_04 for Mode: ALT1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_14_ALT8</name>
                  <description>Selecting Pad: GPIO_LPSR_14 for Mode: ALT8</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART11_IPP_IND_LPUART_RXD_SELECT_INPUT</name>
          <description>LPUART11_IPP_IND_LPUART_RXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_05_ALT6</name>
                  <description>Selecting Pad: GPIO_LPSR_05 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_09_ALT0</name>
                  <description>Selecting Pad: GPIO_LPSR_09 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART11_IPP_IND_LPUART_TXD_SELECT_INPUT</name>
          <description>LPUART11_IPP_IND_LPUART_TXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_04_ALT6</name>
                  <description>Selecting Pad: GPIO_LPSR_04 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_08_ALT0</name>
                  <description>Selecting Pad: GPIO_LPSR_08 for Mode: ALT0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART12_IPP_IND_LPUART_RXD_SELECT_INPUT</name>
          <description>LPUART12_IPP_IND_LPUART_RXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_01_ALT6</name>
                  <description>Selecting Pad: GPIO_LPSR_01 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_07_ALT3</name>
                  <description>Selecting Pad: GPIO_LPSR_07 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_11_ALT8</name>
                  <description>Selecting Pad: GPIO_LPSR_11 for Mode: ALT8</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LPUART12_IPP_IND_LPUART_TXD_SELECT_INPUT</name>
          <description>LPUART12_IPP_IND_LPUART_TXD_SELECT_INPUT DAISY Register</description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DAISY</name>
              <description>Selecting Pads Involved in Daisy Chain.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_00_ALT6</name>
                  <description>Selecting Pad: GPIO_LPSR_00 for Mode: ALT6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_06_ALT3</name>
                  <description>Selecting Pad: GPIO_LPSR_06 for Mode: ALT3</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_GPIO_LPSR_10_ALT8</name>
                  <description>Selecting Pad: GPIO_LPSR_10 for Mode: ALT8</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
