nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>GPR38</name>
          <description>GPR38 General Purpose Register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPUART5_IPG_DOZE</name>
              <description>LPUART5 doze mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART5_STOP_REQ</name>
              <description>LPUART5 stop request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART5_IPG_STOP_MODE</name>
              <description>LPUART5 stop mode selection, cannot change when LPUART5_STOP_REQ is asserted.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART6_IPG_DOZE</name>
              <description>LPUART6 doze mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART6_STOP_REQ</name>
              <description>LPUART6 stop request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART6_IPG_STOP_MODE</name>
              <description>LPUART6 stop mode selection, cannot change when LPUART6_STOP_REQ is asserted.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART7_IPG_DOZE</name>
              <description>LPUART7 doze mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART7_STOP_REQ</name>
              <description>LPUART7 stop request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART7_IPG_STOP_MODE</name>
              <description>LPUART7 stop mode selection, cannot change when LPUART7_STOP_REQ is asserted.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART8_IPG_DOZE</name>
              <description>LPUART8 doze mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART8_STOP_REQ</name>
              <description>LPUART8 stop request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART8_IPG_STOP_MODE</name>
              <description>LPUART8 stop mode selection, cannot change when LPUART8_STOP_REQ is asserted.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART9_IPG_DOZE</name>
              <description>LPUART9 doze mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART9_STOP_REQ</name>
              <description>LPUART9 stop request</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART9_IPG_STOP_MODE</name>
              <description>LPUART9 stop mode selection, cannot change when LPUART9_STOP_REQ is asserted.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART10_IPG_DOZE</name>
              <description>LPUART10 doze mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART10_STOP_REQ</name>
              <description>LPUART10 stop request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART10_IPG_STOP_MODE</name>
              <description>LPUART10 stop mode selection, cannot change when LPUART10_STOP_REQ is asserted.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART11_IPG_DOZE</name>
              <description>LPUART11 doze mode</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART11_STOP_REQ</name>
              <description>LPUART11 stop request</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART11_IPG_STOP_MODE</name>
              <description>LPUART11 stop mode selection, cannot change when LPUART11_STOP_REQ is asserted.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART12_IPG_DOZE</name>
              <description>LPUART12 doze mode</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART12_STOP_REQ</name>
              <description>LPUART12 stop request</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LPUART12_IPG_STOP_MODE</name>
              <description>LPUART12 stop mode selection, cannot change when LPUART12_STOP_REQ is asserted.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_IPG_DOZE</name>
              <description>MIC doze mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_STOP_REQ</name>
              <description>MIC stop request</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MIC_IPG_STOP_MODE</name>
              <description>MIC stop mode selection, cannot change when MIC_STOP_REQ is asserted.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR39</name>
          <description>GPR39 General Purpose Register</description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIT1_STOP_REQ</name>
              <description>PIT1 stop request</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIT2_STOP_REQ</name>
              <description>PIT2 stop request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEMC_STOP_REQ</name>
              <description>SEMC stop request</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIM1_IPG_DOZE</name>
              <description>SIM1 doze mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SIM2_IPG_DOZE</name>
              <description>SIM2 doze mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_HP_IPG_DOZE</name>
              <description>SNVS_HP doze mode</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_HP_STOP_REQ</name>
              <description>SNVS_HP stop request</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDOG1_IPG_DOZE</name>
              <description>WDOG1 doze mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDOG2_IPG_DOZE</name>
              <description>WDOG2 doze mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAI1_STOP_REQ</name>
              <description>SAI1 stop request</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAI2_STOP_REQ</name>
              <description>SAI2 stop request</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAI3_STOP_REQ</name>
              <description>SAI3 stop request</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SAI4_STOP_REQ</name>
              <description>SAI4 stop request</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXIO1_STOP_REQ_BUS</name>
              <description>FLEXIO1 bus clock domain stop request</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXIO1_STOP_REQ_PER</name>
              <description>FLEXIO1 peripheral clock domain stop request</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXIO2_STOP_REQ_BUS</name>
              <description>FLEXIO2 bus clock domain stop request</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXIO2_STOP_REQ_PER</name>
              <description>FLEXIO2 peripheral clock domain stop request</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWP</name>
              <description>Domain write protection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>forbid_none</name>
                  <description>Both cores are allowed</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM7</name>
                  <description>CM7 is forbidden</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_CM4</name>
                  <description>CM4 is forbidden</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>forbid_both</name>
                  <description>Both cores are forbidden</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DWP_LOCK</name>
              <description>Domain write protection lock</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-writeOnce</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>lock_none</name>
                  <description>Neither of DWP bits is locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_low</name>
                  <description>The lower DWP bit is locked</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_high</name>
                  <description>The higher DWP bit is locked</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>lock_both</name>
                  <description>Both DWP bits are locked</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
