nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>GPR40</name>
          <description>GPR40 General Purpose Register</description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADC1_STOP_ACK</name>
              <description>ADC1 stop acknowledge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ADC2_STOP_ACK</name>
              <description>ADC2 stop acknowledge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAAM_STOP_ACK</name>
              <description>CAAM stop acknowledge</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAN1_STOP_ACK</name>
              <description>CAN1 stop acknowledge</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAN2_STOP_ACK</name>
              <description>CAN2 stop acknowledge</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CAN3_STOP_ACK</name>
              <description>CAN3 stop acknowledge</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EDMA_STOP_ACK</name>
              <description>EDMA stop acknowledge</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>EDMA_LPSR_STOP_ACK</name>
              <description>EDMA_LPSR stop acknowledge</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENET_STOP_ACK</name>
              <description>ENET stop acknowledge</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENET1G_STOP_ACK</name>
              <description>ENET1G stop acknowledge</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLEXSPI1_STOP_ACK</name>
              <description>FLEXSPI1 stop acknowledge</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLEXSPI2_STOP_ACK</name>
              <description>FLEXSPI2 stop acknowledge</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPI2C1_STOP_ACK</name>
              <description>LPI2C1 stop acknowledge</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPI2C2_STOP_ACK</name>
              <description>LPI2C2 stop acknowledge</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPI2C3_STOP_ACK</name>
              <description>LPI2C3 stop acknowledge</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPI2C4_STOP_ACK</name>
              <description>LPI2C4 stop acknowledge</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPI2C5_STOP_ACK</name>
              <description>LPI2C5 stop acknowledge</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPI2C6_STOP_ACK</name>
              <description>LPI2C6 stop acknowledge</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPSPI1_STOP_ACK</name>
              <description>LPSPI1 stop acknowledge</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPSPI2_STOP_ACK</name>
              <description>LPSPI2 stop acknowledge</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPSPI3_STOP_ACK</name>
              <description>LPSPI3 stop acknowledge</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPSPI4_STOP_ACK</name>
              <description>LPSPI4 stop acknowledge</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPSPI5_STOP_ACK</name>
              <description>LPSPI5 stop acknowledge</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPSPI6_STOP_ACK</name>
              <description>LPSPI6 stop acknowledge</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPUART1_STOP_ACK</name>
              <description>LPUART1 stop acknowledge</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPUART2_STOP_ACK</name>
              <description>LPUART2 stop acknowledge</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPUART3_STOP_ACK</name>
              <description>LPUART3 stop acknowledge</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPUART4_STOP_ACK</name>
              <description>LPUART4 stop acknowledge</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPUART5_STOP_ACK</name>
              <description>LPUART5 stop acknowledge</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPUART6_STOP_ACK</name>
              <description>LPUART6 stop acknowledge</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPUART7_STOP_ACK</name>
              <description>LPUART7 stop acknowledge</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPUART8_STOP_ACK</name>
              <description>LPUART8 stop acknowledge</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR41</name>
          <description>GPR41 General Purpose Register</description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LPUART9_STOP_ACK</name>
              <description>LPUART9 stop acknowledge</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPUART10_STOP_ACK</name>
              <description>LPUART10 stop acknowledge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPUART11_STOP_ACK</name>
              <description>LPUART11 stop acknowledge</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LPUART12_STOP_ACK</name>
              <description>LPUART12 stop acknowledge</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MIC_STOP_ACK</name>
              <description>MIC stop acknowledge</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIT1_STOP_ACK</name>
              <description>PIT1 stop acknowledge</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PIT2_STOP_ACK</name>
              <description>PIT2 stop acknowledge</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SEMC_STOP_ACK</name>
              <description>SEMC stop acknowledge</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SNVS_HP_STOP_ACK</name>
              <description>SNVS_HP stop acknowledge</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAI1_STOP_ACK</name>
              <description>SAI1 stop acknowledge</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAI2_STOP_ACK</name>
              <description>SAI2 stop acknowledge</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAI3_STOP_ACK</name>
              <description>SAI3 stop acknowledge</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAI4_STOP_ACK</name>
              <description>SAI4 stop acknowledge</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLEXIO1_STOP_ACK_BUS</name>
              <description>FLEXIO1 stop acknowledge of bus clock domain</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLEXIO1_STOP_ACK_PER</name>
              <description>FLEXIO1 stop acknowledge of peripheral clock domain</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLEXIO2_STOP_ACK_BUS</name>
              <description>FLEXIO2 stop acknowledge of bus clock domain</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLEXIO2_STOP_ACK_PER</name>
              <description>FLEXIO2 stop acknowledge of peripheral clock domain</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROM_READ_LOCKED</name>
              <description>ROM read lock status bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
