nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>STAT</name>
          <description>PDM Status register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CH0F</name>
              <description>Channel 0 Output Data Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO did not reach the number of elements configured in watermark bit-field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO reached the number of elements configured in watermark bit-field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH1F</name>
              <description>Channel 1 Output Data Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO did not reach the number of elements configured in watermark bit-field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO reached the number of elements configured in watermark bit-field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH2F</name>
              <description>Channel 2 Output Data Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO did not reach the number of elements configured in watermark bit-field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO reached the number of elements configured in watermark bit-field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH3F</name>
              <description>Channel 3 Output Data Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO did not reach the number of elements configured in watermark bit-field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO reached the number of elements configured in watermark bit-field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH4F</name>
              <description>Channel 4 Output Data Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO did not reach the number of elements configured in watermark bit-field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO reached the number of elements configured in watermark bit-field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH5F</name>
              <description>Channel 5 Output Data Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO did not reach the number of elements configured in watermark bit-field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO reached the number of elements configured in watermark bit-field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH6F</name>
              <description>Channel 6 Output Data Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO did not reach the number of elements configured in watermark bit-field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO reached the number of elements configured in watermark bit-field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CH7F</name>
              <description>Channel 7 Output Data Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO did not reach the number of elements configured in watermark bit-field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Channel's FIFO reached the number of elements configured in watermark bit-field.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOWFREQF</name>
              <description>Low Frequency Flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>CLKDIV value is OK.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>CLKDIV value is too low.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FIR_RDY</name>
              <description>Filter Data Ready</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Filter data is not reliable.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Filter data is reliable.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BSY_FIL</name>
              <description>Busy Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>PDM is stopped.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>PDM is running.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFO_CTRL</name>
          <description>PDM FIFO Control register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIFOWMK</name>
              <description>FIFO Watermark Control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
