nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>RANGE_STAT</name>
          <description>PDM Range Status register</description>
          <addressOffset>0x7C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANGEOVF0</name>
              <description>Channel 0 Range Overflow Error Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range overflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range overflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF1</name>
              <description>Channel 1 Range Overflow Error Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range overflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range overflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF2</name>
              <description>Channel 2 Range Overflow Error Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range overflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range overflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF3</name>
              <description>Channel 3 Range Overflow Error Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range overflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range overflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF4</name>
              <description>Channel 4 Range Overflow Error Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range overflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range overflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF5</name>
              <description>Channel 5 Range Overflow Error Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range overflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range overflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF6</name>
              <description>Channel 6 Range Overflow Error Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range overflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range overflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEOVF7</name>
              <description>Channel 7 Range Overflow Error Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range overflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range overflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF0</name>
              <description>Channel 0 Range Underflow Error Flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range underflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range underflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF1</name>
              <description>Channel 1 Range Underflow Error Flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range underflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range underflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF2</name>
              <description>Channel 2 Range Underflow Error Flag</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range underflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range underflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF3</name>
              <description>Channel 3 Range Underflow Error Flag</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range underflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range underflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF4</name>
              <description>Channel 4 Range Underflow Error Flag</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range underflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range underflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF5</name>
              <description>Channel 5 Range Underflow Error Flag</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range underflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range underflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF6</name>
              <description>Channel 6 Range Underflow Error Flag</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range underflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range underflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGEUNF7</name>
              <description>Channel 7 Range Underflow Error Flag</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>No exception by range underflow.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Exception by range underflow.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD0_CTRL_1</name>
          <description>Voice Activity Detector 0 Control register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VADEN</name>
              <description>Voice Activity Detector Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>The HWVAD is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>The HWVAD is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADRST</name>
              <description>Voice Activity Detector Reset</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADIE</name>
              <description>Voice Activity Detector Interruption Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>HWVAD Interrupts disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>HWVAD Interrupts enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADERIE</name>
              <description>Voice Activity Detector Error Interruption Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>HWVAD Error Interrupts disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>HWVAD Error Interrupts enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADST10</name>
              <description>Voice Activity Detector Internal Filters Initialization</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Normal operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Filters are initialized.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADINITT</name>
              <description>Voice Activity Detector Initialization Time</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADCICOSR</name>
              <description>Voice Activity Detector CIC Oversampling Rate</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADCHSEL</name>
              <description>Voice Activity Detector Channel Selector</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VAD0_CTRL_2</name>
          <description>Voice Activity Detector 0 Control register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xA0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VADHPF</name>
              <description>Voice Activity Detector High-Pass Filter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Filter bypassed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Cut-off frequency at 1750Hz.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Cut-off frequency at 215Hz.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Cut-off frequency at 102Hz.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADINPGAIN</name>
              <description>Voice Activity Detector Input Gain</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADFRAMET</name>
              <description>Voice Activity Detector Frame Time</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VADFOUTDIS</name>
              <description>Voice Activity Detector Force Output Disable</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Output is enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Output is disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADPREFEN</name>
              <description>Voice Activity Detector Pre Filter Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Pre-filter is bypassed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Pre-filter is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VADFRENDIS</name>
              <description>Voice Activity Detector Frame Energy Disable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name></name>
                  <description>Frame energy calculus enabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name></name>
                  <description>Frame energy calculus disabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
