nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>KEYSIZE</name>
          <description>Quiddikey Key Size Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEYSIZE</name>
              <description>PUF Key Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE64</name>
                  <description>Key Size is 512 Bytes and KC Size is 532 Bytes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE1</name>
                  <description>Key Size is 8 Bytes and KC Size is 52 Bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE2</name>
                  <description>Key Size is 16 Bytes and KC Size is 52 Bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE3</name>
                  <description>Key Size is 24 Bytes and KC Size is 52 Bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE4</name>
                  <description>Key Size is 32 Bytes and KC Size is 52 Bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE5</name>
                  <description>Key Size is 40 Bytes and KC Size is 84 Bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE6</name>
                  <description>Key Size is 48 Bytes and KC Size is 84 Bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE7</name>
                  <description>Key Size is 56 Bytes and KC Size is 84 Bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE8</name>
                  <description>Key Size is 64 Bytes and KC Size is 84 Bytes</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE9</name>
                  <description>Key Size is 72 Bytes and KC Size is 116 Bytes</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE10</name>
                  <description>Key Size is 80 Bytes and KC Size is 116 Bytes</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE11</name>
                  <description>Key Size is 88 Bytes and KC Size is 116 Bytes</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE12</name>
                  <description>Key Size is 96 Bytes and KC Size is 116 Bytes</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE13</name>
                  <description>Key Size is 104 Bytes and KC Size is 148 Bytes</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE14</name>
                  <description>Key Size is 112 Bytes and KC Size is 148 Bytes</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE15</name>
                  <description>Key Size is 120 Bytes and KC Size is 148 Bytes</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE16</name>
                  <description>Key Size is 128 Bytes and KC Size is 148 Bytes</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE17</name>
                  <description>Key Size is 136 Bytes and KC Size is 180 Bytes</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE18</name>
                  <description>Key Size is 144 Bytes and KC Size is 180 Bytes</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE19</name>
                  <description>Key Size is 152 Bytes and KC Size is 180 Bytes</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE20</name>
                  <description>Key Size is 160 Bytes and KC Size is 180 Bytes</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE21</name>
                  <description>Key Size is 168 Bytes and KC Size is 212 Bytes</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE22</name>
                  <description>Key Size is 176 Bytes and KC Size is 212 Bytes</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE23</name>
                  <description>Key Size is 184 Bytes and KC Size is 212 Bytes</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE24</name>
                  <description>Key Size is 192 Bytes and KC Size is 212 Bytes</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE25</name>
                  <description>Key Size is 200 Bytes and KC Size is 244 Bytes</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE26</name>
                  <description>Key Size is 208 Bytes and KC Size is 244 Bytes</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE27</name>
                  <description>Key Size is 216 Bytes and KC Size is 244 Bytes</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE28</name>
                  <description>Key Size is 224 Bytes and KC Size is 244 Bytes</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE29</name>
                  <description>Key Size is 232 Bytes and KC Size is 276 Bytes</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE30</name>
                  <description>Key Size is 240 Bytes and KC Size is 276 Bytes</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE31</name>
                  <description>Key Size is 248 Bytes and KC Size is 276 Bytes</description>
                  <value>0x1F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE32</name>
                  <description>Key Size is 256 Bytes and KC Size is 276 Bytes</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE33</name>
                  <description>Key Size is 264 Bytes and KC Size is 308 Bytes</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE34</name>
                  <description>Key Size is 272 Bytes and KC Size is 308 Bytes</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE35</name>
                  <description>Key Size is 280 Bytes and KC Size is 308 Bytes</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE36</name>
                  <description>Key Size is 288 Bytes and KC Size is 308 Bytes</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE37</name>
                  <description>Key Size is 296 Bytes and KC Size is 340 Bytes</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE38</name>
                  <description>Key Size is 304 Bytes and KC Size is 340 Bytes</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE39</name>
                  <description>Key Size is 312 Bytes and KC Size is 340 Bytes</description>
                  <value>0x27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE40</name>
                  <description>Key Size is 320 Bytes and KC Size is 340 Bytes</description>
                  <value>0x28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE41</name>
                  <description>Key Size is 328 Bytes and KC Size is 372 Bytes</description>
                  <value>0x29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE42</name>
                  <description>Key Size is 336 Bytes and KC Size is 372 Bytes</description>
                  <value>0x2A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE43</name>
                  <description>Key Size is 344 Bytes and KC Size is 372 Bytes</description>
                  <value>0x2B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE44</name>
                  <description>Key Size is 352 Bytes and KC Size is 372 Bytes</description>
                  <value>0x2C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE45</name>
                  <description>Key Size is 360 Bytes and KC Size is 404 Bytes</description>
                  <value>0x2D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE46</name>
                  <description>Key Size is 368 Bytes and KC Size is 404 Bytes</description>
                  <value>0x2E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE47</name>
                  <description>Key Size is 376 Bytes and KC Size is 404 Bytes</description>
                  <value>0x2F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE48</name>
                  <description>Key Size is 384 Bytes and KC Size is 404 Bytes</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE49</name>
                  <description>Key Size is 392 Bytes and KC Size is 436 Bytes</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE50</name>
                  <description>Key Size is 400 Bytes and KC Size is 436 Bytes</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE51</name>
                  <description>Key Size is 408 Bytes and KC Size is 436 Bytes</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE52</name>
                  <description>Key Size is 416 Bytes and KC Size is 436 Bytes</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE53</name>
                  <description>Key Size is 424 Bytes and KC Size is 468 Bytes</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE54</name>
                  <description>Key Size is 432 Bytes and KC Size is 468 Bytes</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE55</name>
                  <description>Key Size is 440 Bytes and KC Size is 468 Bytes</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE56</name>
                  <description>Key Size is 448 Bytes and KC Size is 468 Bytes</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE57</name>
                  <description>Key Size is 456 Bytes and KC Size is 500 Bytes</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE58</name>
                  <description>Key Size is 464 Bytes and KC Size is 500 Bytes</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE59</name>
                  <description>Key Size is 472 Bytes and KC Size is 500 Bytes</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE60</name>
                  <description>Key Size is 480 Bytes and KC Size is 500 Bytes</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE61</name>
                  <description>Key Size is 488 Bytes and KC Size is 532 Bytes</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE62</name>
                  <description>Key Size is 496 Bytes and KC Size is 532 Bytes</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE63</name>
                  <description>Key Size is 504 Bytes and KC Size is 532 Bytes</description>
                  <value>0x3F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>Quiddikey Status Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BUSY</name>
              <description>puf_busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>IDLE</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>BUSY</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SUCCESS</name>
              <description>puf_ok</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Last operation was unsuccessful</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUCCESSFUL</name>
                  <description>Last operation was successful</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERROR</name>
              <description>puf_error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_IN_ERROR</name>
                  <description>Quiddikey is not in the Error state</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN_ERROR</name>
                  <description>Quiddikey is in the Error state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEYINREQ</name>
              <description>KI_ir</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREQUEST</name>
                  <description>No request for next part of key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <description>Request for next part of key</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEYOUTAVAIL</name>
              <description>KO_or</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOAVAILABLE</name>
                  <description>Next part of key is not available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVAILABLE</name>
                  <description>Next part of key is available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CODEINREQ</name>
              <description>CI_ir</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOREQUEST</name>
                  <description>No request for next part of Activation Code/Key Code</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQUEST</name>
                  <description>request for next part of Activation Code/Key Code</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CODEOUTAVAIL</name>
              <description>CO_or</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <modifiedWriteValues>modify</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOAVAILABLE</name>
                  <description>Next part of Activation Code/Key Code is not available</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVAILABLE</name>
                  <description>Next part of Activation Code/Key Code is available</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
