nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>LDO_LPSR_ANA_TRACKING_EN_SP</name>
          <description>LDO_LPSR_ANA_TRACKING_EN_SP_REGISTER</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRACKING_EN_SETPOINT0</name>
              <description>TRACKING_EN_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT1</name>
              <description>TRACKING_EN_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT2</name>
              <description>TRACKING_EN_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT3</name>
              <description>TRACKING_EN_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT4</name>
              <description>TRACKING_EN_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT5</name>
              <description>TRACKING_EN_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT6</name>
              <description>TRACKING_EN_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT7</name>
              <description>TRACKING_EN_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT8</name>
              <description>TRACKING_EN_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT9</name>
              <description>TRACKING_EN_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT10</name>
              <description>TRACKING_EN_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT11</name>
              <description>TRACKING_EN_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT12</name>
              <description>TRACKING_EN_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT13</name>
              <description>TRACKING_EN_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT14</name>
              <description>TRACKING_EN_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRACKING_EN_SETPOINT15</name>
              <description>TRACKING_EN_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_ANA_BYPASS_EN_SP</name>
          <description>LDO_LPSR_ANA_BYPASS_EN_SP_REGISTER</description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYPASS_EN_SETPOINT0</name>
              <description>BYPASS_EN_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT1</name>
              <description>BYPASS_EN_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT2</name>
              <description>BYPASS_EN_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT3</name>
              <description>BYPASS_EN_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT4</name>
              <description>BYPASS_EN_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT5</name>
              <description>BYPASS_EN_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT6</name>
              <description>BYPASS_EN_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT7</name>
              <description>BYPASS_EN_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT8</name>
              <description>BYPASS_EN_SETPOINT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT9</name>
              <description>BYPASS_EN_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT10</name>
              <description>BYPASS_EN_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT11</name>
              <description>BYPASS_EN_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT12</name>
              <description>BYPASS_EN_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT13</name>
              <description>BYPASS_EN_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT14</name>
              <description>BYPASS_EN_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BYPASS_EN_SETPOINT15</name>
              <description>BYPASS_EN_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_ANA_STBY_EN_SP</name>
          <description>LDO_LPSR_ANA_STBY_EN_SP_REGISTER</description>
          <addressOffset>0x650</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_EN_SETPOINT0</name>
              <description>STBY_EN_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT1</name>
              <description>STBY_EN_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT2</name>
              <description>STBY_EN_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT3</name>
              <description>STBY_EN_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT4</name>
              <description>STBY_EN_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT5</name>
              <description>STBY_EN_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT6</name>
              <description>STBY_EN_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT7</name>
              <description>STBY_EN_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT8</name>
              <description>STBY_EN_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT9</name>
              <description>STBY_EN_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT10</name>
              <description>STBY_EN_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT11</name>
              <description>STBY_EN_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT12</name>
              <description>STBY_EN_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT13</name>
              <description>STBY_EN_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT14</name>
              <description>STBY_EN_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT15</name>
              <description>STBY_EN_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_DIG_ENABLE_SP</name>
          <description>LDO_LPSR_DIG_ENABLE_SP_REGISTER</description>
          <addressOffset>0x660</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ON_OFF_SETPOINT0</name>
              <description>ON_OFF_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT1</name>
              <description>ON_OFF_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT2</name>
              <description>ON_OFF_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT3</name>
              <description>ON_OFF_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT4</name>
              <description>ON_OFF_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT5</name>
              <description>ON_OFF_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT6</name>
              <description>ON_OFF_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT7</name>
              <description>ON_OFF_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT8</name>
              <description>ON_OFF_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT9</name>
              <description>ON_OFF_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT10</name>
              <description>ON_OFF_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT11</name>
              <description>ON_OFF_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT12</name>
              <description>ON_OFF_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT13</name>
              <description>ON_OFF_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT14</name>
              <description>ON_OFF_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT15</name>
              <description>ON_OFF_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_DIG_TRG_SP0</name>
          <description>LDO_LPSR_DIG_TRG_SP0_REGISTER</description>
          <addressOffset>0x670</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOLTAGE_SETPOINT0</name>
              <description>VOLTAGE_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT1</name>
              <description>VOLTAGE_SETPOINT1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT2</name>
              <description>VOLTAGE_SETPOINT2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT3</name>
              <description>VOLTAGE_SETPOINT3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_DIG_TRG_SP1</name>
          <description>LDO_LPSR_DIG_TRG_SP1_REGISTER</description>
          <addressOffset>0x680</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOLTAGE_SETPOINT4</name>
              <description>VOLTAGE_SETPOINT4</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT5</name>
              <description>VOLTAGE_SETPOINT5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT6</name>
              <description>VOLTAGE_SETPOINT6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT7</name>
              <description>VOLTAGE_SETPOINT7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LDO_LPSR_DIG_TRG_SP2</name>
          <description>LDO_LPSR_DIG_TRG_SP2_REGISTER</description>
          <addressOffset>0x690</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOLTAGE_SETPOINT8</name>
              <description>VOLTAGE_SETPOINT8</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT9</name>
              <description>VOLTAGE_SETPOINT9</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT10</name>
              <description>VOLTAGE_SETPOINT10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOLTAGE_SETPOINT11</name>
              <description>VOLTAGE_SETPOINT11</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
