nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>BANDGAP_ENABLE_SP</name>
          <description>BANDGAP_ENABLE_SP_REGISTER</description>
          <addressOffset>0x6F0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ON_OFF_SETPOINT0</name>
              <description>ON_OFF_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT1</name>
              <description>ON_OFF_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT2</name>
              <description>ON_OFF_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT3</name>
              <description>ON_OFF_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT4</name>
              <description>ON_OFF_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT5</name>
              <description>ON_OFF_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT6</name>
              <description>ON_OFF_SETPOINT5</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT7</name>
              <description>ON_OFF_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT8</name>
              <description>ON_OFF_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT9</name>
              <description>ON_OFF_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT10</name>
              <description>ON_OFF_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT11</name>
              <description>ON_OFF_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT12</name>
              <description>ON_OFF_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT13</name>
              <description>ON_OFF_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT14</name>
              <description>ON_OFF_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT15</name>
              <description>ON_OFF_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBB_M7_ENABLE_SP</name>
          <description>FBB_M7_ENABLE_SP_REGISTER</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ON_OFF_SETPOINT0</name>
              <description>ON_OFF_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT1</name>
              <description>ON_OFF_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT2</name>
              <description>ON_OFF_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT3</name>
              <description>ON_OFF_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT4</name>
              <description>ON_OFF_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT5</name>
              <description>ON_OFF_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT6</name>
              <description>ON_OFF_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT7</name>
              <description>ON_OFF_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT8</name>
              <description>ON_OFF_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT9</name>
              <description>ON_OFF_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT10</name>
              <description>ON_OFF_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT11</name>
              <description>ON_OFF_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT12</name>
              <description>ON_OFF_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT13</name>
              <description>ON_OFF_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT14</name>
              <description>ON_OFF_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT15</name>
              <description>ON_OFF_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBB_SOC_ENABLE_SP</name>
          <description>RBB_SOC_ENABLE_SP_REGISTER</description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ON_OFF_SETPOINT0</name>
              <description>ON_OFF_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT1</name>
              <description>ON_OFF_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT2</name>
              <description>ON_OFF_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT3</name>
              <description>ON_OFF_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT4</name>
              <description>ON_OFF_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT5</name>
              <description>ON_OFF_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT6</name>
              <description>ON_OFF_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT7</name>
              <description>ON_OFF_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT8</name>
              <description>ON_OFF_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT9</name>
              <description>ON_OFF_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT10</name>
              <description>ON_OFF_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT11</name>
              <description>ON_OFF_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT12</name>
              <description>ON_OFF_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT13</name>
              <description>ON_OFF_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT14</name>
              <description>ON_OFF_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT15</name>
              <description>ON_OFF_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBB_LPSR_ENABLE_SP</name>
          <description>RBB_LPSR_ENABLE_SP_REGISTER</description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ON_OFF_SETPOINT0</name>
              <description>ON_OFF_SETPOINT0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT1</name>
              <description>ON_OFF_SETPOINT1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT2</name>
              <description>ON_OFF_SETPOINT2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT3</name>
              <description>ON_OFF_SETPOINT3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT4</name>
              <description>ON_OFF_SETPOINT4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT5</name>
              <description>ON_OFF_SETPOINT5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT6</name>
              <description>ON_OFF_SETPOINT6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT7</name>
              <description>ON_OFF_SETPOINT7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT8</name>
              <description>ON_OFF_SETPOINT8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT9</name>
              <description>ON_OFF_SETPOINT9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT10</name>
              <description>ON_OFF_SETPOINT10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT11</name>
              <description>ON_OFF_SETPOINT11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT12</name>
              <description>ON_OFF_SETPOINT12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT13</name>
              <description>ON_OFF_SETPOINT13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT14</name>
              <description>ON_OFF_SETPOINT14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ON_OFF_SETPOINT15</name>
              <description>ON_OFF_SETPOINT15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BANDGAP_STBY_EN_SP</name>
          <description>BANDGAP_STBY_EN_SP_REGISTER</description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_EN_SETPOINT0</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT1</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT2</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT3</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT4</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT5</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT6</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT7</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT8</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT9</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT10</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT11</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT12</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT13</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT14</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT15</name>
              <description>STBY_EN_SETPOINT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
