nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>PLL_LDO_STBY_EN_SP</name>
          <description>PLL_LDO_STBY_EN_SP_REGISTER</description>
          <addressOffset>0x740</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_EN_SETPOINT0</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT1</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT2</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT3</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT4</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT5</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT6</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT7</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT8</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT9</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT10</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT11</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT12</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT13</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT14</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT15</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBB_M7_STBY_EN_SP</name>
          <description>FBB_M7_STBY_EN_SP_REGISTER</description>
          <addressOffset>0x750</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_EN_SETPOINT0</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT1</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT2</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT3</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT4</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT5</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT6</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT7</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT8</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT9</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT10</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT11</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT12</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT13</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT14</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT15</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBB_SOC_STBY_EN_SP</name>
          <description>RBB_SOC_STBY_EN_SP_REGISTER</description>
          <addressOffset>0x760</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_EN_SETPOINT0</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT1</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT2</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT3</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT4</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT5</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT6</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT7</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT8</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT9</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT10</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT11</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT12</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT13</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT14</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT15</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBB_LPSR_STBY_EN_SP</name>
          <description>RBB_LPSR_STBY_EN_SP_REGISTER</description>
          <addressOffset>0x770</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_EN_SETPOINT0</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT1</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT2</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT3</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT4</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT5</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT6</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT7</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT8</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT9</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT10</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT11</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT12</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT13</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT14</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_EN_SETPOINT15</name>
              <description>1-STBY mode is enable 0-STBY mode is diable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FBB_M7_CONFIGURE</name>
          <description>FBB_M7_CONFIGURE_REGISTER</description>
          <addressOffset>0x780</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x2F11</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WB_CFG_PW</name>
              <description>wb_cfg_pw</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_CFG_NW</name>
              <description>wb_cfg_nw</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCILLATOR_BITS</name>
              <description>oscillator_bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGULATOR_STRENGTH</name>
              <description>regulator_strength</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RBB_LPSR_CONFIGURE</name>
          <description>RBB_LPSR_CONFIGURE_REGISTER</description>
          <addressOffset>0x790</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3022</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WB_CFG_PW</name>
              <description>wb_cfg_pw</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WB_CFG_NW</name>
              <description>wb_cfg_nw</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OSCILLATOR_BITS</name>
              <description>oscillator_bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGULATOR_STRENGTH</name>
              <description>regulator_strength</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
