nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>BPC_SSAR_ACK_CTRL</name>
          <description>BPC SSAR acknowledge control</description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAVE_CNT_CFG</name>
              <description>Save count configure, useage is depending on CNT_MODE, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESTORE_CNT_CFG</name>
              <description>Restore count configure, useage is depending on CNT_MODE, locked by LOCK_CFG field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_MODE</name>
              <description>Count mode</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CNT_MODE_0</name>
                  <description>Counter disable mode: not use counter, raise ssar_save/restore done response to GPC once received acknowledge from SSAR</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_1</name>
                  <description>Counter delay mode: delay after response received from SSAR, delay cycle number is SAVE/RESTORE_CNT_CFG</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_2</name>
                  <description>Ignore SSAR response, the delay counter starts to count once requests start</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once requests start, then raise ssar_done response to GPC when either acknowledge received or counting to SAVE/RESTORE_CNT_CFG value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>BPC_SSAR_ACK_STAT</name>
          <description>BPC SSAR acknowledge status</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SAVE_ACK_CNT</name>
              <description>Save acknowledge count, record the delay from SSAR save request to response received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RESTORE_ACK_CNT</name>
              <description>Restore acknowledge count, record the delay from SSAR restore request to response received</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BPC_MEM_CM_CTRL</name>
          <description>BPC memory CPU mode control</description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3330</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_AT_RUN</name>
              <description>Memory low power level at RUN mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_WAIT</name>
              <description>Memory low power level at WAIT mode, locked by LOCK_CFG field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_STOP</name>
              <description>Memory low power level at STOP mode, locked by LOCK_CFG field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SUSPEND</name>
              <description>Memory low power level at STOP mode, locked by LOCK_CFG field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_SOFT</name>
              <description>Memory low power level software change request, keep 1 until MLPL transition complete</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BPC_MEM_SP_CTRL_0</name>
          <description>BPC memory set point control 0</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_AT_SP0</name>
              <description>Memory low power level at set point 0, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP1</name>
              <description>Memory low power level at set point 1, locked by LOCK_CFG field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP2</name>
              <description>Memory low power level at set point 2, locked by LOCK_CFG field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP3</name>
              <description>Memory low power level at set point 3, locked by LOCK_CFG field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP4</name>
              <description>Memory low power level at set point 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP5</name>
              <description>Memory low power level at set point 5, locked by LOCK_CFG field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP6</name>
              <description>Memory low power level at set point 6</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP7</name>
              <description>Memory low power level at set point 7, locked by LOCK_CFG field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BPC_MEM_SP_CTRL_1</name>
          <description>BPC memory set point control 1</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x33333333</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MLPL_AT_SP8</name>
              <description>Memory low power level at set point 8, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP9</name>
              <description>Memory low power level at set point 9, locked by LOCK_CFG field</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP10</name>
              <description>Memory low power level at set point 10, locked by LOCK_CFG field</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP11</name>
              <description>Memory low power level at set point 11, locked by LOCK_CFG field</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP12</name>
              <description>Memory low power level at set point 12, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP13</name>
              <description>Memory low power level at set point 13, locked by LOCK_CFG field</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP14</name>
              <description>Memory low power level at set point 14, locked by LOCK_CFG field</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MLPL_AT_SP15</name>
              <description>Memory low power level at set point 15, locked by LOCK_CFG field</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BPC_MEM_STAT</name>
          <description>BPC memory status</description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x3</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CURRENT_MLPL</name>
              <description>Current low power level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Busy requesting low power level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BPC_FSM_STAT</name>
          <description>BPC FSM status</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ISO_STAT</name>
              <description>isolation FSM status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSW_STAT</name>
              <description>power switch FSM status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SAR_STAT</name>
              <description>SSAR FSM status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEM_STAT</name>
              <description>memory FSM status</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
