nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
      </registers>
    </peripheral>
    <peripheral derivedFrom="PGMC_CPC0">
      <name>PGMC_CPC1</name>
      <description>no description available</description>
      <groupName>PGMC_CPC</groupName>
      <baseAddress>0x40C8A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>PGMC_PPC0</name>
      <description>no description available</description>
      <groupName>PGMC_PPC</groupName>
      <baseAddress>0x40C8B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PPC_AUTHEN_CTRL</name>
          <description>PPC Authentication Control</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xF00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USER</name>
              <description>Allow user mode access</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONSECURE</name>
              <description>Allow non-secure mode access</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_SETTING</name>
              <description>Lock NONSECURE and USER</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WHITE_LIST</name>
              <description>Domain ID white list</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_LIST</name>
              <description>White list lock</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOCK_CFG</name>
              <description>Configuration lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPC_MODE</name>
          <description>PPC Mode</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CTRL_MODE</name>
              <description>Control mode, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CTRL_MODE_0</name>
                  <description>Not affected by any low power mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTRL_MODE_1</name>
                  <description>Controlled by CPU power mode of the domain</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTRL_MODE_2</name>
                  <description>Controlled by set point and system standby</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOMAIN_ASSIGN</name>
              <description>Domain assignment of the BPC</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPC_STBY_CM_CTRL</name>
          <description>PPC standby CPU mode control</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_ON_AT_WAIT</name>
              <description>PMIC Standby on when domain enters WAIT mode, locked by LOCK_CFG field</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_ON_AT_STOP</name>
              <description>PMIC Standby on when domain enters STOP mode, locked by LOCK_CFG field</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_ON_AT_SUSPEND</name>
              <description>PMIC Standby on when domain enters SUSPEND mode, locked by LOCK_CFG field</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_ON_SOFT</name>
              <description>Software PMIC standby on trigger</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_OFF_SOFT</name>
              <description>Software PMIC standby off trigger</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPC_STBY_SP_CTRL</name>
          <description>PPC standby set point control</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_ON_AT_SP_ACTIVE</name>
              <description>PMIC standby on when system enters set point number, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_ON_AT_SP_SLEEP</name>
              <description>PMIC standby on when system enters set point number and system is in standby mode, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPC_STBY_PRE_DLY_CTRL</name>
          <description>PPC standby pre delay control</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLY_PRE_STBY_ON</name>
              <description>Delay before pmic_standby on, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLY_PRE_STBY_OFF</name>
              <description>Delay before pmic_standby off, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPC_STBY_ACK_CTRL</name>
          <description>PPC standby acknowledge control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_ON_CNT_CFG</name>
              <description>PMIC standby on acknowledge count configure, useage is depending on STBY_ON_CNT_MODE, locked by LOCK_CFG field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_ON_CNT_MODE</name>
              <description>PMIC standby on acknowledge count mode, locked by LOCK_CFG field</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STBY_ON_CNT_MODE_0</name>
                  <description>Finish the process once pmic_standby signal changes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STBY_ON_CNT_MODE_1</name>
                  <description>Finish the process once getting acknowledge from PMIC</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STBY_ON_CNT_MODE_2</name>
                  <description>Ignore PMIC acknowledge, the delay counter starts to count once pmic_standby chang</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STBY_ON_CNT_MODE_3</name>
                  <description>Time out mode, the counter starts to count once pmic_standby changes, then finishes the process when either acknowledge received or counting to CNT_CFG value</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STBY_OFF_CNT_CFG</name>
              <description>PMIC standby off acknowledge count configure, useage is depending on STBY_OFF_CNT_MODE, locked by LOCK_CFG field</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STBY_OFF_CNT_MODE</name>
              <description>PMIC standby off acknowledge count mode, locked by LOCK_CFG field</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPC_STBY_ACK_STAT</name>
          <description>PPC standby acknowledge state</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STBY_ON_ACK_CNT</name>
              <description>Record the delay from pmic_standby on to acknowledge received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBY_OFF_ACK_CNT</name>
              <description>Record the delay from pmic_standby off to acknowledge received</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PPC_STBY_STAT</name>
          <description>PPC status</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CM_PMIC_REQUEST</name>
              <description>CPU mode trans pmic request of 4 domains</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_PMIC_DOWN_REQUEST</name>
              <description>Set point trans pmic down request</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_PMIC_UP_REQUEST</name>
              <description>Set point trans pmic up request</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBY_IN_REQUEST</name>
              <description>standby_pmic_in_request pin status</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBY_OUT_REQUEST</name>
              <description>standby_pmic_out_request pin status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CM_PMIC_DONE</name>
              <description>CPU mode trans pmic done of 4 domains</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_PMIC_DOWN_DONE</name>
              <description>Set point trans pmic down done</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SP_PMIC_UP_DONE</name>
              <description>Set point trans pmic up done</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBY_IN_DONE</name>
              <description>standby_pmic_in_done pin status</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBY_OUT_DONE</name>
              <description>standby_pmic_out_done pin status</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FSM_STAT</name>
              <description>standby FSM state</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMIC_STBY_PIN</name>
              <description>pmic_standby pin status</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PMIC_READY_PIN</name>
              <description>pmic_standby pin status</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
