nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>HPCOMR</name>
          <description>SNVS_HP Command Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SSM_ST</name>
              <description>SSM State Transition Transition state of the system security monitor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SSM_ST_DIS</name>
              <description>SSM Secure to Trusted State Transition Disable When set, disables the SSM transition from secure to trusted state</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Secure to Trusted State transition is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Secure to Trusted State transition is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSM_SFNS_DIS</name>
              <description>SSM Soft Fail to Non-Secure State Transition Disable When set, it disables the SSM transition from soft fail to non-secure state</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Soft Fail to Non-Secure State transition is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Soft Fail to Non-Secure State transition is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_SWR</name>
              <description>LP Software Reset When set to 1, most registers in the SNVS_LP section are reset, but the following registers are not reset by an LP software reset: Monotonic Counter Secure Real Time Counter Time Alarm Register This bit cannot be set when the LP_SWR_DIS bit is set</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION</name>
                  <description>No Action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>Reset LP section</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LP_SWR_DIS</name>
              <description>LP Software Reset Disable When set, disables the LP software reset</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>LP software reset is enabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>LP software reset is disabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_SV</name>
              <description>Software Security Violation When set, the system security monitor treats this bit as a non-fatal security violation</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_FSV</name>
              <description>Software Fatal Security Violation When set, the system security monitor treats this bit as a fatal security violation</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SW_LPSV</name>
              <description>LP Software Security Violation When set, SNVS_LP treats this bit as a security violation</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PROG_ZMK</name>
              <description>Program Zeroizable Master Key This bit activates ZMK hardware programming mechanism</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION</name>
                  <description>No Action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROGRAM_KEY</name>
                  <description>Activate hardware key programming mechanism</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MKS_EN</name>
              <description>Master Key Select Enable When not set, the one time programmable (OTP) master key is selected by default</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELECT_OTP</name>
                  <description>OTP master key is selected as an SNVS master key</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELECT_PER_LPMKCR</name>
                  <description>SNVS master key is selected according to the setting of the MASTER_KEY_SEL field of LPMKCR</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAC_EN</name>
              <description>High Assurance Counter Enable This bit controls the SSM transition from the soft fail to the hard fail state</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>High Assurance Counter is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>High Assurance Counter is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAC_LOAD</name>
              <description>High Assurance Counter Load When set, it loads the High Assurance Counter Register with the value of the High Assurance Counter Load Register</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION</name>
                  <description>No Action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOAD_HAC</name>
                  <description>Load the HAC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAC_CLEAR</name>
              <description>High Assurance Counter Clear When set, it clears the High Assurance Counter Register</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION</name>
                  <description>No Action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLEAR_HAC</name>
                  <description>Clear the HAC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAC_STOP</name>
              <description>High Assurance Counter Stop This bit can be set only when SSM is in soft fail state</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NPSWA_EN</name>
              <description>Non-Privileged Software Access Enable When set, allows non-privileged software to access all SNVS registers, including those that are privileged software read/write access only</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HPCR</name>
          <description>SNVS_HP Control Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTC_EN</name>
              <description>HP Real Time Counter Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>RTC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>RTC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPTA_EN</name>
              <description>HP Time Alarm Enable When set, the time alarm interrupt is generated if the value in the HP Time Alarm Registers is equal to the value of the HP Real Time Counter</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>HP Time Alarm Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>HP Time Alarm Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIS_PI</name>
              <description>Disable periodic interrupt in the functional interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Periodic interrupt will trigger a functional interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable periodic interrupt in the function interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PI_EN</name>
              <description>HP Periodic Interrupt Enable The periodic interrupt can be generated only if the HP Real Time Counter is enabled</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>HP Periodic Interrupt is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>HP Periodic Interrupt is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PI_FREQ</name>
              <description>Periodic Interrupt Frequency Defines frequency of the periodic interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USE_BIT_0</name>
                  <description>- bit 0 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_1</name>
                  <description>- bit 1 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_2</name>
                  <description>- bit 2 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_3</name>
                  <description>- bit 3 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_4</name>
                  <description>- bit 4 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_5</name>
                  <description>- bit 5 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_6</name>
                  <description>- bit 6 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_7</name>
                  <description>- bit 7 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_8</name>
                  <description>- bit 8 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_9</name>
                  <description>- bit 9 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_10</name>
                  <description>- bit 10 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_11</name>
                  <description>- bit 11 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_12</name>
                  <description>- bit 12 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_13</name>
                  <description>- bit 13 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_14</name>
                  <description>- bit 14 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USE_BIT_1r5</name>
                  <description>- bit 15 of the HPRTCLR is selected as a source of the periodic interrupt</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPCALB_EN</name>
              <description>HP Real Time Counter Calibration Enabled Indicates that the time calibration mechanism is enabled.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>HP Timer calibration disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>HP Timer calibration enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HPCALB_VAL</name>
              <description>HP Calibration Value Defines signed calibration value for the HP Real Time Counter</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADD_0_PER_32768_TICKS</name>
                  <description>+0 counts per each 32768 ticks of the counter</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD_1_PER_32768_TICKS</name>
                  <description>+1 counts per each 32768 ticks of the counter</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD_2_PER_32768_TICKS</name>
                  <description>+2 counts per each 32768 ticks of the counter</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADD_15_PER_32768_TICKS</name>
                  <description>+15 counts per each 32768 ticks of the counter</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_16_PER_32768_TICKS</name>
                  <description>-16 counts per each 32768 ticks of the counter</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_15_PER_32768_TICKS</name>
                  <description>-15 counts per each 32768 ticks of the counter</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_2_PER_32768_TICKS</name>
                  <description>-2 counts per each 32768 ticks of the counter</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUB_1_PER_32768_TICKS</name>
                  <description>-1 counts per each 32768 ticks of the counter</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HP_TS</name>
              <description>HP Time Synchronize</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ACTION</name>
                  <description>No Action</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC_TIME</name>
                  <description>Synchronize the HP Time Counter to the LP Time Counter</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BTN_CONFIG</name>
              <description>Button Configuration</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BTN_MASK</name>
              <description>Button interrupt mask</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
