nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
        <register>
          <name>GPR34</name>
          <description>GPR34 General Purpose Register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock the write to bit 31:1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>SNVS_CORE_VOLT_DET_TRIM_SEL</name>
              <description>SNVS core voltage detect trim select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_CORE_VOLT_DET_TRIM</name>
              <description>SNVS core voltage detect trim</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_CLK_DET_TRIM_SEL</name>
              <description>SNVS clock detect trim select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_CLK_DET_TRIM</name>
              <description>SNVS clock detect trim bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_CLK_DET_OFFSET_HIGH</name>
              <description>SNVS clock detect offset of high boundary frequency</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_CLK_DET_OFFSET_LOW</name>
              <description>SNVS clock detect offset of low boundary frequency</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_CAP_TRIM_SEL</name>
              <description>SNVS OSC load capacitor trim select</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_OSC_CAP_TRIM</name>
              <description>SNVS OSC load capacitor trim</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR35</name>
          <description>GPR35 General Purpose Register</description>
          <addressOffset>0x8C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock the write to bit 31:1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>SNVS_VOLT_DET_TRIM_SEL</name>
              <description>SNVS voltage detect trim select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_VOLT_DET_TRIM</name>
              <description>SNVS voltage detect trim</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_TEMP_DET_TRIM_SEL</name>
              <description>SNVS temperature detect trim select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_TEMP_DET_TRIM</name>
              <description>SNVS temperature detect trim</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_TEMP_DET_OFFSET_HIGH</name>
              <description>SNVS temperature detect offset of high temperature boundary</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_TEMP_DET_OFFSET_LOW</name>
              <description>SNVS temperature detect offset of low temperature boundary</description>
              <bitOffset>30</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR36</name>
          <description>GPR36 General Purpose Register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x4800000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SNVSDIG_SNVS1P8_ISO_EN</name>
              <description>SNVS RAM isolation enable bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_SRAM_SLEEP</name>
              <description>SNVS SRAM power-down enable bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_SRAM_STDBY</name>
              <description>SNVS SRAM standby enable bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_SRAM_PSWLARGEMP_FORCE</name>
              <description>SNVS SRAM large switch control bit for peripheral</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_SRAM_PSWLARGE</name>
              <description>SNVS SRAM large switch control bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_SRAM_PSWSMALLMP_FORCE</name>
              <description>SNVS SRAM small switch control bit for peripheral</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_SRAM_PSWSMALL</name>
              <description>SNVS SRAM small switch control bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPR37</name>
          <description>GPR37 General Purpose Register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LOCK</name>
              <description>Lock the write to bit 31:1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>SNVS_TAMPER_PUE</name>
              <description>SNVS tamper detect pin pull enable bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SNVS_TAMPER_PUS</name>
              <description>SNVS tamper detect pin pull selection bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
