nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>ROM</name>
      <description>ROMC</description>
      <groupName>ROM</groupName>
      <baseAddress>0x40CA4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>7,6,5,4,3,2,1,0</dimIndex>
          <name>ROMPATCHD%s</name>
          <description>ROMC Data Registers</description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATAX</name>
              <description>Data Fix Registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMPATCHCNTL</name>
          <description>ROMC Control Register</description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8400000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATAFIX0</name>
              <description>Data Fix Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch for ROMPATCHnA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix for ROMPATCHnA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX1</name>
              <description>Data Fix Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch for ROMPATCHnA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix for ROMPATCHnA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX2</name>
              <description>Data Fix Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch for ROMPATCHnA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix for ROMPATCHnA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX3</name>
              <description>Data Fix Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch for ROMPATCHnA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix for ROMPATCHnA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX4</name>
              <description>Data Fix Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch for ROMPATCHnA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix for ROMPATCHnA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX5</name>
              <description>Data Fix Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch for ROMPATCHnA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix for ROMPATCHnA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX6</name>
              <description>Data Fix Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch for ROMPATCHnA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix for ROMPATCHnA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAFIX7</name>
              <description>Data Fix Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPCODEPATCH</name>
                  <description>Trigger an opcode patch for ROMPATCHnA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATAFIX</name>
                  <description>Trigger a data fix for ROMPATCHnA</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIS</name>
              <description>ROMC Disable</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROMCENABLED</name>
                  <description>Does not affect any ROMC functions (default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ROMCDISABLED</name>
                  <description>Disables all ROMC functions: data fixing and opcode patching</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ROMPATCHENH</name>
          <description>ROMC Enable Register High</description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>ROMPATCHENL</name>
          <description>ROMC Enable Register Low</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE0</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE1</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE2</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE3</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE4</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE5</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE6</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE7</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE8</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE9</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE10</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE11</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE12</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE13</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE14</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENABLE15</name>
              <description>Enable Address Comparator n</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADDCOMPDISABLED</name>
                  <description>Address comparator n is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADDCOMPENABLED</name>
                  <description>Address comparator n is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ROMPATCHA[%s]</name>
          <description>ROMC Address Registers</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>THUMBX</name>
              <description>THUMB Comparator Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ARMPATCH</name>
                  <description>ARM patch</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>THUMBPATCH</name>
                  <description>THUMB patch (ignore if a data fix)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADDRX</name>
              <description>Address Comparator Registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>22</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
