nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SSARC_HP</name>
      <description>SRAM Registers</description>
      <groupName>SSARC_HP</groupName>
      <baseAddress>0x40CB4000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7FFC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <dim>1024</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>DESC[%s]</name>
          <description>no description available</description>
          <addressOffset>0x10</addressOffset>
          <register>
            <name>SRAM0_</name>
            <description>Description Address index Register</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>ADDR</name>
                <description>Address field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRAM1_</name>
            <description>Description Data index Register</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>SRAM2_</name>
            <description>Description index Register</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0</resetMask>
            <fields>
              <field>
                <name>TYPE</name>
                <description>Type field</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SR</name>
                    <description>read the register value on save operation and write it back on restore operation</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WO</name>
                    <description>always write a fixed value from DATA[31:0]</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RMW_OR</name>
                    <description>read register, OR with the DATA[31:0], and write it back</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RMW_AND</name>
                    <description>read register, AND with the DATA[31:0], and write it back</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DELAY</name>
                    <description>delay for number of cycles based on the DATA[31:0]</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POLLING_0</name>
                    <description>read the register until read_data[31:0] &amp; DATA[31:0] == 0</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>POLLING_1</name>
                    <description>read the register until read_data[31:0] &amp; DATA[31:0] != 0</description>
                    <value>0x6</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SV_EN</name>
                <description>SV Enable</description>
                <bitOffset>4</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>RT_EN</name>
                <description>RT Enable</description>
                <bitOffset>5</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>SIZE</name>
                <description>Size field</description>
                <bitOffset>6</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
      </registers>
    </peripheral>
    <peripheral>
      <name>SSARC_LP</name>
      <description>SSARC Registers</description>
      <groupName>SSARC_LP</groupName>
      <baseAddress>0x40CB8000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x224</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>DESC_CTRL0_0</name>
          <description>Descriptor Control0 0 Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Start index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END</name>
              <description>End index</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SV_ORDER</name>
              <description>Save Order</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SV_START_END</name>
                  <description>Descriptors within the group are processed from start to end</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SV_END_START</name>
                  <description>Descriptors within the group are processed from end to start</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT_ORDER</name>
              <description>Restore order</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT_START_END</name>
                  <description>Descriptors within the group are processed from start to end</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_END_START</name>
                  <description>Descriptors within the group are processed from end to start</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DESC_CTRL1_0</name>
          <description>Descriptor Control1 0 Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SW_TRIG_SV</name>
              <description>Software trigger save</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ_NO</name>
                  <description>No software save request/software restore request complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_YES</name>
                  <description>Request a software save operation/software restore operation in progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SW_TRIG_RT</name>
              <description>Software trigger restore</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REQ_NO</name>
                  <description>No software restore request/software restore request complete</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REQ_YES</name>
                  <description>Request a software restore operation/software restore operation in progress</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POWER_DOMAIN</name>
              <description>This field describes the mapping (0-7) to external request signals from different domains</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GP_EN</name>
              <description>Group Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GP_DIS</name>
                  <description>Group disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GP_EN</name>
                  <description>Group enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SV_PRIORITY</name>
              <description>Save Priority</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT_PRIORITY</name>
              <description>Restore Priority</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESD</name>
              <description>Restore Domain</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RL</name>
              <description>Read Lock</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>R_UNLOCK</name>
                  <description>Group is unlocked (write access allowed)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>R_LOCK</name>
                  <description>Group is locked (write access not allowed)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WL</name>
              <description>Write Lock</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>W_UNLOCK</name>
                  <description>Group is unlocked (write access allowed)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>W_LOCK</name>
                  <description>Group is locked (write access not allowed)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DL</name>
              <description>Domain lock</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>D_UNLOCK</name>
                  <description>Unlock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>D_LOCK</name>
                  <description>Lock</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DESC_ADDR_UP_0</name>
          <description>Descriptor Address Up 0 Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_UP</name>
              <description>Address field (High)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESC_ADDR_DOWN_0</name>
          <description>Descriptor Address Down 0 Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ADDR_DOWN</name>
              <description>Address field (Low)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DESC_CTRL0_1</name>
          <description>Descriptor Control0 1 Register</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>START</name>
              <description>Start index</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>END</name>
              <description>End index</description>
              <bitOffset>10</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SV_ORDER</name>
              <description>Save Order</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SV_START_END</name>
                  <description>Descriptors within the group are processed from start to end</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SV_END_START</name>
                  <description>Descriptors within the group are processed from end to start</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RT_ORDER</name>
              <description>Restore order</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT_START_END</name>
                  <description>Descriptors within the group are processed from start to end</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT_END_START</name>
                  <description>Descriptors within the group are processed from end to start</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
