nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
          <register>
            <name>CLOCK_ROOT_OPTIONS1</name>
            <description>Clock root low power status</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>OPTION4</name>
                <description>Clock input option4</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPTION4_0</name>
                    <description>OSC_RC_16M</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_1</name>
                    <description>OSC_RC_48M</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_2</name>
                    <description>OSC_RC_48M_DIV2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_3</name>
                    <description>OSC_RC_400M</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_5</name>
                    <description>OSC_24M_OUT</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_7</name>
                    <description>PLL_ARM_OUT</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_9</name>
                    <description>PLL_528_OUT</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_10</name>
                    <description>PLL_528_PFD0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_11</name>
                    <description>PLL_528_PFD1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_12</name>
                    <description>PLL_528_PFD2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_13</name>
                    <description>PLL_528_PFD3</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_15</name>
                    <description>PLL_480_OUT</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_16</name>
                    <description>PLL_480_DIV2</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_17</name>
                    <description>PLL_480_PFD0</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_18</name>
                    <description>PLL_480_PFD1</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_19</name>
                    <description>PLL_480_PFD2</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_20</name>
                    <description>PLL_480_PFD3</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_22</name>
                    <description>PLL_1G_OUT</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_23</name>
                    <description>PLL_1G_DIV2</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_24</name>
                    <description>PLL_1G_DIV5</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_26</name>
                    <description>PLL_AUDIO_OUT</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION4_28</name>
                    <description>PLL_VIDEO_OUT</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OPTION5</name>
                <description>Clock input option 5</description>
                <bitOffset>8</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPTION5_0</name>
                    <description>OSC_RC_16M</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_1</name>
                    <description>OSC_RC_48M</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_2</name>
                    <description>OSC_RC_48M_DIV2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_3</name>
                    <description>OSC_RC_400M</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_5</name>
                    <description>OSC_24M_OUT</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_7</name>
                    <description>PLL_ARM_OUT</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_9</name>
                    <description>PLL_528_OUT</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_10</name>
                    <description>PLL_528_PFD0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_11</name>
                    <description>PLL_528_PFD1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_12</name>
                    <description>PLL_528_PFD2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_13</name>
                    <description>PLL_528_PFD3</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_15</name>
                    <description>PLL_480_OUT</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_16</name>
                    <description>PLL_480_DIV2</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_17</name>
                    <description>PLL_480_PFD0</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_18</name>
                    <description>PLL_480_PFD1</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_19</name>
                    <description>PLL_480_PFD2</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_20</name>
                    <description>PLL_480_PFD3</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_22</name>
                    <description>PLL_1G_OUT</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_23</name>
                    <description>PLL_1G_DIV2</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_24</name>
                    <description>PLL_1G_DIV5</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_26</name>
                    <description>PLL_AUDIO_OUT</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION5_28</name>
                    <description>PLL_VIDEO_OUT</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OPTION6</name>
                <description>Clock input option 6</description>
                <bitOffset>16</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPTION6_0</name>
                    <description>OSC_RC_16M</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_1</name>
                    <description>OSC_RC_48M</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_2</name>
                    <description>OSC_RC_48M_DIV2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_3</name>
                    <description>OSC_RC_400M</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_5</name>
                    <description>OSC_24M_OUT</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_7</name>
                    <description>PLL_ARM_OUT</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_9</name>
                    <description>PLL_528_OUT</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_10</name>
                    <description>PLL_528_PFD0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_11</name>
                    <description>PLL_528_PFD1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_12</name>
                    <description>PLL_528_PFD2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_13</name>
                    <description>PLL_528_PFD3</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_15</name>
                    <description>PLL_480_OUT</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_16</name>
                    <description>PLL_480_DIV2</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_17</name>
                    <description>PLL_480_PFD0</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_18</name>
                    <description>PLL_480_PFD1</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_19</name>
                    <description>PLL_480_PFD2</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_20</name>
                    <description>PLL_480_PFD3</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_22</name>
                    <description>PLL_1G_OUT</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_23</name>
                    <description>PLL_1G_DIV2</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_24</name>
                    <description>PLL_1G_DIV5</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_26</name>
                    <description>PLL_AUDIO_OUT</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION6_28</name>
                    <description>PLL_VIDEO_OUT</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OPTION7</name>
                <description>Clock input option 7</description>
                <bitOffset>24</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-only</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OPTION7_0</name>
                    <description>OSC_RC_16M</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_1</name>
                    <description>OSC_RC_48M</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_2</name>
                    <description>OSC_RC_48M_DIV2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_3</name>
                    <description>OSC_RC_400M</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_5</name>
                    <description>OSC_24M_OUT</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_7</name>
                    <description>PLL_ARM_OUT</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_9</name>
                    <description>PLL_528_OUT</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_10</name>
                    <description>PLL_528_PFD0</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_11</name>
                    <description>PLL_528_PFD1</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_12</name>
                    <description>PLL_528_PFD2</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_13</name>
                    <description>PLL_528_PFD3</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_15</name>
                    <description>PLL_480_OUT</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_16</name>
                    <description>PLL_480_DIV2</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_17</name>
                    <description>PLL_480_PFD0</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_18</name>
                    <description>PLL_480_PFD1</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_19</name>
                    <description>PLL_480_PFD2</description>
                    <value>0x13</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_20</name>
                    <description>PLL_480_PFD3</description>
                    <value>0x14</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_22</name>
                    <description>PLL_1G_OUT</description>
                    <value>0x16</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_23</name>
                    <description>PLL_1G_DIV2</description>
                    <value>0x17</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_24</name>
                    <description>PLL_1G_DIV5</description>
                    <value>0x18</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_26</name>
                    <description>PLL_AUDIO_OUT</description>
                    <value>0x1A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OPTION7_28</name>
                    <description>PLL_VIDEO_OUT</description>
                    <value>0x1C</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
