nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>XRDC2_D0</name>
      <description>D_IP_XRDC2_SYN</description>
      <groupName>XRDC2</groupName>
      <headerStructName>XRDC2</headerStructName>
      <baseAddress>0x40CE0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xFFFC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MCR</name>
          <description>Module Control Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GVLDM</name>
              <description>Global Valid MDAC</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GVLDM_0</name>
                  <description>MDACs are disabled. DID and SID set to 0 for all transactions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GVLDM_1</name>
                  <description>MDACs are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GVLDC</name>
              <description>Global Valid Access Control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GVLDC_0</name>
                  <description>Access controls are disabled, XRDC2 allows all transactions.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GVLDC_1</name>
                  <description>Access controls are enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GCL</name>
              <description>Global Configuration Lock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GCL_0</name>
                  <description>Lock disabled, registers can be written by any domain.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCL_1</name>
                  <description>Lock disabled until the next reset, registers can be written by any domain.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCL_2</name>
                  <description>Lock enabled, only the global configuration lock owner (SR[GCLO]) can write to registers.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCL_3</name>
                  <description>Lock enabled, all registers are read only until the next reset.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Status Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DID</name>
              <description>Domain identifier number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HRL</name>
              <description>Hardware Revision Level</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GCLO</name>
              <description>Global Configuration Lock Owner</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>128</dim>
          <dimIncrement>0x8</dimIncrement>
          <name>msci_msac_wk[%s]</name>
          <description>no description available</description>
          <addressOffset>0x1000</addressOffset>
          <register>
            <name>MSC_MSAC_W0</name>
            <description>Memory Slot Access Control</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>D0ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D1ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>3</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D2ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>6</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D3ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>9</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D4ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D5ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>15</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D6ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>18</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D7ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>21</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EALO</name>
                <description>Exclusive Access Lock Owner</description>
                <bitOffset>24</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MSC_MSAC_W1</name>
            <description>Memory Slot Access Control</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>D8ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D9ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>3</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D10ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>6</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D11ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>9</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D12ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>12</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D13ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>15</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D14ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>18</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>D15ACP</name>
                <description>Domain &quot;x&quot; access control policy</description>
                <bitOffset>21</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>EAL</name>
                <description>Exclusive Access Lock</description>
                <bitOffset>24</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>EAL_0</name>
                    <description>Lock disabled.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EAL_1</name>
                    <description>Lock disabled until next reset.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EAL_2</name>
                    <description>Lock enabled, lock state = available.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>EAL_3</name>
                    <description>Lock enabled, lock state = not available.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>DL2</name>
                <description>Descriptor Lock</description>
                <bitOffset>29</bitOffset>
                <bitWidth>2</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>DL2_0</name>
                    <description>Lock disabled, descriptor registers can be written.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DL2_1</name>
                    <description>Lock disabled until the next reset, descriptor registers can be written.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DL2_2</name>
                    <description>Lock enabled, only domain &quot;x&quot; can only update the DxACP field; no other fields can be written.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>DL2_3</name>
                    <description>Lock enabled, descriptor registers are read-only until the next reset.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>VLD</name>
                <description>Valid</description>
                <bitOffset>31</bitOffset>
                <bitWidth>1</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>VLD_0</name>
                    <description>The MSAC assignment is invalid.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>VLD_1</name>
                    <description>The MSAC assignment is valid.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>32</dim>
          <dimIncrement>0x100</dimIncrement>
          <name>mdaci[%s]</name>
          <description>no description available</description>
          <addressOffset>0x2000</addressOffset>
          <cluster>
            <dim>32</dim>
            <dimIncrement>0x8</dimIncrement>
            <name>mdaci_mdaj[%s]</name>
            <description>no description available</description>
            <addressOffset>0</addressOffset>
            <register>
              <name>MDAC_MDA_W0</name>
              <description>Master Domain Assignment</description>
              <addressOffset>0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>MASK</name>
                  <description>Mask</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>MATCH</name>
                  <description>Match</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-write</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MDAC_MDA_W1</name>
              <description>Master Domain Assignment</description>
              <addressOffset>0x4</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>SID</name>
                  <description>Stream Identifier</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>16</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>DID</name>
                  <description>Domain Identifier</description>
                  <bitOffset>16</bitOffset>
                  <bitWidth>4</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>PA</name>
                  <description>Privileged attribute</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>PA_0</name>
                      <description>Use the bus master's privileged/user attribute directly.</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PA_1</name>
                      <description>Use the bus master's privileged/user attribute directly. Also, drive to the SID[0] output signal.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PA_2</name>
                      <description>Force the bus attribute for this master to user.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>PA_3</name>
                      <description>Force the bus attribute for this master to privileged.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>SA</name>
                  <description>Secure attribute</description>
                  <bitOffset>26</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SA_0</name>
                      <description>Use the bus master's secure/nonsecure attribute directly.</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SA_1</name>
                      <description>Use the bus master's secure/nonsecure attribute directly. Also, drive to the SID[1] output signal.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SA_2</name>
                      <description>Force the bus attribute for this master to secure.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SA_3</name>
                      <description>Force the bus attribute for this master to nonsecure.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DL</name>
                  <description>Descriptor Lock</description>
                  <bitOffset>30</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DL_0</name>
                      <description>Lock disabled, registers can be written.</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DL_1</name>
                      <description>Lock enabled, registers are read-only until the next reset.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>VLD</name>
                  <description>Valid</description>
                  <bitOffset>31</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>VLD_0</name>
                      <description>The MDA is invalid.</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>VLD_1</name>
                      <description>The MDA is valid.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
