nxp-appcodehub/dm-ml-openart/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/MIMXRT1176_cm4.xml
            <register>
              <name>MRC_MRGD_W6</name>
              <description>Memory Region Descriptor</description>
              <addressOffset>0x18</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0</resetValue>
              <resetMask>0xFFFFFFFF</resetMask>
              <fields>
                <field>
                  <name>D8ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>0</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D9ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>3</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D10ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>6</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D11ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>9</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D12ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>12</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D13ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>15</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D14ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>18</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>D15ACP</name>
                  <description>Domain &quot;x&quot; access control policy</description>
                  <bitOffset>21</bitOffset>
                  <bitWidth>3</bitWidth>
                  <access>read-write</access>
                </field>
                <field>
                  <name>EAL</name>
                  <description>Exclusive Access Lock</description>
                  <bitOffset>24</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>EAL_0</name>
                      <description>Lock disabled.</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EAL_1</name>
                      <description>Lock disabled until next reset.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EAL_2</name>
                      <description>Lock enabled, lock state = available.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EAL_3</name>
                      <description>Lock enabled, lock state = not available.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DL2</name>
                  <description>Descriptor Lock</description>
                  <bitOffset>29</bitOffset>
                  <bitWidth>2</bitWidth>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DL2_0</name>
                      <description>Lock disabled, descriptor registers can be written.</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DL2_1</name>
                      <description>Lock disabled until the next reset, descriptor registers can be written.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DL2_2</name>
                      <description>Lock enabled, only domain &quot;x&quot; can only update the DxACP field; no other fields can be written.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>DL2_3</name>
                      <description>Lock enabled, descriptor registers are read-only until the next reset.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>VLD</name>
                  <description>Valid</description>
                  <bitOffset>31</bitOffset>
                  <bitWidth>1</bitWidth>
                  <access>read-write</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>VLD_0</name>
                      <description>The MRGD is invalid.</description>
                      <value>0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>VLD_1</name>
                      <description>The MRGD is valid.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
